exports.getById = function(id){
   return HY_ACHIEVES[id.toString()];
};

exports.get = function(){
	return HY_ACHIEVES;
}


// 	1 DEMAND : [
// 		{
// 			"type" : 1,//击杀
// 			"item" : "1001#1002",//武器id，用#链接多个武器
// 			"value": 10,//击杀数量
// 			"monster" : 1001,//怪物种类id
// 		},
// 		{
// 			"type" : 2,//损坏
// 			"item" : 1001,//武器id, -1表示任意种类
// 			"value": 10,//损坏数量
// 		},
// 		{
// 			"type" : 3,//炸弹哑火
// 			"value": 10,//哑火次数
// 		},
// 		{
// 			"type" : 4,//回收箭矢
// 			"value": 10,//回收次数
// 		},
// 		{
// 			"type" : 5,//击杀具体怪物
// 			"item" : "1001#1002",//武器id，用#链接多个武器，-1表示不限制
// 			"value": 10,//击杀数量
// 			"monster" : 1001,//怪物id
// 		},
// 	],
// 	2 DEMAND : [
// 		{
// 			"type" : 1,//生存天数
// 			"value": 10,//生存天数
// 		},
// 		{
// 			"type" : 2,//制作
// 			"item" : "1001#1002",//武器id，用#链接多个武器
// 			"value": 10,//数量
// 		},
// 		{
// 			"type" : 3,//钓鱼
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 4,//陷阱生效
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 5,//与白狼生活
// 			"value": 10,//天数
// 		},
// 		{
// 			"type" : 6,//食用物品
// 			"item" : "1001#1002",//物品类型，0表示任意类型，多个用#分开
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 7,//复活
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 8,//钓鱼
// 			"item" : "1001#1002",//收获类型，0表示任意类型，多个用#分开
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 9,//累计在钓鱼时成功获得道具
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 10,//累计在钓鱼时触发事件
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 11,//死亡
// 			"item" : "1",//死亡原因 1-战死，2-饿死，3-冻死，4-伤死
// 			"value": 10,//次数
// 		},
// 	],
// 	3 DEMAND : [
// 		{
// 			"type" : 1,//隐藏关卡
// 			"value": 10,//探索次数
// 		},
// 		{
// 			"type" : 2,//迷失方向
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 3,//遇袭
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 4,//解锁剧情图鉴
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 5,//解锁生物图鉴
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 6,//解锁物品图鉴
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 7,//解锁鱼类图鉴
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 8,//沉船层数
// 			"value": 10,//层数
// 		},
// 		{
// 			"type" : 9,//日记
// 			"value": 10,//篇数
// 		},
// 		{
// 			"type" : 10,//逃出
// 			"value": 10,//次数
// 		},
// 		{
// 			"type" : 11,//解锁角色
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 12,//解锁天赋
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 13,//成就点数
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 14,//获得罗兰食谱
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 15,//获得老贝草裙
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 16,//获得劳拉长弓
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 17,//集齐神秘圆球
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 18,//获得小哥的手电
// 			"value": 10,//个数
// 		},
// 		{
// 			"type" : 19,//发现遗言次数
// 			"value": 10,//
// 		},
// 		{
// 			"type" : 20,//发现遗物次数
// 			"value": 10,//
// 		},	
// 		{
// 			"type" : 21,//进入崖洞次数
// 			"value": 10,//
// 		},	
// 		{
// 			"type" : 22,//进入遗迹次数
// 			"value": 10,//
// 		},	
// 		{
// 			"type" : 23,//签到次数
// 			"value": 10,//
// 		},
// 	],
// 	EFFECT : [
// 		{
// 			"type" : 1,//赠送物品
// 			"item" : 1001,//物品id
// 			"value": 100,//物品数量
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 		{
// 			"type" : 2,//命中率
// 			"item" : "1001#1002",//武器id
// 			"value": 10,//提升幅度
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 		{
// 			"type" : 3,//暴击率
// 			"item" : 1001,//怪物种类id
// 			"value": 10,//提升幅度
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 		{
// 			"type" : 4,//耐久武器成功率
// 			"value": 10,//提升幅度
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 		{
// 			"type" : 5,//美味食物成功率
// 			"value": 10,//提升幅度
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 		{
// 			"type" : 6,//钓鱼收获概率
// 			"value": 10,//提升幅度
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 		{
// 			"type" : 7,//陷阱成功率
// 			"value": 10,//提升幅度
// 			"desc" : "开局附赠{count}个草药",
// 		},
// 	],

var HY_ACHIEVES = {
	"1001" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "捕猎专家",
		DESC : "累计击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "-1",
			"monster" : 0,
			"value" : [20,400,2000],
		},
		EFFECT : {
			"type" : 1,//赠送物品
			"item" : 4013,//物品id
			"desc" : "开局附赠{0}个草药",
			"value": [2,4,8],//物品数量
		},
		POINT : [1,2,3],
	},
	"1002" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "武术专家",
		DESC : "累计空手击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "0",
			"monster" : 0,
			"value" : [20,150,350],
		},
		EFFECT :{
			"type" : 2,//命中率
			"item" : "0",//武器id
			"value": [3,6,10],//提升幅度
			"desc" : "空手时命中率增加{0}%",
		},
		POINT : [1,2,3],
	},	
	"1003" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "斧头专家",
		DESC : "累计使用斧头击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4100#4100_1#4112#4112_1",
			"monster" : 0,
			"value" : [20,200,1000],
		},
		EFFECT :{
			"type" : 2,//命中率
			"item" : "4100#4100_1#4112#4112_1",//武器id
			"value": [3,6,10],//提升幅度
			"desc" : "使用斧头时命中率增加{0}%",
		},
		POINT : [1,2,3],
	},	

	"1004" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "穷途匕现",
		DESC : "累计使用匕首击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4101",
			"monster" : 0,
			"value" : [20,150,350],
		},
		EFFECT :{
			"type" : 2,//命中率
			"item" : "4101",//武器id
			"value": [3,6,10],//提升幅度
			"desc" : "使用匕首时命中率增加{0}%",
		},
		POINT : [1,2,3],
	},

	"1005" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "竹枪非枪",
		DESC : "累计使用竹枪击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4113#4113_1",
			"monster" : 0,
			"value" : [20,200,1000],
		},
		EFFECT :{
			"type" : 2,//命中率
			"item" : "4113",//武器id
			"value": [3,6,10],//提升幅度
			"desc" : "使用竹枪时命中率增加{0}%",
		},
		POINT : [1,2,3],
	},

	"1006" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "百步穿杨",
		DESC : "累计使用弓弩击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4104#4104_1#4105#4105_1#4106#4106_1#4115#4120#4120_1",
			"monster" : 0,
			"value" : [20,200,1000],
		},
		EFFECT :{
			"type" : 2,//命中率
			"item" : "4104#4104_1#4105#4105_1#4106#4106_1#4115#4120#4120_1",//武器id
			"value": [3,6,10],//提升幅度
			"desc" : "使用弓弩时命中率增加{0}%",
		},
		POINT : [1,2,3],
	},

	"1007" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "刀斩肉身",
		DESC : "累计使用武士刀击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4103",
			"monster" : 0,
			"value" : [20,200,1000],
		},
		EFFECT :{
			"type" : 2,//命中率
			"item" : "4103",//武器id
			"value": [3,6,10],//提升幅度
			"desc" : "使用武士刀时命中率增加{0}%",
		},
		POINT : [1,2,3],
	},

	"1008" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "爆炸艺术",
		DESC : "累计使用炸药击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4117#4118",
			"monster" : 0,
			"value" : [20,150,350],
		},
		EFFECT :{
				
		},
		POINT : [1,2,3],
	},

	"1009" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎狼者",
		DESC : "累计击杀{0}只狼",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 1,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "1",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击狼类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1010" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎猪者",
		DESC : "累计击杀{0}只野猪",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 2,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "2",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击野猪类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1011" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎鱼者",
		DESC : "累计击杀{0}只食人鱼",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 3,//怪物种类id
			"value" : [15,100,500],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "3",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击食人鱼类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1012" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎熊者",
		DESC : "累计击杀{0}只熊",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 4,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "4",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击熊类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1013" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎鳄者",
		DESC : "累计击杀{0}只鳄鱼",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 5,//怪物种类id
			"value" : [15,100,500],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "5",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击鳄鱼类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1014" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎蛇者",
		DESC : "累计击杀{0}只蛇",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 6,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "6",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击蛇类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1015" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎虎者",
		DESC : "累计击杀{0}只虎",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 7,//怪物种类id
			"value" : [15,100,500],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "7",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击虎类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1016" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎鲨者",
		DESC : "累计击杀{0}只鲨鱼",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 9,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "9",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击鲨鱼类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1017" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎蜥者",
		DESC : "累计击杀{0}只蜥蜴",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 11,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "11",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击蜥蜴类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},	

	"1018" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "猎头者",
		DESC : "累计击杀{0}个人类",
		DEMAND : {
			"type" : 1,//类型击杀
			"item" : "-1",//使用武器ID，-1表示不限
			"monster" : 8,//怪物种类id
			"value" : [30,200,1000],
		},
		EFFECT :{
			"type" : 3,//类型暴击率
			"item" : "8",//怪物种类id
			"value": [3,6,10],//提升幅度
			"desc" : "攻击人类野兽时{0}%概率击中要害",
		},
		POINT : [1,2,3],
	},

	"1019" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "群星之怒",
		DESC : "单局使用硬竹弓击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4106#4106_1",
			"monster" : 0,
			"value" : [100],
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1020" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "刺客信条",
		DESC : "单局使用匕首击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4101",
			"monster" : 0,
			"value" : [30],
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1021" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "武松？！",
		DESC : "单局空手击杀{0}只老虎",
		DEMAND : {
			"type" : 1,
			"item" : "0",
			"monster" : 7,
			"value" : [1],
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1022" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "冷面寒枪",
		DESC : "单局使用竹枪击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4113#4113_1",
			"monster" : 0,
			"value" : [100],
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1023" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "白虎牙断",
		DESC : "单局使用斧头击杀{0}只动物",
		DEMAND : {
			"type" : 1,
			"item" : "4100#4100_1#4112#4112_1",
			"monster" : 0,
			"value" : [100],
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1024" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "交响之乐",
		DESC : "累计空炸{0}次",
		DEMAND : {
			"type" : 3,//炸弹哑火
	 		"value": [50],//哑火次数
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1025" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "箭海无涯",
		DESC : "累计回收{0}支箭",
		DEMAND : {
			"type" : 4,//回收箭矢
			"value": [200],//回收次数
		},
		EFFECT :{

		},
		POINT : [3],
	},

	"1026" : {
		TYPE : 1,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "心斩灵魂",
		DESC : "累计损坏{0}把武士刀",
		DEMAND : {
			"type" : 2,//损坏
			"item" : 4103,//武器id
			"value": [30],//损坏数量
		},
		EFFECT :{

		},
		POINT : [3],
	},










	"2001" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "荒野求生",
		DESC : "单局生存达到{0}天",
		DEMAND : {
			"type" : 1,//生存天数
			"value": [3,40,100],//生存天数
		},
		EFFECT : {
			"type" : 1,//赠送物品
			"item" : 4025,//物品id
			"value": [2,4,8],//物品数量
			"desc" : "开局附赠{0}个烤肉",
		},
		POINT : [1,2,3],
	},

	"2002" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "十步一杀",
		DESC : "累计制作{0}把近战武器",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4100#4100_1#4112#4112_1#4113#4113_1",//武器id，用-链接多个武器
			"value": [7,40,500],//数量
		},
		EFFECT : {
			"type" : 4,//耐久武器成功率
			"value": [3,6,10],//提升幅度
			"desc" : "制作工具时得到耐久的工具的概率增加{0}%",
		},
		POINT : [1,2,3],
	},


	"2003" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "寸长寸强",
		DESC : "累计制作{0}把远程武器",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4104#4104_1#4105#4105_1#4106#4106_1#4115#4115_1#4120#4120_1",//武器id，用-链接多个武器
			"value": [3,20,200],//数量
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},


	"2004" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "军火贩子",
		DESC : "累计制作{0}个炸药",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4117#4118",//武器id，用-链接多个武器
			"value": [3,20,200],//数量
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"2005" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "无米之炊",
		DESC : "累计烹饪{0}个食物",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4025#4025_1#4026#4026_1#4040#4040_1#4041#4041_1#4043#4043_1#4070#4070_1",//武器id，用-链接多个武器
			"value": [30,200,1000],//数量
		},
		EFFECT : {
			"type" : 5,//美味食物成功率
			"value": [3,6,10],//提升幅度
			"desc" : "烹饪食物时得到美味的食物的概率增加{0}%",
		},
		POINT : [1,2,3],
	},

	"2006" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "妙手回春",
		DESC : "累计制作{0}个药品",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4016#4017#4024#4018#4019",//武器id，用-链接多个武器
			"value": [10,100,500],//数量
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"2007" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "愚者垂纶",
		DESC : "累计尝试钓鱼{0}次",
		DEMAND : {
			"type" : 3,//钓鱼
			"value": [20,200,800],//次数
		},
		EFFECT : {
			"type" : 6,//钓鱼收获概率
			"value": [3,6,10],//提升幅度
			"desc" : "钓鱼时无收获概率降低{0}%",
		},
		POINT : [1,2,3],
	},

	"2008" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "愿者上钩",
		DESC : "累计在钓鱼时成功获得鱼类{0}次",
		DEMAND : {
			"type" : 8,//钓鱼
			"value": [10,100,1000],//次数
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"2009" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "意外收获",
		DESC : "累计在钓鱼时成功获得道具{0}次",
		DEMAND : {
			"type" : 9,//钓鱼
			"value": [5,50,500],//次数
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"2010" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "海猫鸣泣",
		DESC : "累计在钓鱼时触发事件{0}次",
		DEMAND : {
			"type" : 10,//钓鱼
			"value": [5,50,500],//次数
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"2011" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "守株待兔",
		DESC : "累计利用陷阱成功捕获到猎物{0}次",
		DEMAND : {
			"type" : 4,//陷阱
			"value": [10,100,500],//次数
		},
		EFFECT : {
			"type" : 7,//陷阱成功率
			"value": [3,6,10],//提升幅度
			"desc" : "陷阱成功捕获到猎物概率增加{0}%",
		},
		POINT : [1,2,3],
	},

	"2012" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "普罗修斯",
		DESC : "累计制作{0}个火把",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4114",//武器id，用-链接多个武器
			"value": [10,100,400],//次数
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"2013" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "与狼共舞",
		DESC : "累计与白狼生活{0}天",
		DEMAND : {
			"type" : 5,//与白狼生活
			"value": [50,200,500],//天数
		},
		EFFECT : {
				
		},
		POINT : [1,2,3],
	},

	"2014" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "饱食之椰",
		DESC : "累计食用{0}个椰子",
		DEMAND : {
			"type" : 6,//食用椰子
			"value": [30,100,500],//天数
		},
		EFFECT : {
				
		},
		POINT : [1,2,3],
	},

	"2015" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "氪金土豪",
		DESC : "累计复活{0}次",
		DEMAND : {
			"type" : 7,//复活
			"value": [100],//天数
		},
		EFFECT : {
				
		},
		POINT : [3],
	},

	"2016" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "巧手为炊",
		DESC : "累计烹饪出{0}个美味食物",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4025_1#4070_1#4040_1#4026_1#4041_1#4043_1",//武器id，用-链接多个武器
			"value": [30],//数量
		},
		EFFECT : {
				
		},
		POINT : [3],
	},

	"2017" : {
		TYPE : 2,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "班门学斧",
		DESC : "累计制作出{0}把耐久的武器",
		DEMAND : {
			"type" : 2,//制作
			"item" : "4100_1#4120_1#4105_1#4107_1#4112_1#4113_1#4106_1#4104_1",//武器id，用-链接多个武器
			"value": [30],//数量
		},
		EFFECT : {
				
		},
		POINT : [3],
	},




	"3001" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "好奇宝宝",
		DESC : "累计探索{0}个隐藏关卡",
		DEMAND : {
			"type" : 1,//隐藏关卡
			"value": [2,5,50],//探索次数
		},
		EFFECT : {
			"type" : 1,//赠送物品
			"item" : 4107,//物品id
			"value": [10,20,50],//物品数量
			"desc" : "开局附赠{0}个箭矢",
		},
		POINT : [1,2,3],
	},

	"3002" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "潜在路痴",
		DESC : "累计{0}次迷失方向",
		DEMAND : {
			"type" : 2,//迷失方向
			"value": [5,50,100],//探索次数
		},
		EFFECT : {
			"type" : 1,//赠送物品
			"item" : 4114,//物品id
			"value": [1,2,3],//物品数量
			"desc" : "开局附赠{0}个火把",
		},
		POINT : [1,2,3],
	},

	"3003" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "急支糖浆",
		DESC : "累计{0}次在路途上遭遇野兽袭击",
		DEMAND : {
			"type" : 3,//遇袭
			"value": [10,100,300],//探索次数
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3004" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "荒野志异",
		DESC : "累计解锁{0}幅剧情图鉴",
		DEMAND : {
			"type" : 4,
			"value": [20,60,94],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3005" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "被杀名单",
		DESC : "累计解锁{0}幅生物图鉴",
		DEMAND : {
			"type" : 5,
			"value": [20,40,60],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3006" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "天工开物",
		DESC : "累计解锁{0}幅物品图鉴",
		DEMAND : {
			"type" : 6,
			"value": [20,45,75],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3007" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "海洋之心",
		DESC : "累计解锁{0}幅鱼类图鉴",
		DEMAND : {
			"type" : 7,
			"value": [10,20,30],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3008" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "泰坦尼克",
		DESC : "沉船完成{0}层",
		DEMAND : {
			"type" : 8,
			"value": [12,32,60],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3009" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 1,//是否是单局成就 1：是，0：否
		NAME : "死亡笔记",
		DESC : "单局写下{0}篇心情笔记",
		DEMAND : {
			"type" : 9,
			"value": [15,40,100],
		},
		EFFECT : {

		},
		POINT : [1,2,3],
	},

	"3010" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "逃生大师",
		DESC : "累计逃出{0}次",
		DEMAND : {
			"type" : 10,
			"value": [1,3,5],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3011" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "多重人格",
		DESC : "累计解锁{0}个角色",
		DEMAND : {
			"type" : 11,
			"value": [1,2,3],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3012" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "多才多艺",
		DESC : "累计解锁{0}个天赋",
		DEMAND : {
			"type" : 12,
			"value": [3,10,20],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3013" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 0,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "核心玩家",
		DESC : "累计获得{0}成就点数",
		DEMAND : {
			"type" : 13,
			"value": [50,150,300],
		},
		EFFECT : {

		},	
		POINT : [1,2,3],
	},

	"3014" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "罗兰的食谱",
		DESC : "使用罗兰通关",
		DEMAND : {
			"type" : 14,
			"value": [1],
		},
		EFFECT : {
			"value": [1],
			"desc" : "解锁荒野烤肉图纸",
		},	
		POINT : [3],
	},

	"3015" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "老贝的草裙",
		DESC : "使用老贝通关",
		DEMAND : {
			"type" : 15,
			"value": [1],
		},
		EFFECT : {
			"value": [1],
			"desc" : "解锁老贝的草裙图纸",	
		},	
		POINT : [3],
	},

	"3016" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "朱莉的长弓",
		DESC : "使用朱莉通关",
		DEMAND : {
			"type" : 16,
			"value": [1],
		},
		EFFECT : {	
			"value": [1],		
			"desc" : "解锁朱莉的长弓图纸",			
		},	
		POINT : [3],
	},

	"3017" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "未知领域",
		DESC : "集齐七个神秘圆球",
		DEMAND : {
			"type" : 17,
			"value": [1],
		},
		EFFECT : {

		},	
		POINT : [3],
	},
	
	"3018" : {
		TYPE : 3,//1：战斗，2：生存，3：探索
		HIDE : 1,//是否是隐藏成就 1：是，0：否
		ONCE : 0,//是否是单局成就 1：是，0：否
		NAME : "小哥的手电",
		DESC : "使用野食小哥通关",
		DEMAND : {
			"type" : 18,
			"value": [1],
		},
		EFFECT : {			
			"type" : 1,//赠送物品
			"item" : 4124,//物品id
			"desc" : "开局附赠{0}个小哥的手电",
			"value": [1],//物品数量			
		},	
		POINT : [3],
	},	
};