// 
exports.getById = function(bid){
   return HY_PRODUCTS[bid.toString()];
};

var HY_PRODUCTS = {
	// 工作台
	"3000" : {
	    PRODUCT : {
	        ["1"] : {			//制作石斧 5
				P_COST : {"4004" : 1,"4000" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4100" : 1},	
				ATTRS : {},	
				LEVEL : 1,
				DESC : '制作石斧',
				TITLE : '制作'
			},
			["6"] : {			//制作石刃 1
				P_COST : {"4005" : 1,"4000" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4101" : 1},
				ATTRS : {},	
				LEVEL : 1,
				DESC : '制作匕首',
				TITLE : '制作'
			},
//			["3"] : {			//制作石矛
//				P_COST : {"4000" : 2,"4004" : 1,"4003" : 1},
//				P_TIME : 3600, 	// 生产时间 
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4102" : 1},	
//				ATTRS : {},
//				LEVEL : 2,
//				DESC : '制作石矛',
//				TITLE : '制作'
//			},
			["2"] : {			//制作朱莉的长弓
				P_COST : {"4003" : 4,"4036" : 2},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4120" : 1},
				ATTRS : {},	
				LEVEL : 1,
				DESC : '制作朱莉的长弓',
				TITLE : '制作',
				COND : {									
				"1001" : [			// 1001说明是剧情点是否触发为条件
							{
								"b8" : 1,   //{}里面为或，0为未发生，1为发生					
							},				//{}外面为且
						],											
				},				
			},
			["3"] : {			//制作贝爷的草裙
				P_COST : {"4003" : 4,"4001" : 4},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4119" : 1},
				ATTRS : {},	
				LEVEL : 1,
				DESC : '制作老贝的草裙',
				TITLE : '制作',
				COND : {									
				"1001" : [			// 1001说明是剧情点是否触发为条件
							{
								"e8" : 1,   //{}里面为或，0为未发生，1为发生					
							},				//{}外面为且
						],											
				},				
			},						
			["7"] : {			//制作短弓 4
				P_COST : {"4003" : 1,"4036" : 2,"4012" : 1},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4105" : 1},
				ATTRS : {},	
				LEVEL : 2,
				DESC : '制作短弓',
				TITLE : '制作'
			},
			["8"] : {			//制作箭矢 0
				P_COST : {"4005" : 10,"4036" : 5},
				P_TIME : 600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4107" : 20},	
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作箭矢',
				TITLE : '制作'
			},
			["9"] : {			//制作羽箭						//弃用
				P_COST : {"4005" : 10,"4036" : 5,"4071" : 10,"4072" : 3},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4123" : 20},	
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作毒羽箭',
				TITLE : '制作',
				COND : {									
					"1003" : [			// 条件类型: 关卡解锁/完成
						{
							"2003" : {
								UNLOCK : true,		// 关卡是否要求解锁
								COMPLETE : false ,// 关卡是否要求完成
								},
							},			
					],											
				},					
			},
//			["7"] : {			//制作诱捕网
//				P_COST : {"4003" : 3},
//				P_TIME : 3600, 	// 生产时间
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4108" : 1},	
//				ATTRS : {},
//				LEVEL : 2,
//				DESC : '制作诱捕网',
//				TITLE : '制作'
//			},
//			["8"] : {			//制作硬竹长弓
//				P_COST : {"4012" : 1,"4003" : 2,"4036" : 4},
//				P_TIME : 3600, 	// 生产时间
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4106" : 1},	
//				ATTRS : {},
//				LEVEL : 3,
//				DESC : '制作硬竹长弓',
//				TITLE : '制作'
//			},
//			["9"] : {			//制作皮甲
//				P_COST : {"4003" : 2,"4010" : 1},
//				P_TIME : 3600, 	// 生产时间
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4109" : 1},	
//				ATTRS : {},
//				LEVEL : 3,
//				DESC : '制作皮甲',
//				TITLE : '制作'
//			},
//			["10"] : {			//制作鞋							//弃用
//				P_COST : {"4011" : 3,"4003" : 5},
//				P_TIME : 3600, 	// 生产时间
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4110" : 1},	
//				ATTRS : {},
//				LEVEL : 3,
//				DESC : '制作鞋',
//				TITLE : '制作'
//			},
			["20"] : {			//制作包							
				P_COST : {"4011" : 8,"4003": 8},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4111" : 1},
				ATTRS : {},	
				LEVEL : 3,
				DESC : '制作包',
				TITLE : '制作'
			}, 
      		["4"] : {			//制作火把 4
				P_COST : {"4003" : 1,"4004": 1,"4028": 1},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4114" : 1},
				ATTRS : {},	
				LEVEL : 1,
				DESC : '制作火把',
				TITLE : '制作'
			},
      		["5"] : {			//制作火把 4
				P_COST : {"4003" : 1,"4004": 1,"4074": 1},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4114" : 1},
				ATTRS : {},	
				LEVEL : 1,
				DESC : '制作火把',
				TITLE : '制作'
			},			
			["13"] : {			//制作锐利重斧 6
				P_COST : {"4000" : 1,"4005": 2,"4004": 2},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4112" : 1},
				ATTRS : {},	
				LEVEL : 2,
				DESC : '制作双刃斧',
				TITLE : '制作'
			},
			["10"] : {			//制作长枪  3
				P_COST : {"4005" : 1,"4036": 2},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4113" : 1},
				ATTRS : {},	
				LEVEL : 2,
				DESC : '制作长枪',
				TITLE : '制作'
			},
			["15"] : {			//制作硬竹弓 5
				P_COST : {"4003" : 4,"4036" : 8,"4012" : 2},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4106" : 1},
				ATTRS : {},	
				LEVEL : 3,
				DESC : '制作硬竹弓',
				TITLE : '制作'
			},
			["16"] : {			//制作硬竹弩 5
				P_COST : {"4003" : 2,"4004" : 2,"4036" : 4,"4012" : 2},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4104" : 1},
				ATTRS : {},	
				LEVEL : 3,
				DESC : '制作硬竹弩',
				TITLE : '制作'
			},
			["11"] : {			//制作皮甲 2
				P_COST : {"4003" : 2,"4011" : 1},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4109" : 1},
				ATTRS : {},	
				LEVEL : 2,
				DESC : '制作皮甲',
				TITLE : '制作'
			},
			["18"] : {			//制作毛领藤甲 3
				P_COST : {"4003" : 2,"4036" : 6,"4011" : 1,"4033" : 8,"4032" : 2},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4116" : 1},
				ATTRS : {},	
				LEVEL : 3,
				DESC : '制作藤甲',
				TITLE : '制作'
			},
			["19"] : {			//制作竹筒炸药 3
				P_COST : {"4005" : 2,"4036" : 1,"4034" : 2,"4035" : 1},
				P_TIME : 3600, 	// 生产时间
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4117" : 1},
				ATTRS : {},	
				LEVEL : 3,
				DESC : '制作竹筒炸药',
				TITLE : '制作'
			},			
	    }
	},
	//温棚
	"3001" : {
		PRODUCT : {
			["1"] : {			//生产土豆
				P_COST : {"4044" : 2,"4002" : 3},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4044" : 10},
				ATTRS : {},
				LEVEL : 1,
				BUFF : 6001,
				DESC : '种植土豆',
				TITLE : '种植',
				GETTEXT : '即将收获:土豆*10',
			},
			// ["1"] : {			//生产野菜
			// 	P_COST : {"4023" : 3,"4002" : 3},
			// 	P_TIME : 3600, 	// 生产时间 
			// 	C_TIME : 48*3600, 	// 冷却时间
			// 	ITEMS : {"4023" : 10},
			// 	ATTRS : {},
			// 	LEVEL : 1,
			// 	BUFF : 6001,
			// 	DESC : '生产野菜',
			// 	TITLE : '生产'
			// },
			["2"] : {			//生产薄荷
				P_COST : {"4022" : 3,"4002" : 3},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4022" : 10},
				ATTRS : {},
				LEVEL : 2,
				BUFF : 6002,
				DESC : '种植薄荷',
				TITLE : '种植',
				GETTEXT : '即将收获:薄荷*10',
			},
		}
	},
	//厨房
	"3002" : {
		PRODUCT : {
			["1"] : {			//制作烤肉
				P_COST : {"4020" : 1,"4004" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4025" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作烤肉',
				TITLE : '制作'
			},
			["2"] : {			//制作荒野烤肉
				P_COST : {"4020" : 1,"4004" : 1,"4036" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4070" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作荒野烤肉',
				TITLE : '制作',
				COND : {									
				"1001" : [			// 1001说明是剧情点是否触发为条件
							{
								"c9" : 1,   //{}里面为或，0为未发生，1为发生					
							},				//{}外面为且
						],											
				},	
			},			
//			["2"] : {			//制作宠物口粮
//				P_COST : {"4020" : 3,"4004" : 1},
//				P_TIME : 3600, 	// 生产时间 
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4027" : 1},
//				ATTRS : {},
//				LEVEL : 2,
//				DESC : '制作宠物口粮',
//				TITLE : '制作'
//			},
//			["3"] : {			//制作薄荷茶
//				P_COST : {"4022" : 1,"4002" : 1,"4004" : 1},
//				P_TIME : 1800, 	// 生产时间 
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4024" : 10},
//				ATTRS : {},
//				LEVEL : 2,
//				DESC : '制作薄荷茶',
//				TITLE : '制作'
//			},
			["3"] : {			//制作烤土豆
				P_COST : {"4044" : 2,"4004" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4040" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作烤土豆',
				TITLE : '制作'
			},	


			["4"] : {			//制作肉汤
				P_COST : {"4020" : 2,"4002" : 1,"4004" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4026" : 1},
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作肉汤',
				TITLE : '制作'
			},	

					
			["5"] : {			//制作土豆泥
				P_COST : {"4044" : 2,"4002" : 1,"4004" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4041" : 1},
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作土豆泥',
				TITLE : '制作'
			},
			["6"] : {			//制作秘制炖肉
				P_COST : {"4020" : 1,"4044" : 2,"4038" : 2,"4022" : 1,"4002" : 2,"4004" : 2},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4043" : 1},
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作秘制炖肉',
				TITLE : '制作',
				COND : {									
				"1000" : 1000,	//1000美食家												
				},	
			},
			["7"] : {			//生火
				P_COST : {"4004" : 6},
				PETATTRS: {"7010" : 15},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"7010" : 15},	//持续6小时BUFF，使室温提高15度
				ATTRS : {},
				LEVEL : 3,
				BUFF : 6000,
				DESC : '生火',
				TITLE : '制作'
			},			
		}	
	},
	//野外厨房
	"3002_1" : {
		PRODUCT : {
			["1"] : {			//制作烤肉
				P_COST : {"4020" : 1,"4004" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4025" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作烤肉',
				TITLE : '制作'
			},
			["2"] : {			//制作荒野烤肉
				P_COST : {"4020" : 1,"4004" : 1,"4036" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4070" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作荒野烤肉',
				TITLE : '制作',
				COND : {									
				"1001" : [			// 1001说明是剧情点是否触发为条件
							{
								"c9" : 1,   //{}里面为或，0为未发生，1为发生					
							},				//{}外面为且
						],											
				},	
			},			
//			["2"] : {			//制作宠物口粮
//				P_COST : {"4020" : 3,"4004" : 1},
//				P_TIME : 3600, 	// 生产时间 
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4027" : 1},
//				ATTRS : {},
//				LEVEL : 2,
//				DESC : '制作宠物口粮',
//				TITLE : '制作'
//			},
//			["3"] : {			//制作薄荷茶
//				P_COST : {"4022" : 1,"4002" : 1,"4004" : 1},
//				P_TIME : 1800, 	// 生产时间 
//				C_TIME : 0, 	// 冷却时间
//				ITEMS : {"4024" : 10},
//				ATTRS : {},
//				LEVEL : 2,
//				DESC : '制作薄荷茶',
//				TITLE : '制作'
//			},
			["3"] : {			//制作烤土豆
				P_COST : {"4044" : 2,"4004" : 1},
				P_TIME : 1800, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4040" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作烤土豆',
				TITLE : '制作'
			},	


			// ["4"] : {			//制作肉汤
			// 	P_COST : {"4020" : 2,"4002" : 1,"4004" : 1},
			// 	P_TIME : 3600, 	// 生产时间 
			// 	C_TIME : 0, 	// 冷却时间
			// 	ITEMS : {"4026" : 1},
			// 	ATTRS : {},
			// 	LEVEL : 1,
			// 	DESC : '制作肉汤',
			// 	TITLE : '制作'
			// },	

					
			// ["5"] : {			//制作土豆泥
			// 	P_COST : {"4044" : 2,"4002" : 1,"4004" : 1},
			// 	P_TIME : 1800, 	// 生产时间 
			// 	C_TIME : 0, 	// 冷却时间
			// 	ITEMS : {"4041" : 1},
			// 	ATTRS : {},
			// 	LEVEL : 1,
			// 	DESC : '制作土豆泥',
			// 	TITLE : '制作'
			// },
			// ["6"] : {			//制作秘制炖肉
			// 	P_COST : {"4020" : 1,"4044" : 2,"4038" : 2,"4022" : 1,"4002" : 2,"4004" : 2},
			// 	P_TIME : 1800, 	// 生产时间 
			// 	C_TIME : 0, 	// 冷却时间
			// 	ITEMS : {"4043" : 1},
			// 	ATTRS : {},
			// 	LEVEL : 1,
			// 	DESC : '制作秘制炖肉',
			// 	TITLE : '制作',
			// 	COND : {									
			// 	"1000" : 1000,	//1000美食家												
			// 	},	
			// },
			// ["7"] : {			//生火
			// 	P_COST : {"4004" : 6},
			// 	PETATTRS: {"7010" : 15},
			// 	P_TIME : 1800, 	// 生产时间 
			// 	C_TIME : 0, 	// 冷却时间
			// 	ITEMS : {"7010" : 15},	//持续6小时BUFF，使室温提高15度
			// 	ATTRS : {},
			// 	LEVEL : 1,
			// 	BUFF : 6000,
			// 	DESC : '生火',
			// 	TITLE : '制作'
			// },			
		}	
	},
	// 卧室
	"3003" : {
		PRODUCT : {				
			["1"] : {			//睡1小时
				P_COST : {},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {},	//实际睡眠恢复效果1小时结算一次，并受其他参数影响，此处先用回复精神和生命暂替
				ATTRS : {"7000" : 10,"7003" : 10},
				LEVEL : 1,
				BUFF : 6005,
				DESC : '小憩',
				TITLE : '睡觉'
			},
			["2"] : {			//睡4小时
				P_COST : {},
				P_TIME : 4*3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {},	//实际睡眠恢复效果1小时结算一次，并受其他参数影响，此处先用回复精神和生命暂替
				ATTRS : {"7000" : 40,"7003" : 40},
				LEVEL : 1,
				BUFF : 6006,
				DESC : '短睡',
				TITLE : '睡觉'
			},
			["3"] : {			//睡8小时
				P_COST : {},
				P_TIME : 8*3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {},	//实际睡眠恢复效果1小时结算一次，并受其他参数影响，此处先用回复精神和生命暂替
				ATTRS : {"7000" : 80,"7003" : 80},
				LEVEL : 1,
				BUFF : 6007,
				DESC : '睡觉',
				TITLE : '睡觉'
			},
			["4"] : {			//睡到天亮
				P_COST : {},
				P_TIME : 0, 	// 生产时间，此处睡到天亮需要读取当前时间计算睡眠时间，先用8小时暂替
				C_TIME : 0, 	// 冷却时间
				ITEMS : {},	//实际睡眠恢复效果1小时结算一次，并受其他参数影响，此处先用回复精神和生命暂替
				ATTRS : {"7000" : 80,"7003" : 80},
				LEVEL : 1,
				BUFF : 6008,
				DESC : '睡觉',
				TITLE : '睡觉'
			},
		}		
	},
	//医药台
	"3004" : {
		PRODUCT : {
			["1"] : {			//制作绷带
				P_COST : {"4013" : 1,"4003" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4016" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作绷带',
				TITLE : '制作'
			},
			["2"] : {			//制作汤药
				P_COST : {"4013" : 1,"4002" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4017" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作汤药',
				TITLE : '制作'
			},
			["3"] : {			//制作薄荷茶
				P_COST : {"4022" : 2,"4002" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4024" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作薄荷茶',
				TITLE : '制作'
			},
			["4"] : {			//制作药酒
				P_COST : {"4013" : 2,"4037" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4019" : 1},
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作药酒',
				TITLE : '制作'
			},
			["5"] : {			//制作急救丸
				P_COST : {"4013" : 2,"4039" : 1,"4022" : 1,"4037" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4018" : 1},
				ATTRS : {},
				LEVEL : 2,
				DESC : '制作急救丸',
				TITLE : '制作'
			},
		},
		
	},
	// 栅栏
	"3005" : {
		
	},
// 宠物
	"3006" : {
PRODUCT : {
			["1"] : {			//
				P_COST : {"4020" : 2},
				P_TIME : 600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				PETATTRS: {"7006" : 80},
				LEVEL : 1,
				DESC : '喂食中',
				//DESC : '用生肉喂食宠物，可恢复其饱食度，饱食度不足则无法出战',
				TITLE : '喂食'
			},
			["2"] : {			//
				P_COST : {"4027" : 1},
				P_TIME : 600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				PETATTRS: {"7028" : 80},
				LEVEL : 1,
				DESC : '驯养中',
				//DESC : '用宠物口粮驯养宠物，可恢复其忠诚度，忠诚度越高攻击越高',
				TITLE : '驯养'
			},		
			["3"] : {			//
				P_COST : {"4013" : 1},
				P_TIME : 600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				PETATTRS: {"7003" : 80},
				LEVEL : 1,
				DESC : '治疗中',
				//DESC : '用药草治疗宠物，可恢复其生命值，生命值不足则无法出战',
				TITLE : '治疗'
			},				
	},
},
// 陷阱
	// "3007" : {
	// 	PRODUCT : {
	// 		["1"] : {			//设置陷阱
	// 			P_COST : {"4020" : 1},
	// 			P_TIME : 3600, 	// 生产时间 
	// 			C_TIME : 48*3600, 	// 冷却时间
	// 			ITEMS : {"4020" : 3},
	// 			ATTRS : {},
	// 			LEVEL : 1,
	// 		},
	// 	}		
	// },
// 码头
	"3008" : {
		PRODUCT :{		
			["1"] : {		//布置渔网
				P_COST : {},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4020" : 5},
				ATTRS : {},
				LEVEL : 1,
				// BUFF : 6011,
				DESC : '进入钓鱼界面',
				TITLE : '钓鱼',
				GETTEXT : '即将收获:生肉*5',
			},		
		},
	},	
// 净水台
	"3009" : {
		PRODUCT : {
			["1"] : {			//净水
				P_COST : {"4004" : 6},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4002" : 12},
				ATTRS : {},
				LEVEL : 1,
				BUFF : 6009,
				DESC : '净水',
				TITLE : '制作',
				GETTEXT : '即将收获:淡水*12',
			},
			["2"] : {			//制作酒精
				P_COST : {"4042" : 5,"4004" : 6},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4037" : 1},
				ATTRS : {},
				LEVEL : 1,
				BUFF : 6010,
				DESC : '制作酒精',
				TITLE : '制作'	,
				GETTEXT : '即将收获:酒精*1',			
			},
		}		
	},
// 冶金台
	"3010" : {
		PRODUCT : {
			["1"] : {			//制作武士刀
				P_COST : {"4007" : 2,"4032" : 1,"4030" : 3,"4036" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4103" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作武士刀',
				TITLE : '制作'			
			},
			["2"] : {			//制作重连弩
				P_COST : {"4007" : 2,"4032" : 4,"4030" : 4,"4004" : 2,"4012" : 2},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4115" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作重连弩',
				TITLE : '制作'			
			},
			["3"] : {			//制作榴弹
				P_COST : {"4007" : 1,"4030" : 2,"4034" : 2,"4035" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4118" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作榴弹',
				TITLE : '制作'			
			},
			["4"] : {			//制作弹药
				P_COST : {"4030" : 2,"4034" : 2,"4035" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4126" : 10},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作弹药',
				TITLE : '制作',	
				COND : {									
					"1004" : {	
			   			"4080" :1,
						},											
				},		
			},			
			["5"] : {			//制作铁锭
				P_COST : {"4007" : 1},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4049" : 1},
				ATTRS : {},
				LEVEL : 1,
				DESC : '制作铁锭',
				TITLE : '制作'			
			},			
		}		
	},
// 酿酒台
	"3011" : {
		PRODUCT : {
			["1"] : {			//酿酒
				P_COST : {"4044" : 12,"4002" : 5},
				P_TIME : 3600, 	// 生产时间 
				C_TIME : 0, 	// 冷却时间
				ITEMS : {"4042" : 5},
				ATTRS : {},
				LEVEL : 1,
				BUFF : 6012,
				DESC : '酿酒',
				TITLE : '制作'	,
				GETTEXT : '即将收获:土豆酒*5',		
			},
		}		
	},	

// 高索台
	"3012" : {
		PRODUCT : {
		}		
	},



};