// 
exports.getById = function(bid){
   return HY_BUILDS[bid.toString()];
};

// exports.CT_ROLE = "1000"; 	// 条件类型: 角色（美食家冶金师探险家等）
// exports.CT_PASS = "1001"; 	// 条件类型: 剧情点状态判断类型
exports.CT_SUR = "1002"; 		// 条件类型: 生存天数
exports.CT_POT = "1003"; 		// 条件类型: 关卡解锁/完成
// exports.CT_ITEM = "1004"; 	// 条件类型: 道具获取
// exports.CT_WEA = "1005"; 	// 条件类型: 天气
// exports.CT_TEM = "1006"; 	// 条件类型: 温度计温度
// exports.CT_SEA = "1007"; 	// 条件类型: 季节
exports.CT_PET = "1008"; 	// 条件类型: 宠物坐骑等标识
// exports.CT_STA = "1009"; 	// 条件类型: 角色生存状态
exports.CT_BUI = "1010"; 		// 条件类型: 营地建筑等级
// exports.CT_NPC = "1011"; 	// 条件类型: NPC好感度
exports.CT_QUE = "1014"; 	// 条件类型: 帐号级完成标识
// COND : {		//里面条件为且关系		
// 			"1001" : [			// 1001说明是剧情点是否触发为条件，{}外面为且
// 				{							//{}里面为或
// 					"e1" : 1, 	//0为未发生，1为发生
// 					"e2" : 0, 
					  
// 				},																													
// 			"1002" : 10,	//生存天数>=10
// 			"1003" : {
// 				"1" : 1, 	//某个关卡是否已解锁
// 			},
// 			"1010" : {
// 				3000 : 1, 	//某个建筑>=1级
// 			},
// }
// 

var HY_BUILDS = {
	// 工作台
	"3000" : {
		["1"] : {
			NAME : "工具台",
			DURATION : 100,
			P_TIME : 0, 	// 建造时间
			R_TIME : 1800, 	// 维修时间
			DURA_COST :1,	//使用时耐久消耗
			DESC : "初级的工具台，可以制作一些简单的工具",
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR : {
				"4003":1,
				"4000":2,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		}, 
		["2"] : {
			NAME : "工作台",
			DURATION : 150,
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗
			DESC : "进阶的工作台，可以制作稍复杂的工具",		
			UPGRADE : {
				"4003":1,
				"4000":4,
				"4005":5,
				"4004":6,
				"4001":0,
			},
			REPAIR:{
				"4003":1,
				"4000":4,
				"4005":5,
				"4004":6,
				"4001":0,
			},
			EVENTS : {
				
			}
		}, 
		["3"] : {
			NAME : "工作间",
			DURATION : 200,
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗
			DESC : "顶级的工作间，可以制作最有用的工具",
			UPGRADE : {
				"4003":1,
				"4000":8,
				"4005":6,
				"4004":2,
				"4001":8,
			},
			REPAIR:{
				"4003":1,
				"4000":8,
				"4005":6,
				"4004":2,
				"4001":8,
			},
			EVENTS : {
				
			}
		}, 
	},
	//温棚
	"3001" : {
		COND : {
			"1002" : 8,//生存天数>=8
		},		
		["1"] : {
			NAME : "温棚",
			DURATION : 100, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗
			DESC : "简单的温棚，可以种植土豆",
			UPGRADE : {
				"4003":3,
				"4000":2,
				"4005":3,
				"4004":3,
				"4001":0,
			},
			REPAIR:{
				"4003":3,
				"4000":2,
				"4005":3,
				"4004":3,
				"4001":0,
			},
			EVENTS : {
				"5000":1,
			}
		},
		["2"] : {
			NAME : "温室",
			DURATION : 150, 
			P_TIME : 5400, 	// 建造时间
			R_TIME : 2700, 	// 维修时间		
			DURA_COST :1,	//使用时耐久消耗
			DESC : "精良一点的温室，还能够种植薄荷",		
			UPGRADE : {
				"4003":8,
				"4000":6,
				"4005":8,
				"4004":6,
				"4001":3,
			},
			REPAIR:{
				"4003":8,
				"4000":6,
				"4005":8,
				"4004":6,
				"4001":3,
			},
			EVENTS : {
				
			}
		},
	},
	//厨房
	"3002" : {
		COND : {
			"1003" : {
				"2" : 1, 	//某个关卡是否已解锁
 			},
		},
		["1"] : {
			NAME : "火堆",
			DURATION : 100, 
			P_TIME : 1800, 	// 建造时间
			R_TIME : 900, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗
			DESC : "一些简单柴火搭建的火堆，能够烹制食物，还能保护你晚上睡着不被野兽骚扰",			
			UPGRADE : {
				"4003":0,
				"4000":2,
				"4005":0,
				"4004":5,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":2,
				"4005":0,
				"4004":5,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
		["2"] : {
			NAME : "火炕",
			DURATION : 150, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗
			DESC : "在原先的基础上做了些改良的火炕，能够烹制更多种类的食物，",		
			UPGRADE : {
				"4003":0,
				"4000":6,
				"4005":2,
				"4004":2,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":6,
				"4005":2,
				"4004":2,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
		["3"] : {
			NAME : "营火",
			DURATION : 200, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间		
			DURA_COST :1,	//使用时耐久消耗
			DESC : "众多物资改良出的营火，除了能烹制食物，还能给你带来温暖",		
			UPGRADE : {
				"4003":2,
				"4000":8,
				"4005":2,
				"4004":4,
				"4001":0,
			},
			REPAIR:{
				"4003":2,
				"4000":8,
				"4005":2,
				"4004":4,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},
	//厨房
	"3002_1" : {
		COND : {
			
		},
		["1"] : {
			NAME : "野外厨房",
			DURATION : 'MAX', 
			P_TIME : 1800, 	// 建造时间
			R_TIME : 900, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗
			DESC : "一些简单柴火搭建的火堆，能够烹制食物，还能保护你晚上睡着不被野兽骚扰",			
			UPGRADE : {
				
			},
			REPAIR:{
				
			},
			EVENTS : {
				
			}
		},
		
	},
	// 卧室
	"3003" : {
		["1"] : {
			NAME : "简陋的床",
			DURATION : "MAX", 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :0,	//使用时耐久消耗
			DESC : "用简陋工具制成的床，只能算一个睡觉的地方，谈不上舒适",			
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":2,
				"4005":0,
				"4004":5,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
		["2"] : {
			NAME : "藤木床",
			DURATION : "MAX", 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间		
			DURA_COST :0,	//使用时耐久消耗
			DESC : "用藤条和树叶再次加工的床，比起简陋的床来说舒服了不少",		
			UPGRADE : {
				"4003":2,
				"4000":4,
				"4005":2,
				"4004":4,
				"4001":12,
			},
			REPAIR:{
				"4003":2,
				"4000":4,
				"4005":2,
				"4004":4,
				"4001":12,
			},
			EVENTS : {
				
			}
		},
		["3"] : {
			NAME : "卧室",
			DURATION : "MAX", 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间		
			DURA_COST :0,	//使用时耐久消耗
			DESC : "用大量树叶和藤条搭建的卧室，在荒野上已经是顶级配置了",		
			UPGRADE : {
				"4003":8,
				"4000":6,
				"4005":4,
				"4004":12,
				"4001":26,
			},
			REPAIR:{
				"4003":8,
				"4000":6,
				"4005":4,
				"4004":12,
				"4001":26,
			},
			EVENTS : {
				
			}
		},
	},
	//医药台
	"3004" : {		
 		COND : {		//里面条件为且关系	

			"1003" : {
 				"2" : 1, 	//某个关卡是否已解锁
 			},
 },	
		["1"] : {
			NAME : "药盒",
			DURATION : 100, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗	
			DESC : "能够制作简单治疗工具的药盒",		
			UPGRADE : {
				"4003":1,
				"4000":1,
				"4005":2,
				"4004":2,
				"4001":0,
			},
			REPAIR:{
				"4003":1,
				"4000":1,
				"4005":2,
				"4004":2,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
		["2"] : {
			NAME : "医药台",
			DURATION : 150, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗	
			DESC : "由药盒加工而来的医药台，可制作更加高级的医疗道具",		
			UPGRADE : {
				"4003":2,
				"4000":2,
				"4005":4,
				"4004":2,
				"4001":4,
			},
			REPAIR:{
				"4003":2,
				"4000":2,
				"4005":4,
				"4004":2,
				"4001":4,
			},
			EVENTS : {
				
			}
		},
	},
	// 栅栏
	"3005" : {
		
 		COND : {		//里面条件为且关系																															
 			"1002" : 4,	//生存天数>=5
 },
		["1"] : {
			NAME : "初级栅栏",
			DURATION : 100, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :0,	//使用时耐久消耗	
			DESC : "简单搭建的栅栏，一定程度上防止野兽侵袭",		
			UPGRADE : {
				"4003":3,
				"4000":4,
				"4005":2,
				"4004":8,
				"4001":0,
			},
			REPAIR:{
				"4003":3,
				"4000":4,
				"4005":2,
				"4004":8,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
		["2"] : {
			NAME : "中级栅栏",
			DURATION : 150, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :0,	//使用时耐久消耗	
			DESC : "加强版栅栏，防御力更强也更漂亮",		
			UPGRADE : {
				"4003":4,
				"4000":4,
				"4005":10,
				"4004":10,
				"4001":0,
			},
			REPAIR:{
				"4003":4,
				"4000":4,
				"4005":10,
				"4004":10,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
		["3"] : {
			NAME : "高级栅栏",
			DURATION : 200, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间		
			DURA_COST :0,	//使用时耐久消耗
			DESC : "你能制作出的最坚固的栅栏了，但其实也无法完全防止野兽侵袭",		
			UPGRADE : {
				"4003":8,
				"4000":12,
				"4005":20,
				"4004":20,
				"4001":10,
			},
			REPAIR:{
				"4003":8,
				"4000":12,
				"4005":20,
				"4004":20,
				"4001":10,
			},
			EVENTS : {
				
			}
		},
	},
// 宠物
	"3006" : {		
 		COND : {		//里面条件为且关系																															
 			//"1002" : 10,	//生存天数>=10
 			"1008" : 1, //宠物ID
 		// 	"1010" : {
			// 	3004 : 1, 	//某个建筑>=1级
			// },
 	},
		["1"] : {
			NAME : "宠物室",
			DURATION : 150, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗	
			DESC : "你为心爱的宠物建造的家",		
			UPGRADE : {
				"4003":2,
				"4000":2,
				"4005":2,
				"4004":4,
				"4001":2,
			},
			REPAIR:{
				"4003":2,
				"4000":2,
				"4005":2,
				"4004":4,
				"4001":2,
			},
			EVENTS : {
				
			}
		},
	},
// // 陷阱
// 	"3007" : {
// 		["1"] : {
// 			NAME : "陷阱",
// 			DURATION : 100, 
// 			P_TIME : 3600, 	// 建造时间
// 			R_TIME : 1800, 	// 维修时间		
// 			DESC : "陷阱",		
// 			UPGRADE : {
// 				"4003":6,
// 				"4000":8,
// 				"4005":6,
// 				"4004":9,
// 				"4001":4,
// 			},
// 			REPAIR:{
// 				"4003":6,
// 				"4000":8,
// 				"4005":6,
// 				"4004":9,
// 				"4001":4,
// 			},
// 			EVENTS : {
				
// 			}
// 		},
// 	},
	// 码头
	"3008" : {		
 		COND : {		//里面条件为且关系																															

 			"1002" : 1,	//生存天数>=5
 		},
		["1"] : {
			NAME : "钓鱼码头",
			DURATION : 150, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间		
			DURA_COST :1,	//使用时耐久消耗	
			DESC : "建造简单的小码头和独木舟，虽不能出海，但是湖泊上还是可以行驶的。还可以在营地钓鱼。",	
			UPGRADE : {
				"4003":2,
				"4000":4,
				"4005":3,
				"4004":5,
				"4001":4,
			},
			REPAIR:{
				"4003":2,
				"4000":4,
				"4005":3,
				"4004":5,
				"4001":4,
			},
			EVENTS : {
				
			}
		},
	},

// 净水台
	"3009" : {		
 		COND : {		//里面条件为且关系																															

 			"1010" : {
				3004 : 1, 	//某个建筑>=1级
			},
 },
		["1"] : {
			NAME : "净水台",
			DURATION : 150, 
			P_TIME : 3600, 	// 建造时间
			R_TIME : 1800, 	// 维修时间	
			DURA_COST :1,	//使用时耐久消耗		
			DESC : "在这可以通过适当的操作蒸馏出纯净水",	
			UPGRADE : {
				"4003":4,
				"4000":6,
				"4005":2,
				"4004":2,
				"4001":0,
			},
			REPAIR:{
				"4003":4,
				"4000":6,
				"4005":2,
				"4004":2,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},
// 酿酒台
	"3011" : {
	COND : {		//里面条件为且关系
			"1002" : 15,//生存天数>=20

			"1010" : {
			 				3002 : 1, 	//某个建筑>=1级
 			},
		},
		["1"] : {
			NAME : "酿酒台",
			DURATION : 150, 
			P_TIME : 5400, 	// 建造时间
			R_TIME : 2700, 	// 维修时间		
			DURA_COST :1,	//使用时耐久消耗
			DESC : "料理家才能制作出来的酿酒台，能够酿制土豆酒",		
			UPGRADE : {
				"4003":6,
				"4000":12,
				"4005":0,
				"4004":8,
				"4001":0,
			},
			REPAIR:{
				"4003":6,
				"4000":12,
				"4005":0,
				"4004":8,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},
// 冶金炉
	"3010" : {
	COND : {		//里面条件为且关系
			"1002" : 15,//生存天数>=20

			"1010" : {
			 				3002 : 1, 	//某个建筑>=1级
 			},
		},
		["1"] : {
			NAME : "冶金炉",
			DURATION : 150, 
			P_TIME : 5400, 	// 建造时间
			R_TIME : 2700, 	// 维修时间		
			DURA_COST :1,	//使用时耐久消耗
			DESC : "工艺师才能制作出来的冶金炉，能够制作精良的武器",		
			UPGRADE : {
				"4003":0,
				"4000":12,
				"4005":8,
				"4004":6,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":12,
				"4005":8,
				"4004":6,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},
// 高索台
	"3012" : {
	COND : {		//里面条件为且关系
			"1002" : 15,//生存天数>=20

			"1010" : {
			 	3002 : 1, 	//某个建筑>=1级
 			},
		},
		["1"] : {
			NAME : "高索台",
			DURATION : 150, 
			P_TIME : 5400, 	// 建造时间
			R_TIME : 2700, 	// 维修时间		
			DURA_COST :0,	//使用时耐久消耗	
			DESC : "探险家才能制作出来的高索台，大大降低从营地往返某些地点的成本",	
			UPGRADE : {
				"4003":24,
				"4000":8,
				"4005":0,
				"4004":22,
				"4001":0,
			},
			REPAIR:{
				"4003":24,
				"4000":8,
				"4005":0,
				"4004":22,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},

// 仓库
	"3013" : {
		["1"] : {
			NAME : "仓库",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "储存物品的仓库，只要不是野兽的入侵，其中的东西不会损坏",	
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},

// 门
	"3014" : {
		["1"] : {
			NAME : "门",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "出门",	
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},



// 朱莉的长弓
	"3100" : {
		COND : {		//里面条件为且关系
			"1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
				{							//{}里面为或
					"b8" : 1, 				//0为未发生，1为发生					  
				},		
			],
		},
		["1"] : {
			NAME : "朱莉的长弓",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "朱莉在荒野时使用过的长弓，受到了奇特的加持，帮助朱莉成为了【铁伯爵】",	
			STORY:'b8',
			IMG:'101',
			ITEM : '4122',
			SIMG :'101_1',
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},

// 老贝的草裙
	"3101" : {
		COND : {		//里面条件为且关系
			"1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
				{							//{}里面为或
					"e8" : 1, 				//0为未发生，1为发生					  
				},		
			],
		},	
		["1"] : {
			NAME : "老贝的草裙",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "老贝有着四分之一的苏格兰血统，这条他自制的裙子能让他想起慈祥的祖母",	
			STORY:'e8',
			IMG:'102',
			ITEM : '4119',
			SIMG :'102_1',
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},

// 罗兰的食谱
	"3102" : {
		COND : {		//里面条件为且关系
			"1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
				{							//{}里面为或
					"c9" : 1, 				//0为未发生，1为发生					  
				},		
			],
		},	
		["1"] : {
			NAME : "罗兰的食谱",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "罗兰作为历史上最伟大的料理家之一，与其在荒野的事迹有关，也正因为如此，开创了荒野菜系",	
			STORY:'c9',
			IMG:'103',
			SIMG :'103_1',
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},

// 神秘圆球
	"3103" : {
		COND : {		//里面条件为且关系
			"1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
				{							//{}里面为或
					"m0" : 1, 				//0为未发生，1为发生					  
				},		
			],
		},	
		["1"] : {
			NAME : "神秘圆球",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "神秘的圆球，似乎有不止一种颜色，不知道有什么用处",	
			STORY:'c1',
			IMG:'104',
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},
// // 小哥的手电
// 	"3104" : {
// 		COND : {		//里面条件为且关系
// 			"1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
// 				{							//{}里面为或
// 					"w8" : 1, 				//0为未发生，1为发生					  
// 				},		
// 			],
// 		},	
// 		["1"] : {
// 			NAME : "小哥的手电",
// 			DURATION : "MAX", 
// 			P_TIME : 0, 	// 建造时间
// 			R_TIME : 0, 	// 维修时间			
// 			DESC : "小哥的手电",	
// 			STORY:'w8',
// 			IMG:'104',
// 			SIMG :'104_1',
// 			UPGRADE : {
// 				"4003":0,
// 				"4000":0,
// 				"4005":0,
// 				"4004":0,
// 				"4001":0,
// 			},
// 			REPAIR:{
// 				"4003":0,
// 				"4000":0,
// 				"4005":0,
// 				"4004":0,
// 				"4001":0,
// 			},
// 			EVENTS : {
				
// 			}
// 		},
// 	},
// 野食小哥暂无道具
	"3105" : {
		COND : {		//里面条件为且关系
			"1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
				{							//{}里面为或
					"w8" : 1, 				//0为未发生，1为发生					  
				},		
			],
		},	
		["1"] : {
			NAME : "小哥的手电",
			DURATION : "MAX", 
			P_TIME : 0, 	// 建造时间
			R_TIME : 0, 	// 维修时间			
			DESC : "小哥的手电",	
			STORY:'w8',
			IMG:'104',
			SIMG :'104_1',
			UPGRADE : {
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			REPAIR:{
				"4003":0,
				"4000":0,
				"4005":0,
				"4004":0,
				"4001":0,
			},
			EVENTS : {
				
			}
		},
	},
};