exports.CT_ROLE = "1000"; 	// 条件类型: 角色（美食家冶金师探险家等）
exports.CT_PASS = "1001"; 	// 条件类型: 剧情点状态判断类型
exports.CT_SUR = "1002"; 	// 条件类型: 生存天数大于等于
exports.CT_POT = "1003"; 	// 条件类型: 关卡解锁/完成
exports.CT_ITEM = "1004"; 	// 条件类型: 仓库和背包道具大于等于
exports.CT_WEA = "1005"; 	// 条件类型: 天气
exports.CT_TEM = "1006"; 	// 条件类型: 温度计温度
exports.CT_SEA = "1007"; 	// 条件类型: 季节
exports.CT_PET = "1008"; 	// 条件类型: 宠物标识
exports.CT_STA = "1009"; 	// 条件类型: 角色生存状态
exports.CT_BUI = "1010"; 	// 条件类型: 营地建筑等级和建筑分支
exports.CT_NPC = "1011"; 	// 条件类型: NPC好感度
exports.CT_RES = "1012"; 	// 条件类型: 资源点资源数量
exports.CT_CAM = "1013"; 	// 条件类型: 骆驼标识
exports.CT_QUE = "1014"; 	// 条件类型: 帐号级完成标识
exports.CT_BAIT = "1015"; 	// 条件类型: 鱼饵
exports.CT_TIME = "1016"; 	// 条件类型: 时刻

exports.CT_BAG = "1017"; 	// 条件类型: 背包是否解锁
exports.CT_SHOE = "1018"; 	// 条件类型: 鞋子是否解锁
exports.CT_LACK_ITEM = "1019"; 	// 条件类型: 仓库和背包道具小于等于

exports.CT_MONSTER_ATK = "1020"; 	// 条件类型: 遇到夜袭的次数大于等于
exports.CT_SECRET = "1021"; 	// 条件类型: 遭遇密道次数大于等于
exports.CT_LOAD = "1022"; 	// 条件类型: 背包负重大于等于
exports.CT_GOODS = "1023",	// 条件类型：指定商品是否解锁(且关系)
exports.CT_CIRCLE = "1024", //条件类型:游戏循环次数(支持并集)
exports.CT_DAY = "1025"; 	// 条件类型: 生存天数区间
exports.CT_POS = "1026"; 	// 条件类型: 当前位置在哪个pot点
exports.CT_EQU = "1027";        // 条件类型: 当前武器装备情况，0表示当前为空（拳头也算空）
exports.CT_EAGLE_ISLOCK = "1028";        // 条件类型: 是否解锁鹰
exports.CT_EAGLE_ISMEET = "1029"; 	// 条件类型: 是否需要遇到过鹰
exports.CT_POT_REACH = "1030";       // 条件类型: POT点进度
exports.CT_GOODS_EX = "1031";      // 条件类型：指定商品是否解锁(或关系)
exports.CT_NEEDLEAD = "1032";      // 条件类型：是否需要引导



// COND : {		//里面条件为且关系
// 			"1000" : 1000,	//1000美食家
																																
// 			"1001" : [			// 1001说明是剧情点是否触发为条件，{}外面为且
// 				{							//{}里面为或
// 					"e1" : 1, 	//0为未发生，1为发生
// 					"e2" : 0, 
					  
// 				},	
// 				{
// 					"e3" : 0,
// 				}			
// 			],

// 			"1002" : 10,	//生存天数>=10

// 			"1003" : [			// 条件类型: 关卡解锁/完成
// 				{
// 					"1" : {
// 						UNLOCK : true,		// 关卡是否要求解锁
// 						COMPLETE : false ,// 关卡是否要求完成
// 					},
// 					"2" : {
// 						UNLOCK : true,		// 关卡是否要求解锁
// 						COMPLETE : true ,// 关卡是否要求完成
// 					},
// 				},			
// 			],

// 			"1004" : {	// 条件类型: 仓库和背包道具大于等于

// 			   "4000" :10,

// 			   "4001" :5,
// 			},

// 			"1005" : 1,	//天气

// 			"1006" : {
// 				MIN:10,
// 				MAX:20,
// 			},	//温度10-20之间

// 			"1007" : 1,	//季节
// 
// 			"1008" : 1, //宠物ID
// 
// 			"1009" : {//角色状态
// 			
                 // "7000" : {
                 //         "MIN":10,
                 //         "MAX":20,
                 // },
         
                 // "7001" : {
                 //         "MIN":10,
                 //         "MAX":20,
                 // }, 			
// 			},
// 			"1010" : [//建筑等级和建筑分支,精确匹配不向低等级兼容，括号内为或关系
// 			
                                // "3002:1",
                                // "3002:2"
// 			
// 			],
// 			"1011" : {//NPC好感度
// 			
// 					"2001" : 0,
// 					"2002" : 10,
// 			
// 			},
// 			"1012" : {//资源点资源数量
// 			
// 					"1003" : {
// 					 		"2" : 12,
// 					 		},
// 					"1004" : {
// 					 		"5" : 15,
// 					 		},
// 			
// 			},
// 			"1013" : true,	//骆驼 

// 			
// 			
// "1014" : [								// 1001说明是剧情点是否触发为条件，{}外面为且
// 				{							//{}里面为或
// 					"e8" : 1, 				//0为未发生，1为发生					  
// 				},		
// 			],
// "1015" : [								// []里面为或
// 				'4020',
//				"4021"	
// 			],
// 	"1016" : {
// 				"MIN":10,
// 				"MAX":20,
// 			},	//在10点到20点之间
// 			
// 			"1017" : {
// 				UNLOCK : 0,
// 			},	//背包 
// 			
// 			"1018" : {
// 				UNLOCK : 0,
// 			},	//鞋子 
// 			
// 			"1019" : {	// 条件类型: 仓库和背包道具小于等于

// 			   "4000" :10,

// 			   "4001" :5,
// 			},
// 			
// 			"1020" : {
// 				TIMES:1,	//遇夜袭次数
// 				},
// 			"1021" : {
// 				TIMES:1,	//发现密道次数
// 				},
// 			"1022" : {
// 				WEIGHT:40,	//背包负重
// 				},	
// 			"1023" : {//22商品未解锁且23商品已解锁
// 			
// 					"22" : 0,
// 					"23" : 1,
// 			},
// 			"1024" : [ //循环游戏次数(>=1)
// 				{MIN:1, MAX:2},
// 				{MIN:4, MAX:6},
// 			],
// 			"1025" : {
// 				MIN:10,
// 				MAX:20,
// 			},//天数区间
// 			
// 			"1026" : 1  //当前位置在哪个pot点，为0的时候需要加""
// 			"1027" : {	// 条件类型: 当前武器装备情况，0表示当前为空（拳头也算空）
// 			   "1" :"4100#4101",
// 			   "2" :"4104",
// 			   "3" :"4109",
// 			   "4" :"4114",
// 			   "5" :"4117"
// 			},
//                      "1028" : 1  //1表示需要已经解锁过，0表示不需要已经解锁过,
//                      "1029" : 1  //1表示需要遇到过，0表示不需要遇到过,
//                      "1030" : {      // 条件类型: POT点进度
//                         "1" :"1"
//                      },
//                      "1031" : {//22商品未解锁或23商品已解锁
//                                      "22" : 0,
//                                      "23" : 1,
//                      },
//                      "1032" : 1 //1表示需要引导