// 
exports.getFish = function(){
   return HY_FISH;
};

var HY_FISH = {
	"0":{
		NAME:'等待了一会，好像并没有什么东西上钩',
		WEIGHT : 40,	// 此物品掉落的概率
	},
	"1":{
		NAME:'鲳鱼',
		PATH:'5001',
		ITEMID:'5001',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1006" : {
 				MIN:20,
 				MAX:50,
 			},	//温度20-50之间
			"1005" : 1,	
			"1016" : {
 				MIN:10,
 				MAX:20,
 			},	//时刻20-50之间
		},	
	},
	"2":{
		NAME:'鲷鱼',
		PATH:'5002',
		ITEMID:'5002',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 5,	// 此物品掉落的概率
		COND : {
			"1006" : {
 				MIN:18,
 				MAX:36,
 			},	//温度20-50之间
			"1005" : 1,	
			"1016" : {
 				MIN:2,
 				MAX:10,
 			},	//时刻20-50之间
		},	
	},
	"3":{
		NAME:'海参',
		PATH:'5003',
		ITEMID:'5003',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'只',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1002" : 15,
			"1006" : {
 				MIN:0,
 				MAX:20,
 			},	//温度20-50之间
		},
	},
	"4":{
		NAME:'海鲂',
		PATH:'5004',
		ITEMID:'5004',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1007" : 4,
		},
	},
	"5":{
		NAME:'海鲈鱼',
		PATH:'5005',
		ITEMID:'5005',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1007" :[								// []里面为或
 				'1',
				"3"	
 			],
			"1015" :[								// []里面为或
 				'5019'
 			],
		},
	},
	"6":{
		NAME:'海豚鱼',
		PATH:'5006',
		ITEMID:'5006',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 4,	// 此物品掉落的概率
		COND : {
			"1015" :[								// []里面为或
 				'5008'
 			],
		},
	},
	"7":{
		NAME:'河豚',
		PATH:'5007',
		ITEMID:'5007',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'只',
		WEIGHT : 5,	// 此物品掉落的概率
		COND : {
			"1015" :[								// []里面为或
 				'5008'
 			],
			"1002" : 15,
			"1016" : {
 				MIN:15,
 				MAX:20,
 			},	//时刻20-50之间
		},
	},
	"8":{
		NAME:'河虾',
		PATH:'5008',
		ITEMID:'5008',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'只',
		WEIGHT : 10,	// 此物品掉落的概率
		COND : {
			
		},
	},
	"9":{
		NAME:'岩鱼',
		PATH:'5009',
		ITEMID:'5009',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1006" : {
 				MIN:20,
 				MAX:50,
 			},	//温度20-50之间
			"1015" :[								// []里面为或
 				'5019'
 			],
		},	
	},
	"10":{
		NAME:'黑鱼',
		PATH:'5010',
		ITEMID:'5010',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 4,	// 此物品掉落的概率
		COND : {
			"1015" :[								// []里面为或
 				'5008'
 			],
			"1016" : {
 				MIN:18,
 				MAX:24,
 			},	//时刻20-50之间
		},
	},
	"11":{
		NAME:'红鲑鱼',
		PATH:'5011',
		ITEMID:'5011',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1007" : 3,
			"1002" : 10,
		},
		"1016" : {
 				MIN:11,
 				MAX:13,
 			},	//时刻20-50之间
	},
	"12":{
		NAME:'蝴蝶鱼',
		PATH:'5012',
		ITEMID:'5012',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1005" : 1,
		},
	},
	"13":{
		NAME:'虎纹岩鱼',
		PATH:'5013',
		ITEMID:'5013',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 2,	// 此物品掉落的概率
		COND : {
			"1006" : {
 				MIN:20,
 				MAX:50,
 			},	//温度20-50之间
			"1015" :[								// []里面为或
 				'5019'
 			],
			"1016" : {
 				MIN:10,
 				MAX:18,
 			},	//时刻20-50之间
		},
	},
	"14":{
		NAME:'剑鱼',
		PATH:'5014',
		ITEMID:'5014',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 2,	// 此物品掉落的概率
		COND : {
			"1002" : 10,
			"1015" :[								// []里面为或
 				'5024'
 			],
			"1016" : {
 				MIN:15,
 				MAX:20,
 			},	//时刻20-50之间
		},
	},
	"15":{
		NAME:'蓝鳍金枪鱼',
		PATH:'5015',
		ITEMID:'5015',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 2,	// 此物品掉落的概率
		COND : {
			"1002" : 15,
			"1006" : {
 				MIN:3,
 				MAX:30,
 			},	//温度20-50之间
			"1016" : {
 				MIN:0,
 				MAX:6,
 			},	//时刻20-50之间
		},
	},
	"16":{
		NAME:'老虎斑',
		PATH:'5016',
		ITEMID:'5016',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 2,	// 此物品掉落的概率
		COND : {
			"1005" : 2,
		},
		"1016" : {
 				MIN:10,
 				MAX:20,
 			},	//时刻20-50之间
	},
	"17":{
		NAME:'龙虾',
		PATH:'5017',
		ITEMID:'5017',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'只',
		WEIGHT : 8,	// 此物品掉落的概率
		COND : {
		},	
	},
	"18":{
		NAME:'罗非鱼',
		PATH:'5018',
		ITEMID:'5018',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 4,	// 此物品掉落的概率
		COND : {
		},
	},
	"19":{
		NAME:'泥鳅',
		PATH:'5019',
		ITEMID:'5019',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 12,	// 此物品掉落的概率
		COND : {
		},
	},
	"20":{
		NAME:'鲶鱼',
		PATH:'5020',
		ITEMID:'5020',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 4,	// 此物品掉落的概率
		COND : {
		},
	},
	"21":{
		NAME:'螃蟹',
		PATH:'5021',
		ITEMID:'5021',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'只',
		WEIGHT : 5,	// 此物品掉落的概率
		COND : {
			"1002" : 10,
		},
	},
	"22":{
		NAME:'旗鱼',
		PATH:'5022',
		ITEMID:'5022',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 5,	// 此物品掉落的概率
		COND : {
			"1000" : 1003,
		},
	},
	"23":{
		NAME:'鲭鱼',
		PATH:'5023',
		ITEMID:'5023',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
		},
	},
	"24":{
		NAME:'秋刀鱼',
		PATH:'5024',
		ITEMID:'5024',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 4,	// 此物品掉落的概率
		COND : {
			"1002" : 5,
		},
	},
	"25":{
		NAME:'三文鱼',
		PATH:'5025',
		ITEMID:'5025',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1015" :[								// []里面为或
 				'5019'
 			],
		},	
	},
	"26":{
		NAME:'石斑鱼',
		PATH:'5026',
		ITEMID:'5026',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 2,	// 此物品掉落的概率
		COND : {
			"1002" : 5,
		},
	},
	"27":{
		NAME:'锯齿鲤',
		PATH:'5027',
		ITEMID:'5027',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 1,	// 此物品掉落的概率
		COND : {
			"1016" : {
 				MIN:18,
 				MAX:20,
 			},	//时刻20-50之间
		},
	},
	"28":{
		NAME:'条石鲷',
		PATH:'5028',
		ITEMID:'5028',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
		},
	},
	"29":{
		NAME:'鳕鱼',
		PATH:'5029',
		ITEMID:'5029',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'条',
		WEIGHT : 3,	// 此物品掉落的概率
		COND : {
			"1007" : 4,
			"1016" : {
 				MIN:20,
 				MAX:24,
 			},	//时刻20-50之间
		},
	},
	"30":{
		NAME:'章鱼',
		PATH:'5030',
		ITEMID:'5030',
		MIN : 1,		// 此物品掉落的最小数量
		MAX : 1,		// 此物品掉落的最大数量
		UNIT:'只',
		WEIGHT : 2,	// 此物品掉落的概率
		COND : {
		},
	},
	"31":{
		NAME:'水蟒',
		EVENT : '5031',
		WEIGHT : 5,	// 此物品掉落的概率
		TYPE:'fight',
		COND : {
			"1002" : 10,
		},
	},
	"32":{
		NAME:'食人鱼',
		EVENT : '5032',
		WEIGHT : 3,	// 此物品掉落的概率
		TYPE:'fight',
		COND : {
			"1002" : 10,
			"1015" :[								// []里面为或
 				'4020'
 			],
		},
	},
	"33":{
		NAME:'鳄鱼',
		EVENT : '5033',
		WEIGHT : 3,	// 此物品掉落的概率
		TYPE:'fight',
		COND : {
			"1002" : 30,
		},
	},
	"34":{
		NAME:'鳄鱼',
		EVENT : '5034',
		WEIGHT : 3,	// 此物品掉落的概率
		TYPE:'fight',
		COND : {
			"1002" : 30,
		},
	},
	"35":{
		NAME:'鲨鱼',
		EVENT : '5035',
		WEIGHT : 5,	// 此物品掉落的概率
		TYPE:'fight',
		COND : {
			"1002" : 30,
			"1015" :[								// []里面为或
 				'4020'
 			],
		},
	},
	"36":{
		NAME:'破旧的箱子',
		EVENT : '5036',
		WEIGHT : 1,	// 此物品掉落的概率
		TYPE:'box',
		COND : {
		},
	},
	
};