// 
exports.getById = function(bid){
	return dy.utils.clone(HY_MAZES[bid.toString()]);
	// return HY_MAZES[bid.toString()];
};

exports.getDesc = function(bid){
	return dy.utils.clone(DESC[bid.toString()]);
	// return DESC[bid.toString()];
};

var DESC = {//四位二进制分别表示北南西东四个方向是否可以通行
	"1111" : "你观察了四周，东南西北都有路，到底应该往哪走呢？",
	"1110" : "你停下脚步，发现东面是{SCENE}，看来是走不通了，接下来往哪走",
	"1101" : "你来到这里，西面是{SCENE}，那么剩下三个方向往哪走？",
	"1100" : "从这里来看，东西两面都是{SCENE}，只有南北两面勉强可以通过，走哪边呢？",
	"1011" : "你仔细看了四周，除了南面是{SCENE}，其他地方都可以通行，那么往哪边走呢？",
	"1010" : "前方有岔路，北面和西面都勉强可以穿过，南面和东面都是{SCENE}，那么往哪边走呢？",
	"1001" : "南面和西面都是{SCENE}，看来能走的只有东面和北面了，那么往哪走？",
	"1000" : "除了北面，其他三个方向都是{SCENE}，看来只能往北面走了。",
	"0111" : "你似乎有点迷失，前方北面被{SCENE}挡住去路，看来只能往其余方向走了。",
	"0110" : "走了一阵，你发现北面和东面都是{SCENE}，那么往南还是往西呢？",
	"0101" : "北面和西面都被{SCENE}挡住去路，看来只能在东面或是南面选择一个方向走了。",
	"0100" : "除了南面，其他三个方向都是{SCENE}，看来只能走南面了。",
	"0011" : "你发现这里西面和东面都勉强可以穿过，而北面和南面都是{SCENE}，那么往哪边走呢？",
	"0010" : "从这里来看，只有西面可以通行，其他三个方向都是{SCENE}，一路向西吧。",
	"0001" : "你环顾了一下，发现其他三个方向都是{SCENE}，只有东方可以通行。",
}

var HY_MAZES = {

	"1":{//首次迷宫
		ID : "1",	//从sudden表映射过来的ID
		CODE : [
		"00003828206000",
		"0002020e020e08",
		"080e020e000000",
		"001f1018000000",

		],	//读取的是迷宫的形状
		TITLE : "奇异森林",		//方向盘界面上顶部标题
		SCENE : ["带刺的荆棘","不知名的树","很陡的斜坡"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		// M_WEIGHT :0,	//测试
		PIC : [1001],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 6001,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石块字迹",
                    TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
                },
            },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "幼狼",
                PIC : "Texture/Monster/1002",
                MONSTER : [1001],
                DANGER : "1",
                DROP_ID : 0,
                DESC : "一只幼狼出现在你的面前，并向你摆出了战斗的姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了幼狼",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败幼狼时，发现了破损的石片，上面似乎写着什么。",
                },
            },
        ],
	},

	"2":{//竹林迷宫
		ID : "2",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",

		],	//读取的是迷宫的形状
		TITLE : "迷幻竹林",		//方向盘界面上顶部标题
		SCENE : ["茂密的竹子"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		// M_WEIGHT :0,	//测试	
		PIC : [1002],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样

        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "野猪",
                PIC : "Texture/Monster/1008",
                MONSTER : [1008,1008],
                DANGER : "2",
                DROP_ID : 6002,
                DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪",//关卡战斗结束描述
            },
        ],
	},

	"3":{//瀑布迷宫
		ID : "3",	//从sudden表映射过来的ID
		CODE : [
		"00003828206000",
		"0002020e020e08",
		"080e020e000000",
		"001f1018000000",
		"0003020a0e0000",
		"001e121a020604",
		"00000008080f00",
		"00000018107000",
		"00000e0a021e10",
		],	//读取的是迷宫的形状
		TITLE : "迷雾森林",		//方向盘界面上顶部标题
		SCENE : ["湍急的溪流","茂密的灌木丛","很陡的斜坡","巨大的断木"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		// M_WEIGHT :0,	//测试	
		PIC : [1003],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "狼",
                PIC : "Texture/Monster/1001",
                MONSTER : [1002],
                DANGER : "2",
                DROP_ID : 6002,
                DESC : "一头狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼",//关卡战斗结束描述
            },
        ],
	},

	"4":{//暗流迷宫
		ID : "4",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",
		"081e120a0e0000",

		],	//读取的是迷宫的形状
		TITLE : "静谧森林",		//方向盘界面上顶部标题
		SCENE : ["急速的暗流","密集的刺丛","巨大的树木"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		// M_WEIGHT :0,	//测试	
		PIC : [1004],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "野猪群",
                PIC : "Texture/Monster/1009",
                MONSTER : [1008,1009],
                DANGER : "3",
                DROP_ID : 6002,
                DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪",//关卡战斗结束描述
            },
        ],
	},

	"5":{//溶洞迷宫
		ID : "5",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",
		"081e120a0e0000",
		"00000018103e08",

		],	//读取的是迷宫的形状
		TITLE : "空灵溶洞",		//方向盘界面上顶部标题
		SCENE : ["惨白的石壁","未知的深渊"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		// M_WEIGHT :0,	//测试	
		PIC : [1005],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1021",
                MONSTER : [1021],
                DANGER : "2",
                DROP_ID : 6002,
                DESC : "你突然感受到什么动静，仔细一看，一条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
        ],
	},

	"6":{//雨林迷宫
		ID : "6",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",
		"081e120a0e0000",
		"00000018103e08",
		"003e2a2a027e00",
		"00000018127e00",
		"003e2a2a220e08",
		"023e203e143400",
		"00380e3a121604",
		"103a222e283800",
		"00243c28203e04",
		"083e222a2e2800",
		"001f301e101e00",
		"043c202e3a2a00",
		"001e28283c1410",
		"00133a2e203e00",
		"003a2e38101e04",
		"003c242e223e08",
		"0008187e0c0800",
		"04262c2c3e3000",
		"04161a3e183e00",
		"001c3e28203c04",
		"003f222a2e3a00",
		"081e341c083800",
		"0024263c1e1010",
		"003e286c2e3a00",
		"000e3a2a2a3810",
		],	//读取的是迷宫的形状
		TITLE : "混乱雨林",		//方向盘界面上顶部标题
		SCENE : ["茂密的灌木丛","很陡的斜坡","湍急的溪流"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		PIC : [1006],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "猛虎",
                PIC : "Texture/Monster/1025",
                MONSTER : [1025],
                DANGER : "4",
                DROP_ID : 6002,
                DESC : "一只猛虎出现在你的视野里，你没想到这里居然还有猛虎，看样子难免一战",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了猛虎",//关卡战斗结束描述
            },
        ],
	},

	"7":{//松木林迷宫
		ID : "7",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",
		"081e120a0e0000",
		"00000018103e08",
		"003e2a2a027e00",
		"00000018127e00",
		"003e2a2a220e08",
		"023e203e143400",
		"00380e3a121604",
		"103a222e283800",
		"00243c28203e04",
		"083e222a2e2800",
		"001f301e101e00",
		"043c202e3a2a00",
		"001e28283c1410",
		"00133a2e203e00",
		"003a2e38101e04",
		"003c242e223e08",
		"0008187e0c0800",
		"04262c2c3e3000",
		"04161a3e183e00",
		"001c3e28203c04",
		"003f222a2e3a00",
		"081e341c083800",
		"0024263c1e1010",
		"003e286c2e3a00",
		"000e3a2a2a3810",
		],	//读取的是迷宫的形状
		TITLE : "镜像树林",		//方向盘界面上顶部标题
		SCENE : ["看似一样的松木"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		PIC : [1007],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004],
                DANGER : "4",
                DROP_ID : 6002,
                DESC : "一只狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼时，发现了破损的石片，上面似乎写着什么。",
                },
            },
        ],
	},

	"8":{//山脉迷宫
		ID : "8",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",
		"081e120a0e0000",
		"00000018103e08",
		"003e2a2a027e00",
		"00000018127e00",
		"003e2a2a220e08",
		"023e203e143400",
		"00380e3a121604",
		"103a222e283800",
		"00243c28203e04",
		"083e222a2e2800",
		"001f301e101e00",
		"043c202e3a2a00",
		"001e28283c1410",
		"00133a2e203e00",
		"003a2e38101e04",
		"003c242e223e08",
		"0008187e0c0800",
		"04262c2c3e3000",
		"04161a3e183e00",
		"001c3e28203c04",
		"003f222a2e3a00",
		"081e341c083800",
		"0024263c1e1010",
		"003e286c2e3a00",
		"000e3a2a2a3810",
		],	//读取的是迷宫的形状
		TITLE : "险峻山脉",		//方向盘界面上顶部标题
		SCENE : ["很陡的斜坡","莫名的山丘"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		PIC : [1008],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1037",
                MONSTER : [1004],
                DANGER : "4",
                DROP_ID : 6002,
                DESC : "一只狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼时，发现了破损的石片，上面似乎写着什么。",
                },
            },
        ],
	},

	"9":{//沼泽
		ID : "9",	//从sudden表映射过来的ID
		CODE : [
		"00000018700000",
		"000e0a0b000000",
		"00782828203e00",
		"007e222e000000",
		"103e223a020600",
		"00107028380000",
		"02020e0a020e00",
		"003c1718000000",
		"081e120a0e0000",
		"00000018103e08",
		"003e2a2a027e00",
		"00000018127e00",
		"003e2a2a220e08",
		"023e203e143400",
		"00380e3a121604",
		"103a222e283800",
		"00243c28203e04",
		"083e222a2e2800",
		"001f301e101e00",
		"043c202e3a2a00",
		"001e28283c1410",
		"00133a2e203e00",
		"003a2e38101e04",
		"003c242e223e08",
		"0008187e0c0800",
		"04262c2c3e3000",
		"04161a3e183e00",
		"001c3e28203c04",
		"003f222a2e3a00",
		"081e341c083800",
		"0024263c1e1010",
		"003e286c2e3a00",
		"000e3a2a2a3810",
		],	//读取的是迷宫的形状
		TITLE : "荒野沼泽",		//方向盘界面上顶部标题
		SCENE : ["看似平静的沼泽"],	//方向盘界面上通路文字描述的关键字
		R_WEIGHT :0,	//1-100小于15则为资源，15-65怪物，其余为空
		M_WEIGHT :30,	
		PIC : [1009],	//Texture/Maze路径下图片，若配多张则均匀随机抽取，用于显示在方向盘界面上

       	R_STAGE : [		//结构和普通关卡一样
            // {
            //     NAME : "乱石块",
            //     PIC : "Texture/Monster/1204",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 6001,
            //     DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了石块",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石块字迹",
            //         TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [     //结构和普通关卡一样
            {
                NAME : "鳄鱼",
                PIC : "Texture/Monster/1018",
                MONSTER : [1018],
                DANGER : "5",
                DROP_ID : 6002,
                DESC : "一只凶猛的鳄鱼从沼泽里了浮出来，打算将你作为食物",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了鳄鱼",//关卡战斗结束描述
            },
        ],
	},





};