exports.getById = function(tid){
   return HY_MOOD[tid.toString()];
};

exports.getData = function(tid){
		var arr = [];
   for(var i in HY_MOOD){
   	var _num = parseInt(i);
   	if(_num >= 2000){
   		arr.push(i);
   	}
   }
   return arr;
};

exports.getRepeatData = function(tid){
		var arr = [];

   for(var i in HY_MOOD){
   	var _num = parseInt(i);
   	if(_num < 2000){
   		arr.push(i);
   	}
   }
   return arr;
};
// 类似于"e1"这种字母+数字编号的为主线剧情, e代表冒险家, c代表美食家, b代表冶金师,a代表通用
// "100"以上编号为支线剧情（其他剧情）

exports.MO_REPEAT 	= "101";//可重复
exports.MO_NOREPEAT  	= "102";//不可重复

// exports.CT_ROLE = "1000"; 	// 条件类型: 角色（美食家冶金师探险家等）
// exports.CT_PASS = "1001"; 	// 条件类型: 剧情点状态判断类型
// exports.CT_SUR = "1002"; 	// 条件类型: 生存天数
// exports.CT_POT = "1003"; 	// 条件类型: 关卡解锁/完成
// exports.CT_ITEM = "1004"; 	// 条件类型: 道具获取
// exports.CT_WEA = "1005"; 	// 条件类型: 天气
// exports.CT_TEM = "1006"; 	// 条件类型: 温度计温度
// exports.CT_SEA = "1007"; 	// 条件类型: 季节
// exports.CT_PET = "1008"; 	// 条件类型: 宠物标识
// exports.CT_STA = "1009"; 	// 条件类型: 角色生存状态
// exports.CT_BUI = "1010"; 	// 条件类型: 营地建筑等级
// exports.CT_NPC = "1011"; 	// 条件类型: NPC好感度
// exports.CT_RES = "1012"; 	// 条件类型: 资源点资源数量
// exports.CT_CAM = "1013"; 	// 条件类型: 骆驼标识

var HY_MOOD = {

	"2001_0" : {//美食家第一天
		TYPE : "102",
		TEXT : '太阳落下的时候我才认识到, 这是真的, 这不是梦. 而我, 在荒岛, 落难了. 不过这岛上这么多食材, 活不下去的话就是料理界的耻辱. ',
		COND : {		
			"1000" : 1000,						
 			"1002" : 1,														
		},
	},

	"2001_1" : {//冶金师第一天
		TYPE : "102",
		TEXT : '太阳落下的时候我才认识到, 这是真的, 这不是梦. 而我, 在荒岛, 落难了. 可能现在最高兴的就是叔叔了, 我得想想办法, 不能便宜了他. ',
		COND : {		
			"1000" : 1001,						
 			"1002" : 1,														
		},
	},

	"2001_2" : {//探险家第一天
		TYPE : "102",
		TEXT : '格里尔斯, 隶属ECP3部队, 执行任务中, 流落荒岛, 记录下此间行程, 望有返归之时. ',
		COND : {		
			"1000" : 1002,						
 			"1002" : 1,														
		},
	},

	"2001_3" : {//探险家第一天
		TYPE : "102",
		TEXT : '太阳落下的时候, 我似乎意识到一个问题, 我似乎流落在荒野了. 而我似乎还玩过这款游戏. 还是说这只是个节目？让我找找隐藏的摄像机. ',
		COND : {		
			"1000" : 1003,						
 			"1002" : 1,														
		},
	},	
	// "2032_0" : {//美食家瀑布解锁
	// 	TYPE : "102",
	// 	TEXT : '发现瀑布, 瀑布周围有着特殊的环境, 会有特殊的食材, 看来我又有新的菜品了. 周围散落的石块也不少, 解决了这几天缺石块的困扰. ',
	// 	COND : {	
	// 		"1000" : 1000,
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"1008" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : false ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],															
	// 	},
	// },

	// "2032_1" : {//冶金师瀑布解锁
	// 	TYPE : "102",
	// 	TEXT : '发现瀑布, 记得以前哥哥说过水在高速下落过程中会与不溶于水的杂质分离, 或许以后可以在这洗澡？',
	// 	COND : {	
	// 		"1000" : 1001,
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"1008" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : false ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],																
	// 	},
	// },

	// "2032_2" : {//探险家瀑布解锁
	// 	TYPE : "102",
	// 	TEXT : '实地考察瀑布, 可添加中国式瀑布训练计划. 可获取：石片、石块. ',
	// 	COND : {	
	// 		"1000" : 1002,
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"1008" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : false ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],																	
	// 	},
	// },

	"2033_0" : {//美食家海岸解锁
		TYPE : "102",
		TEXT : '从海岸的椰子树上弄到了椰子, 椰子的味道很棒, 而且营养丰富、易于烹饪, 这种食材可谓是一级棒！',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1006" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2033_1" : {//冶金师海岸解锁
		TYPE : "102",
		TEXT : '从海岸的椰子树上弄到了椰子. 味道不错, 我喜欢这味道. 就是壳有点硬, 如果我的袖珍手枪在就好了. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1006" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2033_2" : {//探险家海岸解锁
		TYPE : "102",
		TEXT : '实地考察海岸, 危险度低. 可获取：椰子、木材、阔叶. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1006" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2033_3" : {//探险家海岸解锁
		TYPE : "102",
		TEXT : '从海岸的椰子树上弄到了椰子. 味道不错, 我喜欢这味道, 如果有点奶就能弄点椰奶尝尝了. ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1006" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},	

	// "2034_0" : {//美食家竹林解锁
	// 	TYPE : "102",
	// 	TEXT : '探索完了竹林, 收获了不少竹子和肉, 晚上吃肉！再用竹子做根长矛. ',
	// 	COND : {	
	// 		"1000" : 1000,
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"1003" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : false ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],															
	// 	},
	// },

	// "2034_1" : {//冶金师竹林解锁
	// 	TYPE : "102",
	// 	TEXT : '探索完了竹林, 收获了不少竹子和肉. 我觉得我可以将竹子做成弓箭, 尝试着从远处击杀野兽, 与野兽肉搏可不是一个女爵该有的姿态. ',
	// 	COND : {	
	// 		"1000" : 1001,
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"1003" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : false ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],																
	// 	},
	// },

	// "2034_2" : {//探险家竹林解锁
	// 	TYPE : "102",
	// 	TEXT : '完成竹林探索, 空气良好, 有野兽出没. 可获取：竹子、肉. ',
	// 	COND : {	
	// 		"1000" : 1002,
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"1003" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : false ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],																	
	// 	},
	// },

	// "2005_1" : {//冶金师竹林遇到尸体
	// 	TYPE : "102",
	// 	TEXT : '在竹林发现了一具尸体, 我立马想到了哥哥, 看来我不是第一个到这岛上的人. ',
	// 	COND : {	
	// 		"1000" : 1001,
	// 		"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
	// 			{							//{}里面为或
	// 				"b4" : 1, 	//0为未发生, 1为发生				  
	// 			},			
	// 		],																	
	// 	},
	// },
	
	"2035_0" : {//美食家丘陵解锁
		TYPE : "102",
		TEXT : '丘陵探索下来可算是有大收获, 除了有肉和草药, 居然还找到了蜂蜜, 这简直是太棒了！再不来点调料我的舌头都快退化了. ',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1004" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2035_1" : {//冶金师丘陵解锁
		TYPE : "102",
		TEXT : '离开丘陵时我看着包中的草药、肉和蜂蜜, 我从心底感到一种满足感, 一种从未有过的满足感, 以前的锦衣玉食都是伸手就来, 而现在我自强不息, 真是丰收的一天. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1004" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2035_2" : {//探险家丘陵解锁
		TYPE : "102",
		TEXT : '完成丘陵探索, 面积适中, 物种丰富. 可获取：药草、肉、蜂蜜(真棒). ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1004" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2035_3" : {//探险家丘陵解锁
		TYPE : "102",
		TEXT : '丘陵探索下来可算是有大收获, 除了有肉和草药, 居然还找到了蜂蜜, 这简直是太棒了！再不来点调料我的舌头都快退化了. (真棒). ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1004" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},	

	"2036_0" : {//美食家林中暗流解锁
		TYPE : "102",
		TEXT : '在树林中探索的时候居然还发现了一条隐蔽的暗流, 暗流周围被各种植被所围绕, 能找到很多有用的东西, 最棒的是有薄荷, 这样夏天终于能清凉一些了. ',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1007" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2036_1" : {//冶金师林中暗流解锁
		TYPE : "102",
		TEXT : '没想到在树林中间还有一条隐蔽的暗流, 暗流附近居然有这么多的植被. 家族其实也像这森林吧, 唯一不同的是, 家族中可能暗藏着好几股暗流, 都在看不见的地方流淌着. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1007" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2036_2" : {//探险家林中暗流解锁
		TYPE : "102",
		TEXT : '探索林中暗流, 植物较多, 隐藏危险较多但不致命. 可获取：藤条、薄荷. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1007" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2036_3" : {//探险家林中暗流解锁
		TYPE : "102",
		TEXT : '没想到在树林中间还有一条隐蔽的暗流, 暗流附近居然有这么多的植被. 可惜没泡面, 不然就能比较下这水和山泉水哪个更好了. ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1007" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},	
	
	"2008_0" : {//美食家第3天
		TYPE : "102",
		TEXT : '来到这片荒野已经好几天了, 倒是比我想象中好一点, 有一些像一次野外烹饪野营. ',
		COND : {		
			"1000" : 1000,						
 			"1002" : 3,														
		},
	},

	"2008_1" : {//冶金师第3天
		TYPE : "102",
		TEXT : '来到这片荒野已经好几天了, 我的精神慢慢变得差了, 因为这里晚上很难入睡, 我有些想妈妈, 如果你没有出事, 我也许就不会流落到这般田地. ',
		COND : {		
			"1000" : 1001,						
 			"1002" : 3,														
		},
	},

	"2008_2" : {//探险家第3天
		TYPE : "102",
		TEXT : '目前无致命危险, 推测较依赖物资, 将进入更深处探索. ',
		COND : {		
			"1000" : 1002,						
 			"1002" : 3,														
		},
	},


	"2008_3" : {//探险家第3天
		TYPE : "102",
		TEXT : '记不清到底是第三还是第四天, 身为野食小哥, 玩个个把月那还不是小菜一碟, 应该不会有什么意外吧. . . ',
		COND : {		
			"1000" : 1003,						
 			"1002" : 3,														
		},
	},

	"2009_0" : {//美食家第5天
		TYPE : "102",
		TEXT : '我觉得前些天我有些过于乐观了, 看来我得做好长久战斗的准备. 先从积累食材开始. ',
		COND : {		
			"1000" : 1000,						
 			"1002" : 5,														
		},
	},

	"2009_1" : {//冶金师第5天
		TYPE : "102",
		TEXT : '我觉得我可能短时间很难离开这里了, 我得做些计划部署. 从一把趁手的武器开始. ',
		COND : {		
			"1000" : 1001,						
 			"1002" : 5,														
		},
	},

	"2009_2" : {//探险家第5天
		TYPE : "102",
		TEXT : '无友军支援, 逐渐熟悉生活, 类似石器时代生活, 原任务失败. ',
		COND : {		
			"1000" : 1002,						
 			"1002" : 5,														
		},
	},

	"2009_3" : {//探险家第5天
		TYPE : "102",
		TEXT : '这几天我一点现代文明的影子都没见到, 我该真不会流落荒野了吧！早知道我就要带一箱可乐！',
		COND : {		
			"1000" : 1003,						
 			"1002" : 5,														
		},
	},

	"2024_0" : {//美食家1级栅栏
		TYPE : "102",
		TEXT : '今天回忆起当年养羊造的栅栏, 然后造了一排, 我想应该能减少些入侵吧. ',
		COND : {	
			"1000" : 1000,						
			"1010" : {//建筑等级		
					"3005" : 1,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2024_1" : {//冶金师1级栅栏
		TYPE : "102",
		TEXT : '今天回忆起小时候管家教我围栅栏, 然后试了造了一排, 我想应该能有些作用吧. ',
		COND : {		
			"1000" : 1001,								
			"1010" : {//建筑等级		
					"3005" : 1,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2024_2" : {//探险家1级栅栏
		TYPE : "102",
		TEXT : '尝试使用栅栏替代围墙, 以降低敌军入侵概率, 效果以待观察. ',
		COND : {		
			"1000" : 1002,								
			"1010" : {//建筑等级		
					"3005" : 1,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2024_3" : {//野食小哥1级栅栏
		TYPE : "102",
		TEXT : '今天回忆起当年造的栅栏, 然后造了一排, 我想应该能减少些入侵吧. ',
		COND : {		
			"1000" : 1003,								
			"1010" : {//建筑等级		
					"3005" : 1,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2010_0" : {//美食家第7天
		TYPE : "102",
		TEXT : '过去至少一周了吧, 应该, 我发现一个很重要的问题, 再这样下去, 我很快就连盘子都不会洗了. ',
		COND : {		
			"1000" : 1000,						
 			"1002" : 7,														
		},
	},

	"2010_1" : {//冶金师第7天
		TYPE : "102",
		TEXT : '过去至少一周了吧, 应该, 我发现一个重要的问题, 我这是从高贵的女爵士变成了一个村姑么？！',
		COND : {		
			"1000" : 1001,						
 			"1002" : 7,														
		},
	},

	"2010_2" : {//探险家第7天
		TYPE : "102",
		TEXT : '首周度过艰难, 暂无生命危险, 仍需继续探索, 以离开荒岛. ',
		COND : {		
			"1000" : 1002,						
 			"1002" : 7,														
		},
	},

	"2010_3" : {//探险家第7天
		TYPE : "102",
		TEXT : '一周多的时间过去了, 我发现一个很重要的问题, 我似乎瘦了点, 感觉还不错！只要能活着回去！',
		COND : {		
			"1000" : 1003,						
 			"1002" : 7,														
		},
	},	

	"2011_0" : {//美食家第10天
		TYPE : "102",
		TEXT : '看来不会有人来救我了, 或许我应该换个思路——比如试试开发一套荒岛菜系？',
		COND : {		
			"1000" : 1000,						
 			"1002" : 10,														
		},
	},

	"2011_1" : {//冶金师第10天
		TYPE : "102",
		TEXT : '我觉得我慢慢开始适应这个生活的节奏, 也许这里能帮助我打造一把绝世神兵. ',
		COND : {		
			"1000" : 1001,						
 			"1002" : 10,														
		},
	},

	"2011_2" : {//探险家第10天
		TYPE : "102",
		TEXT : '物资储备初步见效, 遭遇动植物若干, 属于未开发的小岛, 逃离后可考虑殖民. ',
		COND : {		
			"1000" : 1002,						
 			"1002" : 10,														
		},
	},

	"2011_3" : {//探险家第10天
		TYPE : "102",
		TEXT : '已经十来天了, 看来我得靠自己继续生活下去了, 先搞个日历, 不然明天就得数脚趾了. ',
		COND : {		
			"1000" : 1003,						
 			"1002" : 10,														
		},
	},

	"2002_0" : {//美食家发现药草
		TYPE : "102",
		TEXT : '太棒了！这里居然还有草药, 我的伤口可不想再继续发炎了. ',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4013" :2,
			},	 															
		},
	},

	"2002_1" : {//冶金师发现药草
		TYPE : "102",
		TEXT : '今天发现一些奇怪的植物, 有些像以前神父所说的草药, 也许可以抑制伤口的感染. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4013" :2,
			},																	
		},
	},

	"2002_2" : {//探险家发现药草
		TYPE : "102",
		TEXT : '发现药草, 可消炎止痛, 真是雪中送炭. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4013" :2,
			},													
		},
	},

	"2002_3" : {//探险家发现药草
		TYPE : "102",
		TEXT : '今天发现一些奇怪的植物, 有些像以前网上看到的草药, 也许可以抑制伤口的感染. ',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4013" :2,
			},													
		},
	},	

	// "2003_0" : {//美食家制作食物
	// 	TYPE : "102",
	// 	TEXT : '今天给自己做了在荒岛上的第一顿饭——姑且能算得上饭吧. ',
	// 	COND : {		
	// 		"1000" : 1000,			
	// 		"1010" : {//建筑等级
	// 				"3002" : 1,		
	// 		},		
	// 		"1004" : {	
	// 		   "4025" :1,
	// 		},	 															
	// 	},
	// },

	// "2003_1" : {//冶金师制作食物
	// 	TYPE : "102",
	// 	TEXT : '今天给自己做了在荒岛上的第一顿饭, 看来要有一段日子吃不上克里斯为我准备的料理了. ',
	// 	COND : {	
	// 		"1000" : 1001,	
	// 		"1010" : {//建筑等级
	// 				"3002" : 1,		
	// 		},		
 // 			"1004" : {	
	// 		   "4025" :1,
	// 		},																	
	// 	},
	// },

	// "2003_2" : {//探险家制作食物
	// 	TYPE : "102",
	// 	TEXT : '完成自制伙食, 味道略差, 饱食感略佳, 需提升口味. ',
	// 	COND : {		
	// 		"1000" : 1002,		
	// 		"1010" : {//建筑等级
	// 				"3002" : 1,		
	// 		},						
	// 		"1004" : {	
	// 		   "4025" :1,
	// 		},													
	// 	},
	// },
	// 
	// "2003_3" : {//野食小哥制作食物
	// 	TYPE : "102",
	// 	TEXT : '额, 我该不会被某个节目组整蛊了吧, 我都做了一顿饭了, 怎么还没人来接我回去. ',
	// 	COND : {		
	// 		"1000" : 1003,		
	// 		"1010" : {//建筑等级
	// 				"3002" : 1,		
	// 		},						
	// 		"1004" : {	
	// 		   "4025" :1,
	// 		},													
	// 	},
	// },

	"2004_0" : {//美食家神秘线触发
		TYPE : "102",
		TEXT : '神秘圆球里面隐藏了一张奇怪的羊皮纸, 乍一看还以为是菜单. 我思索了一番, 看来这片区域有个大秘密. ',
		COND : {		
			"1000" : 1000,		
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"m0" : 1, 	//0为未发生, 1为发生				  
				},			
			],		 															
		},
	},

	"2004_1" : {//冶金师神秘线触发
		TYPE : "102",
		TEXT : '神秘圆球里面隐藏了一张奇怪的羊皮纸, 起初还以为是什么秘籍. 我思索了一番, 看来这片区域有个大秘密. ',
		COND : {	
			"1000" : 1001,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"m0" : 1, 	//0为未发生, 1为发生				  
				},			
			],																	
		},
	},

	"2004_2" : {//探险家神秘线触发
		TYPE : "102",
		TEXT : '神秘圆球里包含不明文件, 难以破解, 推测此片区域藏有机密, 尝试继续破解文件. ',
		COND : {		
			"1000" : 1002,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"m0" : 1, 	//0为未发生, 1为发生				  
				},			
			],													
		},
	},

	"2004_3" : {//探险家神秘线触发
		TYPE : "102",
		TEXT : '神秘圆球里面隐藏了一张奇怪的羊皮纸, 乍一看还以为是通告单. 恐怕我真的是流落到了一个没人的地方. ',
		COND : {		
			"1000" : 1003,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"m0" : 1, 	//0为未发生, 1为发生				  
				},			
			],													
		},
	},

	"2006_0" : {//美食家发现薄荷
		TYPE : "102",
		TEXT : '找到了一些薄荷, 也许可以来一杯薄荷茶. ',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4022" :2,
			},	 															
		},
	},

	"2006_1" : {//冶金师发现薄荷
		TYPE : "102",
		TEXT : '找到了薄荷, 我记得管家曾经用这个泡过茶, 也许我自己也可以来一杯薄荷茶. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4022" :2,
			},																	
		},
	},

	"2006_2" : {//探险家发现薄荷
		TYPE : "102",
		TEXT : '发现薄荷, 可入药, 可尝试泡茶调节心情. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4022" :2,
			},													
		},
	},

	"2006_3" : {//探险家发现薄荷
		TYPE : "102",
		TEXT : '今天居然找到了一些薄荷, 虽然比不上龙井, 但来一杯薄荷茶也是不错的选择. ',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4022" :2,
			},													
		},
	},	

	"2007_0" : {//美食家发现椰子
		TYPE : "102",
		TEXT : '椰子可是好东西, 可惜数量不多. ',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4021" :2,
			},	 															
		},
	},

	"2007_1" : {//冶金师发现椰子
		TYPE : "102",
		TEXT : '椰子可是好东西, 话说椰汁用来淬火会是个什么效果？',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4021" :2,
			},																	
		},
	},

	"2007_2" : {//探险家发现椰子
		TYPE : "102",
		TEXT : '发现椰子, 可供食用, 味道一般, 易造成腹泻. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4021" :2,
			},													
		},
	},

	"2007_3" : {//探险家发现椰子
		TYPE : "102",
		TEXT : '椰子可是好东西, 可惜数量不多. 要不试着来个椰汁烧肉？',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4021" :2,
			},													
		},
	},


	"2012_0" : {//美食家进入夏天
		TYPE : "102",
		TEXT : '这天气越来越热了, 夏天来了. 应该来点冰镇的西瓜来解解暑. ',
		COND : {		
			"1000" : 1000,						
 			"1007" : 2,														
		},
	},

	"2012_1" : {//冶金师进入夏天
		TYPE : "102",
		TEXT : '这天气越来越热了, 看来夏天到了, 也许我该为自己准备一条裙子. ',
		COND : {		
			"1000" : 1001,						
 			"1007" : 2,														
		},
	},

	"2012_2" : {//探险家进入夏天
		TYPE : "102",
		TEXT : '空气环境良好, 气温升高, 判断为夏季来临. 夏季训练计划启动. ',
		COND : {		
			"1000" : 1002,						
 			"1007" : 2,														
		},
	},

	"2012_3" : {//探险家进入夏天
		TYPE : "102",
		TEXT : '这天气越来越热了, 夏天来了. 应该来点冰镇的可乐来解解暑. ',
		COND : {		
			"1000" : 1003,						
 			"1007" : 2,														
		},
	},	

	"2013_0" : {//美食家进入秋天
		TYPE : "102",
		TEXT : '野外的果子慢慢开始变成熟了, 看来秋天已经到了. ',
		COND : {		
			"1000" : 1000,						
 			"1007" : 3,		
 			"1002" : 100,													
		},
	},

	"2013_1" : {//冶金师进入秋天
		TYPE : "102",
		TEXT : '天气转凉, 秋季来临. 夏天太热, 冬天太冷, 秋季可是个打铁的好季节. ',
		COND : {		
			"1000" : 1001,						
 			"1007" : 3,	
 			"1002" : 100,	 																
		},
	},

	"2013_2" : {//探险家进入秋天
		TYPE : "102",
		TEXT : '空气环境良好, 气温降低, 判断为秋季来临. 开始储存冬季物资. ',
		COND : {		
			"1000" : 1002,						
 			"1007" : 3,														
 			"1002" : 100,	
		},
	},

	"2013_3" : {//美食家进入秋天
		TYPE : "102",
		TEXT : '野外的果子慢慢开始变成熟了, 看来秋天已经到了. ',
		COND : {		
			"1000" : 1003,						
 			"1007" : 3,		
 			"1002" : 100,													
		},
	},

	"2014_0" : {//美食家进入冬天
		TYPE : "102",
		TEXT : '天气越来越冷了, 看来这个冬天不好过啊. 有点想念鳕鱼的味道. ',
		COND : {		
			"1000" : 1000,						
 			"1007" : 4,		
 			"1002" : 100,													
		},
	},

	"2014_1" : {//冶金师进入冬天
		TYPE : "102",
		TEXT : '天气越来越冷了, 记得以前冬天总是在铁匠铺度过, 炉子把屋子烘的暖暖的. ',
		COND : {		
			"1000" : 1001,						
 			"1007" : 4,	
 			"1002" : 100,	 																
		},
	},

	"2014_2" : {//探险家进入冬天
		TYPE : "102",
		TEXT : '空气环境略差, 气温偏低, 判断为冬季来临. 冬季训练计划开启. ',
		COND : {		
			"1000" : 1002,						
 			"1007" : 4,														
 			"1002" : 100,	
		},
	},

	"2014_0" : {//美食家进入冬天
		TYPE : "102",
		TEXT : '天气越来越冷了, 看来这个冬天不好过啊. 想念那碗面, 告别那个冬天. ',
		COND : {		
			"1000" : 1003,						
 			"1007" : 4,		
 			"1002" : 100,													
		},
	},

	"2015_0" : {//美食家进入春天
		TYPE : "102",
		TEXT : '春天到了, 万物复苏, 野兽们饿了一个冬天, 恐怕更凶残了. ',
		COND : {		
			"1000" : 1000,						
 			"1007" : 1,													
		},
	},

	"2015_1" : {//冶金师进入春天
		TYPE : "102",
		TEXT : '春天到了, 荒野上又到了交配的季节, 野兽怕是也比平时更凶猛了. ',
		COND : {		
			"1000" : 1001,						
 			"1007" : 1,	 																
		},
	},

	"2015_2" : {//探险家进入春天
		TYPE : "102",
		TEXT : '气温回升, 判断为春季来临. 野兽实力同步提升, 需注意. ',
		COND : {		
			"1000" : 1002,						
 			"1007" : 1,	
		},
	},

	"2015_3" : {//探险家进入春天
		TYPE : "102",
		TEXT : '春天到了, 万物复苏, 野兽们饿了一个冬天, 恐怕更凶残了. ',
		COND : {		
			"1000" : 1003,						
 			"1007" : 1,	
		},
	},	

	"2016_0" : {//美食家发现土豆
		TYPE : "102",
		TEXT : '今天居然还发现了土豆, 我想念土豆泥的味道！',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4044" :2,
			},	 															
		},
	},

	"2016_1" : {//冶金师发现土豆
		TYPE : "102",
		TEXT : '今天居然还发现了土豆, 可以尝试找个地方把土豆种下去, 来年收获更多的土豆. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4044" :2,
			},																	
		},
	},

	"2016_2" : {//探险家发现土豆
		TYPE : "102",
		TEXT : '发现土豆若干, 根据目前物资储备, 可决定食用或种植. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4044" :2,
			},													
		},
	},

	"2016_3" : {//探险家发现土豆
		TYPE : "102",
		TEXT : '今天居然还发现了土豆, 可能我能用这些土豆做点原味的薯片. ',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4044" :2,
			},													
		},
	},	

	"2017_0" : {//美食家发现蜂蜜
		TYPE : "102",
		TEXT : '发现蜜蜂的时候我就想着肯定有蜂蜜, 果然被我找到了. 把肉烤一烤, 加上点蜂蜜, 那味道简直……',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4038" :2,
			},	 															
		},
	},

	"2017_1" : {//冶金师发现蜂蜜
		TYPE : "102",
		TEXT : '发现蜜蜂的时候我就在想蜂蜜在哪. 虽然野生的蜂蜜味道不如我想象中那么好, 不过总算是个调味品了. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4038" :2,
			},																	
		},
	},

	"2017_2" : {//探险家发现蜂蜜
		TYPE : "102",
		TEXT : '发现蜜蜂, 尾行后发现蜂蜜, 收获蜂蜜若干, 味道良好. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4038" :2,
			},													
		},
	},

	"2017_3" : {//探险家发现蜂蜜
		TYPE : "102",
		TEXT : '发现蜜蜂的时候我就想着肯定有蜂蜜, 果然被我找到了. 就是脸上被叮的包还没消肿. ',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4038" :2,
			},													
		},
	},	

	"2018_0" : {//美食家发现兽皮
		TYPE : "102",
		TEXT : '天气时好时坏, 我得多准备点衣服, 或许我能用这些兽皮给自己弄一顶厨师帽. ',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4011" :1,
			},	 															
		},
	},

	"2018_1" : {//冶金师发现兽皮
		TYPE : "102",
		TEXT : '天气时好时坏, 我得多准备点衣服, 或许我能用这些兽皮给自己弄一件真皮大衣, 原汁原味, 肯定不比克莱尔她们的差. 她们这个时候有没有想我呢. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4011" :1,
			},																	
		},
	},

	"2018_2" : {//探险家发现兽皮
		TYPE : "102",
		TEXT : '天气状态不稳定, 需要增加服装储备. 今天得到的兽皮是不错的制作材料. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4011" :1,
			},													
		},
	},

	"2018_3" : {//探险家发现兽皮
		TYPE : "102",
		TEXT : '天气时好时坏, 我得多准备点衣服, 光靠脂肪可不行, 或许我能用这些兽皮给自己弄一件真皮大衣. ',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4011" :1,
			},													
		},
	},	

	"2019_0" : {//美食家发现硫磺
		TYPE : "102",
		TEXT : '今天发现了些硫磺, 以前自己种东西的时候, 硫磺可是消灭虫害的好东西. 也许我能用这些硫磺来制造点大动静. ',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4034" :1,
			},	 															
		},
	},

	"2019_1" : {//冶金师发现硫磺
		TYPE : "102",
		TEXT : '今天闻到了硫磺的味道, 顺着味道就找到了硫磺. 如果我的袖珍手枪在就好了, 她的杀伤力可不小. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4034" :1,
			},																	
		},
	},

	"2019_2" : {//探险家发现硫磺
		TYPE : "102",
		TEXT : '今天闻到了熟悉的火药味, 最终发现硫磺若干, 可尝试进行制作火药. 没有火药的兵不是好兵. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4034" :1,
			},													
		},
	},

	"2019_3" : {//探险家发现硫磺
		TYPE : "102",
		TEXT : '今天闻到了硫磺的味道, 顺着味道就找到了硫磺. 高中化学学过这玩意没？总觉得是可以搞个大新闻的东西. ',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4034" :1,
			},													
		},
	},	

	"2020_0" : {//美食家发现硝石
		TYPE : "102",
		TEXT : '今天发现了一些矿石, 推测这些是硝石, 以前试菜的时候食物中毒, 老师给我用过这东西. ',
		COND : {		
			"1000" : 1000,								
			"1004" : {	
			   "4035" :1,
			},	 															
		},
	},

	"2020_1" : {//冶金师发现硝石
		TYPE : "102",
		TEXT : '这个小岛简直不可思议, 居然还有硝石, 看来我得研究下火药的制作, 也许我真的可以制造些大动静. ',
		COND : {		
			"1000" : 1001,							
 			"1004" : {	
			   "4035" :1,
			},																	
		},
	},

	"2020_2" : {//探险家发现硝石
		TYPE : "102",
		TEXT : '居然有硝石. 成功发现了硝石, 并获取部分, 开始尝试制作火药. ',
		COND : {		
			"1000" : 1002,						
			"1004" : {	
			   "4035" :1,
			},													
		},
	},

	"2020_3" : {//探险家发现硝石
		TYPE : "102",
		TEXT : '这个小岛简直不可思议, 居然还有硝石, 这个节奏是让我自己造火药？我是美食博主, 不是军火博主啊！',
		COND : {		
			"1000" : 1003,						
			"1004" : {	
			   "4035" :1,
			},													
		},
	},

	"2021_0" : {//美食家3级睡袋
		TYPE : "102",
		TEXT : '看来今晚一定能在这个豪华大床上做个好梦！希望能在梦里见到烤芝士. ',
		COND : {	
			"1000" : 1000,							
			"1010" : {//建筑等级		
					"3003" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2021_1" : {//冶金师3级睡袋
		TYPE : "102",
		TEXT : '今天算是完成了属于自己的高级大床, 简直是皇室待遇. ',
		COND : {		
			"1000" : 1001,								
			"1010" : {//建筑等级		
					"3003" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2021_2" : {//探险家3级睡袋
		TYPE : "102",
		TEXT : '睡袋升级完毕, 提升睡眠质量. ',
		COND : {		
			"1000" : 1002,								
			"1010" : {//建筑等级		
					"3003" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2021_3" : {//野食小哥3级睡袋
		TYPE : "102",
		TEXT : '也就我这种动手能力这么强的人才能在这么短时间里做出这么高级的床了. ',
		COND : {		
			"1000" : 1003,								
			"1010" : {//建筑等级		
					"3003" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},	

	"2022_0" : {//美食家3级厨房
		TYPE : "102",
		TEXT : '太棒了！新的厨房一定能来带更棒的料理. ',
		COND : {
			"1000" : 1000,								
			"1010" : {//建筑等级		
					"3002" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2022_1" : {//冶金师3级厨房
		TYPE : "102",
		TEXT : '新的厨房, 看来能做些营养均衡的东西了. ',
		COND : {		
			"1000" : 1001,								
			"1010" : {//建筑等级		
					"3002" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2022_2" : {//探险家3级厨房
		TYPE : "102",
		TEXT : '厨房升级完毕, 提升食物质量. ',
		COND : {		
			"1000" : 1002,								
			"1010" : {//建筑等级		
					"3002" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2022_3" : {//野食小哥3级厨房
		TYPE : "102",
		TEXT : '一本正经的做美食是一本正经做美食节目的前提, 当然, 有个好的厨房就更棒了. ',
		COND : {		
			"1000" : 1003,								
			"1010" : {//建筑等级		
					"3002" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2023_0" : {//美食家3级工具台
		TYPE : "102",
		TEXT : '我觉得我在制作东西方面的天赋被激发了出来. 比如新的工具台. ',
		COND : {	
			"1000" : 1000,							
			"1010" : {//建筑等级		
					"3000" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2023_1" : {//冶金师3级工具台
		TYPE : "102",
		TEXT : '我觉得我在制作东西方面的天赋被激发了出来. 比如新的工具台. ',
		COND : {		
			"1000" : 1001,								
			"1010" : {//建筑等级		
					"3000" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2023_2" : {//探险家3级工具台
		TYPE : "102",
		TEXT : '工具台升级完毕, 提升可制作物品种类, 提高制作效率. ',
		COND : {		
			"1000" : 1002,								
			"1010" : {//建筑等级		
					"3000" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2023_3" : {//野食小哥3级工具台
		TYPE : "102",
		TEXT : '我觉得我的动手能力又上升了一步, 哎, 我怎么这么优秀. ',
		COND : {		
			"1000" : 1003,								
			"1010" : {//建筑等级		
					"3000" : 3,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},



	"2025_0" : {//美食家2级医疗箱
		TYPE : "102",
		TEXT : '荒岛上难免有个小毛小病. 好的厨师要学会控制伤病. ',
		COND : {	
			"1000" : 1000,						
			"1010" : {//建筑等级		
					"3004" : 2,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2025_1" : {//冶金师2级医疗箱
		TYPE : "102",
		TEXT : '荒岛上难免有个小毛小病. 我要学会控制伤病. ',
		COND : {		
			"1000" : 1001,								
			"1010" : {//建筑等级		
					"3004" : 2,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2025_2" : {//探险家2级医疗箱
		TYPE : "102",
		TEXT : '医疗箱升级完毕, 医疗水平提高, 保证前线战斗力量. ',
		COND : {		
			"1000" : 1002,								
			"1010" : {//建筑等级		
					"3004" : 2,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},

	"2025_3" : {//野食小哥2级医疗箱
		TYPE : "102",
		TEXT : '荒岛上难免有个小毛小病. 要准备点常用药以防不时之需. ',
		COND : {		
			"1000" : 1003,								
			"1010" : {//建筑等级		
					"3004" : 2,		
			},											
		},	
		// ATTRS : {   //剧情产生的属性效果
		// "7001" : -10,
		// 	},
	},


	"2026_0" : {//美食家遇到白狼
		TYPE : "102",
		TEXT : '白天看见了一只巨大的白狼, 该死, 我的第一反应居然是又有肉吃了. 我被吓坏了, 两腿发软. 还好没成为它的盘中餐. ',
		COND : {
			"1000" : 1000,							
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2001" : 1,			
			},										
		},	
	},

	"2026_1" : {//冶金师遇到白狼
		TYPE : "102",
		TEXT : '今天发现了一只巨大的白狼, 直觉告诉我, 它接近我并没有什么恶意, 不过我们还是没有进行接触, 万一我的直觉出了问题就不好了. ',
		COND : {		
			"1000" : 1001,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2001" : 1,			
			},											
		},	
	},

	"2026_2" : {//探险家遇到白狼
		TYPE : "102",
		TEXT : '遭遇白狼一只. 体型巨大, 未有接触. 仍需观察. ',
		COND : {		
			"1000" : 1002,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2001" : 1,			
			},										
		},	
	},

	"2026_3" : {//野食小哥遇到白狼
		TYPE : "102",
		TEXT : '白天看见了一只巨大的白狼, 它也是默默地和我对视, 谁都没有说话, 总觉得可以做好朋友. ',
		COND : {		
			"1000" : 1003,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2001" : 1,			
			},										
		},	
	},	

	"2027_0" : {//美食家遇到骆驼
		TYPE : "102",
		TEXT : '如果我的眼神没问题, 我想我今天看到的是一只骆驼. 太棒了, 也许我能驯服这头骆驼, 来帮助我越过这沙漠. ',
		COND : {	
			"1000" : 1000,						
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2002" : 1,			
			},										
		},	
	},

	"2027_1" : {//冶金师遇到骆驼
		TYPE : "102",
		TEXT : '我觉得我可能看到了一头骆驼, 如果我能驯服这头骆驼, 我应该能在沙漠中省很多事. ',
		COND : {		
			"1000" : 1001,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2002" : 1,			
			},											
		},	
	},

	"2027_2" : {//探险家遇到骆驼
		TYPE : "102",
		TEXT : '遭遇骆驼一只, 沙漠计划突破口出现, 可考虑驯服. ',
		COND : {		
			"1000" : 1002,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2002" : 1,			
			},										
		},	
	},

	"2027_3" : {//野食小哥遇到骆驼
		TYPE : "102",
		TEXT : '似乎看到了一头骆驼, 看样子, 度过沙漠的方法有了. ',
		COND : {		
			"1000" : 1003,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2002" : 1,			
			},										
		},	
	},

	"2028_0" : {//美食家遇到野蛮人
		TYPE : "102",
		TEXT : '我原以为这地方只有我一个人, 我的意思是人类这个物种. 可我今天又见到一个人, 这个人跟我语言不通, 看样子是当地的土著, 我可能能用美食跟他们进行交流. ',
		COND : {
			"1000" : 1000,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2003" : 1,			
			},										
		},	
	},

	"2028_1" : {//冶金师遇到野蛮人
		TYPE : "102",
		TEXT : '我原以为这地方只有我一个人, 我的意思是人类这个物种. 可我今天又见到一个人, 我想表明我的爵士身份, 可这个人跟我语言不通, 看样子是当地的土著. ',
		COND : {		
			"1000" : 1001,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2003" : 1,			
			},											
		},	
	},

	"2028_2" : {//探险家遇到野蛮人
		TYPE : "102",
		TEXT : '遭遇不明势力, 单人, 未有敌对意向, 语言不通. ',
		COND : {		
			"1000" : 1002,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2003" : 1,			
			},										
		},	
	},

	"2028_3" : {//野食小哥遇到野蛮人
		TYPE : "102",
		TEXT : '我以为这个地方只有我一个人, 我的意思是人类这个物种. 我可今天又见到一个人, 有些像电视上的非洲土著. 不知道他们有没有可乐. ',
		COND : {		
			"1000" : 1003,								
			"1011" : {//NPC好感度		2001母狼 2002骆驼 2003野蛮人	
					"2003" : 1,			
			},										
		},	
	},

	"2029_0" : {//美食家获得幼狼
		TYPE : "102",
		TEXT : '今天得到了一只小狼, 看样子我得学学如何驯养一条狗, 哦不对, 是狼, 这是一转厨师, 二转猎人的样子啊. ',
		COND : {	
			"1000" : 1000,						
			"1008" : 1, //宠物ID				
		},	
	},

	"2029_1" : {//冶金师获得幼狼
		TYPE : "102",
		TEXT : '今天得到了一只小狼, 看样子还不错. 哥哥在夏威夷教过我训狗, 看来很快我就进阶成为一名女猎人了. ',
		COND : {		
			"1000" : 1001,								
			"1008" : 1, //宠物ID										
		},	
	},

	"2029_2" : {//探险家获得幼狼
		TYPE : "102",
		TEXT : '得到小狼一只. 可考虑训练成警犬, 增强战斗力. ',
		COND : {		
			"1000" : 1002,								
			"1008" : 1, //宠物ID								
		},	
	},

	"2029_3" : {//野食小哥获得幼狼
		TYPE : "102",
		TEXT : '今天得到了一只小狼, 或许我可以当做狗一样训练训练, 来一个与狼共舞！',
		COND : {		
			"1000" : 1003,								
			"1008" : 1, //宠物ID								
		},	
	},	

	"2030_0" : {//美食家获得骆驼
		TYPE : "102",
		TEXT : '我驯服了骆驼！以前我倒是烹饪过骆驼, 没想到这么好吃的家伙居然还挺难驯服的. ',
		COND : {
			"1000" : 1000,							
			"1013" : true,				
		},	
	},

	"2030_1" : {//冶金师获得骆驼
		TYPE : "102",
		TEXT : '骆驼已成裙下之臣. 美貌看来对任何生物都是有效的啊. ',
		COND : {		
			"1000" : 1001,								
			"1013" : true,										
		},	
	},

	"2030_2" : {//探险家获得骆驼
		TYPE : "102",
		TEXT : '驯服骆驼, 沙漠任务可按照计划进行. ',
		COND : {		
			"1000" : 1002,								
			"1013" : true,								
		},	
	},

	"2030_3" : {//野食小哥获得骆驼
		TYPE : "102",
		TEXT : '我跟骆驼四目相对, 它似乎感受到了我的想法, 最终跟着我回到了家里. ',
		COND : {		
			"1000" : 1003,								
			"1013" : true,								
		},	
	},

	"2031_0" : {//美食家帮助野蛮人
		TYPE : "102",
		TEXT : '帮助土著战胜了敌人, 我们还举行了盛大的宴会！我的拿手好菜得到了大家一致的好评！',
		COND : {	
			"1000" : 1000,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"a6" : 1, 	//0为未发生, 1为发生				  
				},			
			],																	
		},
	},

	"2031_1" : {//冶金师帮助野蛮人
		TYPE : "102",
		TEXT : '帮助土著战胜了敌人, 我们还举行了盛大的宴会！他们认可了我的爵士地位. ',
		COND : {	
			"1000" : 1001,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"a6" : 1, 	//0为未发生, 1为发生				  
				},			
			],																	
		},
	},

	"2031_2" : {//探险家帮助野蛮人
		TYPE : "102",
		TEXT : '帮助土著战胜敌人, 消耗巨大. 获取部落地位, 任务状态良好. ',
		COND : {	
			"1000" : 1002,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"a6" : 1, 	//0为未发生, 1为发生				  
				},			
			],																	
		},
	},

	"2031_3" : {//野食小哥帮助野蛮人
		TYPE : "102",
		TEXT : '帮助土著战胜了敌人, 我们还举行了盛大的宴会！我喜欢这种感觉！',
		COND : {	
			"1000" : 1003,
			"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
				{							//{}里面为或
					"a6" : 1, 	//0为未发生, 1为发生				  
				},			
			],																	
		},
	},

	"2037_0" : {//美食家雨林解锁
		TYPE : "102",
		TEXT : '从雨林回来的时候我就在想, 这片区域真的很神奇, 这么小的地方居然有这么多地貌, 多地貌带来的唯一优势就是多食材, 这简直是上天赐予我的美食之旅！',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2037_1" : {//冶金师雨林解锁
		TYPE : "102",
		TEXT : '从雨林回来时, 又是满满的收获. 我觉得我在雨林中更加如鱼得水, 能利用复杂的地形去狩猎野兽, 而不用跟野兽面对面冲锋, 这可是实实在在节省了不少力气. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2037_2" : {//探险家雨林解锁
		TYPE : "102",
		TEXT : '雨林探索完成, 物种丰富, 有野兽出没. 可获取：木材, 肉. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},


	"2037_3" : {//探险家雨林解锁
		TYPE : "102",
		TEXT : '从雨林回来的时候我就在想, 这片区域真的很神奇, 这么小的地方居然有这么多地貌, 我地理不差啊, 而这个地方的气候太反常了. 总觉得哪里有什么问题. ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},	

	"2038_0" : {//美食家松木林解锁
		TYPE : "102",
		TEXT : '松木林的出现, 很好的解决了木材的问题, 这次不能再滥砍滥伐了, 一定要维持好一个良好的生态, 毕竟十年树木百年树人, 其实一个菜品的出现也凝聚着料理人无数的心血. ',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2038_1" : {//冶金师松木林解锁
		TYPE : "102",
		TEXT : '松木林的出现, 很好的解决了木材的问题, 这次不能再滥砍滥伐了, 一定要维持好一个良好的生态, 毕竟十年树木百年树人, 一个家族更是几百年才能发展到现在的样子. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2038_2" : {//探险家松木林解锁
		TYPE : "102",
		TEXT : '松木林探索完成, 较干燥, 有野兽出没. 可获取：木材、木炭. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2038_3" : {//探险家松木林解锁
		TYPE : "102",
		TEXT : '松木林的出现, 很好的解决了木材的问题, 这次不能再滥砍滥伐了, 一定要维持好一个良好的生态, 毕竟十年树木百年树人, 微博100万粉丝也不是一朝一夕能有的. ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},	

	"2039_0" : {//美食家沙漠解锁
		TYPE : "102",
		TEXT : '很难想象这里居然还有一片荒漠, 这片区域有些像是一小块大陆, 但是涵盖了基本所有的地貌, 这里还真的是地球么？',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2039_1" : {//冶金师沙漠解锁
		TYPE : "102",
		TEXT : '从荒漠归来时我开始产生疑惑：这片区域有古怪. 我对距离的掌控一般, 但是对天气比较敏感, 这片区域与坎贝尔家族的封地差不多大, 但是家族的地貌远比不上这里丰富. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2039_2" : {//探险家沙漠解锁
		TYPE : "102",
		TEXT : '荒漠探索完成, 气温较高, 缺乏水源. 可获取：硝石. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2039_3" : {//探险家沙漠解锁
		TYPE : "102",
		TEXT : '从荒漠归来时我的疑惑更深了：这片区域有古怪. 这么小的地方, 居然聚集了这么多的生态环境, 这很像是一些游戏的设定. ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2040_0" : {//美食家雪原解锁
		TYPE : "102",
		TEXT : '我本打算找一个时间去尝试一下冰雪类型的料理, 雪熊肉、雪狼肉都是我之前不曾尝过的, 不同的温度下生长出来的肉质一定有所不同, 这是很棒的体验, 那种味道我这辈子都不会忘记. ',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2040_1" : {//冶金师雪原解锁
		TYPE : "102",
		TEXT : '我真的很兴奋, 因为我发现了一片雪原！这意味着我能再次滑雪了！而且没人占我的道！这一片雪原都是我一个人的！好吧, 得先干掉那些雪熊和雪狼. ',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2040_2" : {//探险家雪原解锁
		TYPE : "102",
		TEXT : '雪原探索完成, 空气较差, 气温偏低. 可获取：肉. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2040_3" : {//探险家雪原解锁
		TYPE : "102",
		TEXT : '这次是雪原, 虽然气温很低, 但是我的好奇心有点起来了, 这里究竟是什么地方！',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2041_0" : {//美食家沉船解锁
		TYPE : "102",
		TEXT : '我发现了一艘沉船, 就在靠近海岸的不远处, 看来这里是有其他人来过的, 但是中间出了些问题, 也许我能在沉船上探索出这片区域的秘密. ',
		COND : {	
			"1000" : 1000,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],															
		},
	},

	"2041_1" : {//冶金师沉船解锁
		TYPE : "102",
		TEXT : '我一直觉得自己的游泳能力不错, 于是这次试着往外海多游了一阵, 结果你猜我发现了什么？一艘沉船！我能接触到现在的文明了, 船上肯定有不少能用的东西, 而且这意味着, 一定会再有船接近这里！',
		COND : {	
			"1000" : 1001,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																
		},
	},

	"2041_2" : {//探险家沉船解锁
		TYPE : "102",
		TEXT : '发现沉船, 未知区域, 危险性偏高, 务必做好万全准备. ',
		COND : {	
			"1000" : 1002,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},

	"2041_3" : {//探险家沉船解锁
		TYPE : "102",
		TEXT : '我知道虽然我不擅长钓鱼, 但是游泳这种事情, 不是体重重就一定会往下沉的. ',
		COND : {	
			"1000" : 1003,
			"1003" : [			// 条件类型: 关卡解锁/完成
				{
					"1013" : {
						UNLOCK : true,		// 关卡是否要求解锁
						COMPLETE : false ,// 关卡是否要求完成
					},
				},			
			],																	
		},
	},	

	"2042_0" : {//美食家1
		TYPE : "102",
		TEXT : '我一直认为苏格兰不属于大不列颠, 当年长腿打赢华莱士不过是运气, 不过华莱士还是埋下了种子. 唉, 有点想回苏格兰了呢. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2043_0" : {//美食家2
		TYPE : "102",
		TEXT : '有多久没有这样一个人看看这片天空了呢？一年？还是十年？自从工作以来, 越来越忙的工作压得人喘不过气, 也许这次的经历是上天赐予的礼物也说不定. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2044_0" : {//美食家3
		TYPE : "102",
		TEXT : '无论这次经历摧毁了多少至今积累起来的自信, 都得迎接明天餐厅开张的大门, 这就是厨师, 一个料理人该有的姿态. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2045_0" : {//美食家4
		TYPE : "102",
		TEXT : '我虽然不知道在这里何时会死去, 要怎么活是个人的自由, 重要的就在于此, 就算不能安详的死去, 至少我现在还可以开怀大笑的活下去. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2046_0" : {//美食家5
		TYPE : "102",
		TEXT : '即使被困荒野, 被绝望击垮, 也不能忘记：有光的地方的就会有影子, 有影子的地方也必然有光. 绝望的颜色越浓, 那里一定会有光芒耀眼的希望. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2047_0" : {//美食家6
		TYPE : "102",
		TEXT : '脚下的鞋子还是庆祝餐厅营业十周年买的, 之前没怎么爬山, 也没怎么过河, 总觉得它过的挺不开心的. 现在已经破的不成样, 可能明天就穿不了了, 可是它还裂开的大嘴, 笑得很开心. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2048_0" : {//美食家7
		TYPE : "102",
		TEXT : '有时我为了创作一道新的菜品, 要忍受着好像要把宇宙从肛门里挤出来的痛苦, 而我现在在这里——这片荒野之上, 我的灵感就像打开了的水龙头, 不, 是坏掉的水龙头——根本关不上！',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2049_0" : {//美食家8
		TYPE : "102",
		TEXT : '我坐在自己搭建的床上, 在黎明前最黑暗的时间睁大了双眼. 千万不能闭眼, 在黑暗中移开视线的家伙是看不到明天的光明的, 不论前方等待我的夜有多深. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2050_0" : {//美食家9
		TYPE : "102",
		TEXT : '你以为被困荒野已经很痛苦了, 其实明天会有更多痛苦的事情等着你, 这么想的话, 那今天过得还不赖. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2051_0" : {//美食家10
		TYPE : "102",
		TEXT : '人生若跌倒了谷底, 就像现在这样, 剩下的就只有往上爬了. 希望明天不会跌的更狠. ',
		COND : {	
			"1000" : 1000,											
		},
	},

	"2042_1" : {//冶金师1
		TYPE : "102",
		TEXT : '记得哥哥说过：所谓眼泪啊, 是流出来就能把辛酸和悲伤都冲走的好东西. 可是哥哥, 总有眼泪也冲刷不干净的巨大悲伤. ',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2043_1" : {//冶金师2
		TYPE : "102",
		TEXT : '再过几天就是母亲的忌日了. 有时候, 我们明明原谅了那个人, 却无法真正快乐起来. 也许是因为, 忘了原谅自己. ',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2044_1" : {//冶金师3
		TYPE : "102",
		TEXT : '记得叔叔总是说他秃头是因为压力太大了, 但是刻意的避免压力又会造成压力, 到头来还是无能为力吧. ',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2045_1" : {//冶金师4
		TYPE : "102",
		TEXT : '我总觉得有什么东西压在我的身上, 也许是爵位, 也许是家族. 别人都认为我是冰山美人, 却不知道我是因为没有信任的人. 真是悲哀',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2046_1" : {//冶金师5
		TYPE : "102",
		TEXT : '我说过, 我会成为坎贝尔家族的主人, 我不会就这样死在这里. 我说的也许是大话, 但是, 能实现大话的人就是英杰！',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2047_1" : {//冶金师6
		TYPE : "102",
		TEXT : '秉持信念正直的维持家族虽然没有错, 不过因此而陷入困境的话, 倒不如试着圆滑一下. 这么走下去, 一定会发现自己绝对不能放弃的人生真谛, 不是吗？',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2048_1" : {//冶金师7
		TYPE : "102",
		TEXT : '与其想着怎么漂亮的死去, 倒不如想着怎么漂亮活到最后一刻. 即使濒死, 我也要想办法原地复活！',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2049_1" : {//冶金师8
		TYPE : "102",
		TEXT : '我现在终于明白了“有的人活着, 他却已经死了”这句话的意义. ',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2050_1" : {//冶金师9
		TYPE : "102",
		TEXT : '我现在必须承认生命中大部分时光是属于孤独的, 因为孤独时的时光总是过的更慢, 努力成长是在孤独里可以进行的最好的游戏. ',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2051_1" : {//冶金师10
		TYPE : "102",
		TEXT : '我想起从前在学校攒了很多的巧克力都不见了, 偷吃的家伙到现在都没找到, 如果是现在的话, 我把他弄个四分之三死就饶了他. ',
		COND : {	
			"1000" : 1001,											
		},
	},

	"2042_2" : {//探险家1
		TYPE : "102",
		TEXT : '酒真是好东西, 能让人忘了不快的事情, 可一到第二天, 就算不喜欢也还是会想起, 而且比昨天更痛苦. 特别是, 那些真的很想忘掉的事情；特别是, 我的酒量还很好. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2043_2" : {//探险家2
		TYPE : "102",
		TEXT : '我相信维多利亚现在还在等待着我, 正如我相信她仍相信我还活着. 娶了她, 我不枉此生. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2044_2" : {//探险家3
		TYPE : "102",
		TEXT : '作为军人, 守护着大英承载着太多的痛苦. 但是啊, 放弃也很痛苦, 已经无法回来的东西, 拥有和舍弃都很痛苦, 既然不论如何都会痛苦的话, 我宁可选择守护她而痛苦！',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2045_2" : {//探险家4
		TYPE : "102",
		TEXT : '我最大的缺点就是人太好, 谁都愿意相信, 就算被出卖, 被弄到这步田地. 我承认自己命运的齿轮长满了锈迹, 转动之时, 已经为时过晚. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2046_2" : {//探险家5
		TYPE : "102",
		TEXT : '真正的军人, 不是为了信念而光荣赴死, 而是为了信念而坚强的活着. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2047_2" : {//探险家6
		TYPE : "102",
		TEXT : '不要输给风, 不要输给雨, 也不要输给荒野, 不管什么时候都坚强自身, 我是为了成为这样的人才成为一个军人的. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2048_2" : {//探险家7
		TYPE : "102",
		TEXT : '维多利亚嫁给我也许是个错误, 所谓结婚, 就是把错误延续一生. 对不起, 维多利亚, 也许我再也见不到你了. 但是, 我爱你. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2049_2" : {//探险家8
		TYPE : "102",
		TEXT : '越是弯下腰山顶就会越变得越远. 山顶并不是为了让人知道自己的渺小而耸立的, 而是为了成为目标才存在的, 有时间在山道弯下腰的话, 不如登上去, 即使也很慢也无妨. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2050_2" : {//探险家9
		TYPE : "102",
		TEXT : '我想起刚入伍的那天教官对我们说：今后你们只有两条路可以走, 要么就是默默地被世界淘汰, 要么就是适应世界的改变自己. ',
		COND : {	
			"1000" : 1002,											
		},
	},

	"2051_2" : {//探险家10
		TYPE : "102",
		TEXT : '不知不觉已经习惯了这样的生活, 不过男人有些地方长毛之后就要懂得自力更生了. ',
		COND : {	
			"1000" : 1002,											
		},
	},


	"2042_3" : {//探险家1
		TYPE : "103",
		TEXT : '每次这样躺在地上看着天空, 都觉得内心无比的空净, 这个社会太急躁了, 我希望我的视频能以一股清流来给大家一些惬意, 仅此而已. ',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2043_3" : {//探险家2
		TYPE : "103",
		TEXT : '这次回去真的是失踪人口回归了, 消失了这么多天, 不知道有没有涨粉, 会不会又有新的野食小哥出现呢？',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2044_3" : {//探险家3
		TYPE : "103",
		TEXT : '不被时间和社会所束缚, 幸福的填饱肚子的时候, 短时间内变得随心所欲, 变得自由, 不被任何人打扰. 毫不费神的吃东西这种孤高的行为, 这种行为正是平等地赋予现代人的, 最高程度的治愈！',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2045_3" : {//探险家4
		TYPE : "103",
		TEXT : '我总是一个人沉默的做饭, 一个人吃的心满意足, 不知道是习惯了一个人还是习惯了一个人. ',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2046_3" : {//探险家5
		TYPE : "103",
		TEXT : '天呐！！我要可乐！！可乐！！！可乐！！！可乐！！可乐！！！可乐！！！可乐！！可乐！！！可乐！！！',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2047_3" : {//探险家6
		TYPE : "103",
		TEXT : '哎, 地主家的儿子这么长时间不在, 也不知道地主家的那些长工们有没有视频看了. ',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2048_3" : {//探险家7
		TYPE : "103",
		TEXT : '仔细想想, 我来这之前似乎听到了一些不寻常的声音, 然后就晕了过去, 如果我想回去, 恐怕得从这里面下功夫. ',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2049_3" : {//探险家8
		TYPE : "103",
		TEXT : '我现在终于明白了“有的人活着, 他却已经死了”这句话的意义. ',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2050_3" : {//探险家9
		TYPE : "103",
		TEXT : '我现在必须承认生命中大部分时光是属于孤独的, 因为孤独时的时光总是过的更慢, 努力成长是在孤独里可以进行的最好的游戏. ',
		COND : {	
			"1000" : 1003,											
		},
	},

	"2051_3" : {//探险家10
		TYPE : "103",
		TEXT : '野食小哥这是要进化成荒野大叔了么, 鲁滨逊没记错可是活了28年. ',
		COND : {	
			"1000" : 1003,											
		},
	},




	"1001_0" : {//美食家心情好生命好
		TYPE : "101",
		TEXT : '在一个荒岛上保持一份好的心情和身体状况是很难的, 不过我现在的状态好像不赖. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:300,
						MAX:450,
				},		
			},														
		},			
	},

	"1001_1" : {//冶金师心情好生命好
		TYPE : "101",
		TEXT : '在一个荒岛上保持一份好的心情和身体状况是很难的, 不过我现在的状态好像不赖. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:300,
						MAX:450,
				},		
			},														
		},			
	},

	"1001_2" : {//探险家心情好生命好
		TYPE : "101",
		TEXT : '在一个荒岛上保持一份好的心情和身体状况是很难的, 不过我现在的状态好像不赖. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:300,
						MAX:450,
				},		
			},														
		},			
	},


	"1002_0" : {//美食家心情好生命差
		TYPE : "101",
		TEXT : '身体状况不是很好, 不过没关系, 师父告诉过我一个好的厨师要时刻保证好的心情. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:1,
						MAX:50,
				},		
			},														
		},			
	},

	"1002_1" : {//冶金师心情好生命差
		TYPE : "101",
		TEXT : '身体状况不是很好, 不过没关系, 哥哥说过好的心情可以帮助身体更快速的恢复. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:1,
						MAX:50,
				},		
			},														
		},			
	},

	"1002_2" : {//探险家心情好生命差
		TYPE : "101",
		TEXT : '身体状况较差, 好的心情可以帮助身体恢复. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:1,
						MAX:50,
				},		
			},														
		},			
	},

	"1002_3" : {//探险家心情好生命差
		TYPE : "101",
		TEXT : '身体状况不是很好, 不过没关系, 一个好的博主要时刻保持好的心情. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:1,
						MAX:50,
				},		
			},														
		},			
	},	

	"1003_0" : {//美食家心情好精神好
		TYPE : "101",
		TEXT : '喔, 我觉得我可能有点亢奋, 甚至还想来场篝火宴会！还记得那场在维也纳的狂欢嘛, 赛利亚的身材可真棒！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1003_1" : {//冶金师心情好精神好
		TYPE : "101",
		TEXT : '喔, 我觉得我可能有点亢奋, 甚至还想去游个泳. 还记得在地中海的那次比赛, 我还拿了个冠军！',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1003_2" : {//探险家心情好精神好
		TYPE : "101",
		TEXT : '夜空, 美好. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1003_3" : {//探险家心情好精神好
		TYPE : "101",
		TEXT : '喔, 我觉得我可能有点亢奋, 甚至还想来瓶啤酒！记得那只叫花鸡么！记得那个小小的坟墓么！好吧, 这个时候提坟墓可能不太吉利. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},	

	"1004_0" : {//美食家心情好精神差
		TYPE : "101",
		TEXT : '我有点过于兴奋了, 搞的我现在非常累, 看来要好好补充一下睡眠了. 希望醒来的时候有我最爱的蜂蜜章鱼烧. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1004_1" : {//冶金师心情好精神差
		TYPE : "101",
		TEXT : '我有点过于兴奋了, 搞的我现在非常累, 看来要好好补充一下睡眠了. 我有些想念我的袖珍版燧发枪. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1004_2" : {//探险家心情好精神差
		TYPE : "101",
		TEXT : '心情亢奋, 身体疲惫. 这不是一个军人该有的状态, 需要补充睡眠. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1004_3" : {//探险家心情好精神差
		TYPE : "101",
		TEXT : '我有点过于兴奋了, 搞的我现在非常累, 看来要好好补充一下睡眠了. 我有些想念爆衣的感觉了. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1005_0" : {//美食家心情好外伤好
		TYPE : "101",
		TEXT : '今天没受什么外伤, 真是上帝保佑, 还有什么能比这个更值得开心的呢！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1005_1" : {//冶金师心情好外伤好
		TYPE : "101",
		TEXT : '今天没受什么外伤, 真是上帝保佑, 还有什么能比这个更值得开心的呢！',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1005_2" : {//探险家心情好外伤好
		TYPE : "101",
		TEXT : '今天没受什么外伤, 真是上帝保佑, 还有什么能比这个更值得开心的呢！',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1006_0" : {//美食家心情好外伤差
		TYPE : "101",
		TEXT : '看看这伤口, 跟去年那只叫多里的羊下了一刀后的伤口差不多. 啧啧, 多里是只好羊, 我是说味道上. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1006_1" : {//冶金师心情好外伤差
		TYPE : "101",
		TEXT : '看看这伤口, 可惜这没针线, 不然我觉得我的刺绣技能就用派上用场了. 吉卜赛风格和苏格兰格子哪个更适合呢？',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1006_2" : {//探险家心情好外伤差
		TYPE : "101",
		TEXT : '伤口偏多, 左侧腹部最为严重, 裂口超3英寸. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1006_3" : {//探险家心情好外伤差
		TYPE : "101",
		TEXT : '看看这伤口, 还好我血多, 不然恐怕得交代在这里了. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1007_0" : {//美食家心情好内伤好
		TYPE : "101",
		TEXT : '嗯哼, 不干不净, 吃了没病. 没有伤口发炎, 看来经历了那么多年黑暗料理, 让我多少产生了些抗性. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1007_1" : {//冶金师心情好内伤好
		TYPE : "101",
		TEXT : '今天状态不错, 没有发炎的伤口, 也没有什么流脓. 那可太不符合一个女伯爵的身份了. 唔, 说到这个, 我得去洗个澡. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1007_2" : {//探险家心情好内伤好
		TYPE : "101",
		TEXT : '这样的生活倒是有些像野战训练, 身体内部也没有感觉不适, 让我来好好的完成这次训练. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1007_3" : {//探险家心情好内伤好
		TYPE : "101",
		TEXT : '今天状态不错, 没有发炎的伤口, 也没有什么流脓. 长时间的野食也算是活到现在的根本吧. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},	

	"1008_0" : {//美食家心情好内伤差
		TYPE : "101",
		TEXT : '喔喔！这发炎的样子好像碳烤了一样, 倒是让人食欲大增啊, 来吧, 来顿好吃的犒劳一下自己！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1008_1" : {//冶金师心情好内伤差
		TYPE : "101",
		TEXT : '伤口有些感染, 这样的面积可不太乐观, 也许我该找些火药来消消毒. 可千万别留疤, 下次家族会议还得露背呢. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1008_2" : {//探险家心情好内伤差
		TYPE : "101",
		TEXT : '伤口开始感染, 面积偏大, 需要些酒精来消毒. 顺便来一口解解馋. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1008_3" : {//探险家心情好内伤差
		TYPE : "101",
		TEXT : '喔喔！这发炎的样子好像碳烤了一样, 倒是让人食欲大增啊, 来吧, 来顿好吃的犒劳一下自己！',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7005" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1009_0" : {//美食家心情好饥饿好
		TYPE : "101",
		TEXT : '吃饱喝足, perfect！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1009_1" : {//冶金师心情好饥饿好
		TYPE : "101",
		TEXT : '吃饱喝足, perfect！',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1009_2" : {//探险家心情好饥饿好
		TYPE : "101",
		TEXT : '吃饱喝足, perfect！',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:80,
						MAX:100,
				},		
			},														
		},			
	},

	"1010_0" : {//美食家心情好饥饿差
		TYPE : "101",
		TEXT : '中国有句古话说, 久旱逢甘露, 多饿几顿, 再吃东西一定会变得更美味！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1010_1" : {//冶金师心情好饥饿差
		TYPE : "101",
		TEXT : '少吃几顿没关系, 就当减肥了, 免得吉安娜和奥菲利亚一直说我胖. 再说了, 我哪里胖了. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1010_2" : {//探险家心情好饥饿差
		TYPE : "101",
		TEXT : '英军不怕远征难, 一顿不吃饿得慌. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1010_3" : {//探险家心情好饥饿差
		TYPE : "101",
		TEXT : '少吃几顿没关系, 就当减肥了, 野食小哥要变成野食帅哥了！',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7006" : {
						MIN:0,
						MAX:20,
				},		
			},														
		},			
	},

	"1011_0" : {//美食家心情好天气晴朗
		TYPE : "101",
		TEXT : '真是一个好天气, 荒岛什么的见鬼去吧！哈哈！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1005" : 1,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5																
		},			
	},

	"1011_1" : {//冶金师心情好天气晴朗
		TYPE : "101",
		TEXT : '真是一个好天气, 荒岛什么的见鬼去吧！哈哈！',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 1,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5														
		},			
	},

	"1011_2" : {//探险家心情好天气晴朗
		TYPE : "101",
		TEXT : '真是一个好天气, 荒岛什么的见鬼去吧！哈哈！',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 1,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5														
		},			
	},

	"1012_0" : {//心情好天气大雨
		TYPE : "101",
		TEXT : '或许我可以在这种天气里洗个澡, 算了还是明天去河边吧, 万一艳遇一条美人鱼呢. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:1,
				MAX:40,
			},	//温度															
		},			
	},

	"1012_1" : {//心情好天气大雨
		TYPE : "101",
		TEXT : '或许我可以在这种天气里洗个澡, 算了还是明天去河边吧, 漂亮的姑娘总能在河边遇到她的白马王子. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:1,
				MAX:40,
			},	//温度													
		},			
	},

	"1012_2" : {//心情好天气大雨
		TYPE : "101",
		TEXT : '天气大雨, 可获取大量淡水资源, 或许. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:1,
				MAX:40,
			},	//温度													
		},			
	},

	"1012_3" : {//心情好天气大雨
		TYPE : "101",
		TEXT : '或许我可以在这种天气里洗个澡, 算了还是明天去河边吧, 万一艳遇一条美人鱼呢. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:1,
				MAX:40,
			},	//温度													
		},			
	},

	"1013_0" : {//心情好天气大雪
		TYPE : "101",
		TEXT : '我觉得我能用这大雪做一堆刨冰, 淋上草莓酱, 那味道一定很棒！',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:-40,
				MAX:0,
			},	//温度															
		},			
	},

	"1013_1" : {//心情好天气大雪
		TYPE : "101",
		TEXT : '可以试试用雪来淬火, 记得以前用雪淬出来的比较软, 或许这次能淬把好材料. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:-40,
				MAX:0,
			},	//温度													
		},			
	},

	"1013_2" : {//心情好天气大雪
		TYPE : "101",
		TEXT : '天气大雪, 回忆起那次战役, 也是大雪如此. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:-40,
				MAX:0,
			},	//温度													
		},			
	},

	"1013_3" : {//心情好天气大雪
		TYPE : "101",
		TEXT : '我觉得我能用这大雪做一堆刨冰, 淋上草莓酱, 那味道一定很棒！',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:-40,
				MAX:0,
			},	//温度													
		},			
	},


	"1014_0" : {//心情好天气阴天
		TYPE : "101",
		TEXT : '这天气都不用考虑防晒了, 不错不错. 趁着天阴得多去找些东西. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1005" : 2,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5															
		},			
	},

	"1014_1" : {//心情好天气阴天
		TYPE : "101",
		TEXT : '这天气都不用考虑防晒了, 不错不错. 趁着天阴得多去找些东西. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 2,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5														
		},			
	},

	"1014_2" : {//心情好天气阴天
		TYPE : "101",
		TEXT : '这天气都不用考虑防晒了, 不错不错. 趁着天阴得多去找些东西. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},
			"1005" : 2,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5													
		},			
	},

	"1015" : {//心情好气温好
		TYPE : "101",
		TEXT : '气温刚好, 没想到这个荒岛上的气温还挺不错的, 回去后可以考虑来这开发个度假区. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1006" : {
				MIN:10,
				MAX:30,
			},	//温度																
		},			
	},

	"1016_0" : {//心情好气温热
		TYPE : "101",
		TEXT : '我都快变成烤全人了, 得去外面看看, 说不定真能捡到只中暑的野猪. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1006" : {
				MIN:35,
				MAX:50,
			},	//温度																
		},			
	},

	"1016_1" : {//心情好气温热
		TYPE : "101",
		TEXT : '这么热的天气我得去水里呆着, 享受享受大自然的水床. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
			"1006" : {
				MIN:35,
				MAX:50,
			},	//温度		
			},																	
		},			
	},

	"1016_2" : {//心情好气温热
		TYPE : "101",
		TEXT : '天气炎热, 任务暂缓, 休息一天, 调节心情. ',
		COND : {	
			"1000" : 1002,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},		
			},	
			"1006" : {
				MIN:35,
				MAX:50,
			},	//温度															
		},			
	},

	"1016_3" : {//心情好气温热
		TYPE : "101",
		TEXT : '我都快变成烤全人了, 得去外面看看, 说不定真能捡到只中暑的野猪. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1006" : {
				MIN:35,
				MAX:50,
			},	//温度																
		},			
	},	

	"1017" : {//心情好气温冷
		TYPE : "101",
		TEXT : '这天气可够冷的, 生个火, 少运动, 减少热量散发. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},			
			},	
			"1006" : {
				MIN:-30,
				MAX:0,
			},	//温度																
		},			
	},

	"1020" : {//心情差生命好
		TYPE : "101",
		TEXT : '总觉得有些压抑的情绪, 也许我该来杯咖啡改善改善心情. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:300,
						MAX:450,
				},							
			},																
		},			
	},

	"1021" : {//心情差生命差
		TYPE : "101",
		TEXT : '我觉得我快死了, 我要离开这个鬼地方！立刻, 马上！',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7003" : {
						MIN:1,
						MAX:30,
				},							
			},																
		},			
	},

	"1022" : {//心情差精神好
		TYPE : "101",
		TEXT : '我要疯了, 这样的日子什么时候才能到头啊！',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},							
			},																
		},			
	},

	"1023" : {//心情差精神差
		TYPE : "101",
		TEXT : '脑子一片乱, 该死, 我觉得很不舒服. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},							
			},																
		},			
	},

	"1024" : {//心情差外伤好
		TYPE : "101",
		TEXT : '我有点想家了. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:0,
						MAX:20,
				},	
				"7004" : {
						MIN:80,
						MAX:100,
				},							
			},																
		},			
	},

	"1025_0" : {//心情差外伤差
		TYPE : "101",
		TEXT : '该死, 这伤口可不大妙, 我们以前杀牛放血的伤口跟这个差不多. 我怕是也要死了吧',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1025_1" : {//心情差外伤差
		TYPE : "101",
		TEXT : '该死, 这伤口可不大妙, 要是死在这, 我怎么去见天堂的父亲啊. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1025_2" : {//心情差外伤差
		TYPE : "101",
		TEXT : '伤口偏大, 如果再不采取一些措施, 恐怕凶多吉少. ',
		COND : {	
			"1000" : 1002,																	
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1025_3" : {//心情差外伤差
		TYPE : "101",
		TEXT : '该死, 这伤口可不大妙, 血再多也经不住这么流啊, 我可不想死在这. ',
		COND : {	
			"1000" : 1003,																	
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7004" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1026" : {//心情差内伤好
		TYPE : "101",
		TEXT : '我得想个办法解解闷. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7005" : {
						MIN:80,
						MAX:100,
				},							
			},																
		},			
	},

	"1027" : {//心情差内伤差
		TYPE : "101",
		TEXT : '伤口开始化脓了, 看来我快死了. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7005" : {
						MIN:0,
						MAX:20,
				},							
			},																
		},			
	},

	"1028" : {//心情差饥饿好
		TYPE : "101",
		TEXT : '肚子不空, 内心空虚. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7006" : {
						MIN:100,
						MAX:80,
				},							
			},																
		},			
	},

	"1029" : {//心情差饥饿差
		TYPE : "101",
		TEXT : '内心空虚, 肚子空洞. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},	
				"7006" : {
						MIN:0,
						MAX:20,
				},							
			},																
		},			
	},

	"1030" : {//心情差天气晴朗
		TYPE : "101",
		TEXT : '白天的太阳真刺眼. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},		
			},
			"1005" : 1,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5															
		},			
	},

	"1031" : {//心情差天气大雨
		TYPE : "101",
		TEXT : '这该死的雨可下了挺长时间的. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},			
			},	
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:1,
				MAX:40,
			},	//温度															
		},			
	},

	"1032" : {//心情差天气大雪
		TYPE : "101",
		TEXT : '今天居然下雪了, 是想冻死我么？',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},			
			},	
			"1005" : 5,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5	
			"1006" : {
				MIN:-40,
				MAX:0,
			},	//温度															
		},			
	},

	"1033" : {//心情差天气阴天
		TYPE : "101",
		TEXT : '一天都没好脾气, 肯定是跟这破天气有关. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},			
			},	
			"1005" : 2,	//天气 晴1 多云2 雾3 雨雪4 暴风雨雪5															
		},			
	},

	"1034" : {//心情差气温好
		TYPE : "101",
		TEXT : '总觉得今天这天气, 我被老天嘲笑了. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},			
			},	
			"1006" : {
				MIN:10,
				MAX:30,
			},	//温度																
		},			
	},

	"1035" : {//心情差气温热
		TYPE : "101",
		TEXT : '热死了热死了热死了热死了热死了热死了热死了热死了热死了. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},			
			},	
			"1006" : {
				MIN:35,
				MAX:50,
			},	//温度																
		},			
	},

	"1036" : {//心情差气温冷
		TYPE : "101",
		TEXT : '我的手都冻得写不出字了. ',
		COND : {							
 			"1009" : {//角色状态			
				"7001" : {
						MIN:80,
						MAX:100,
				},			
			},	
			"1006" : {
				MIN:-40,
				MAX:0,
			},	//温度																
		},			
	},


	"1039_0" : {//生命好精神好
		TYPE : "101",
		TEXT : '今天的状态不错, 有些让我想起之前参加料理比赛, 那时候也是晚上亢奋的睡不着. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},																
		},			
	},

	"1039_1" : {//生命好精神好
		TYPE : "101",
		TEXT : '今天的状态不错, 就像当年我的刺绣被展出一样. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},																
		},			
	},

	"1039_2" : {//生命好精神好
		TYPE : "101",
		TEXT : '状态良好, 也许能趁着这个时候让自己的精神稍微放松一下. ',
		COND : {	
			"1000" : 1002,																	
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},																
		},			
	},

	"1039_3" : {//生命好精神好
		TYPE : "101",
		TEXT : '今天的状态不错, 有些让我想起每次发片前, 那时候也是晚上亢奋的睡不着. ',
		COND : {	
			"1000" : 1003,																	
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:80,
						MAX:100,
				},		
			},																
		},			
	},	

	"1040_0" : {//生命好精神差
		TYPE : "101",
		TEXT : '喔, 我觉得我像做了几千个人的午餐, 床在哪, 我得快点去睡觉了. ',
		COND : {	
			"1000" : 1000,							
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1040_1" : {//生命好精神差
		TYPE : "101",
		TEXT : '我, 我觉得我就像跟叔叔打完官司一样累, 我得找个地方多躺一会. ',
		COND : {	
			"1000" : 1001,							
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1040_2" : {//生命好精神差
		TYPE : "101",
		TEXT : '精神疲惫, 身体表明需要充足的休息. ',
		COND : {	
			"1000" : 1002,																	
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1040_3" : {//生命好精神差
		TYPE : "101",
		TEXT : '喔, 我觉得我像连续做了十期视频, 床在哪, 我得快点去睡觉了. ',
		COND : {	
			"1000" : 1003,							
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7000" : {
						MIN:0,
						MAX:20,
				},		
			},																
		},			
	},

	"1041" : {//生命好外伤好
		TYPE : "101",
		TEXT : '也许我该做些什么来消耗一下我现在良好的状态. ',
		COND : {	
			"1000" : 1002,																	
 			"1009" : {//角色状态			
				"7003" : {
						MIN:300,
						MAX:450,
				},	
				"7004" : {
						MIN:80,
						MAX:100,
				},		
			},																
		},			
	},



















  


  




	"1101" : {//晴天
		TYPE : "101",
		TEXT : '今天阳光意外地很明媚, 给我了一些活下去的希望',
		COND : {								
 			"1005" : 1,														
		},
		ATTRS : {   //剧情产生的属性效果
		"7001" : -5,
			},			
	},

	"1102" : {//多云
		TYPE : "101",
		TEXT : '太阳一直躲在云朵的后面, 不过还好是秋天, 并不会因为阴天感到冷',
		COND : {								
 			"1005" : 2,		
 			"1007" : 3,													
		},
	},

	"1103" : {//多云
		TYPE : "101",
		TEXT : '太阳一直躲在云朵的后面, 不过还好是春天, 并不会因为阴天感到冷',
		COND : {								
 			"1005" : 2,		
 			"1007" : 1,													
		},
	},

	"1104" : {//多云
		TYPE : "101",
		TEXT : '太阳一直躲在云朵的后面, 不过还好是夏天, 让我感到更加凉爽了',
		COND : {								
 			"1005" : 2,		
 			"1007" : 2,													
		},
	},

	"1105" : {//多云
		TYPE : "101",
		TEXT : '在这寒冷的冬天, 太阳还一直不出来, 真是冻死人了',
		COND : {								
 			"1005" : 2,		
 			"1007" : 4,													
		},
	},


	"1106" : {//雾
		TYPE : "101",
		TEXT : '今天外面一片片都是雾茫茫的, 都不怎么敢出门',
		COND : {								
 			"1005" : 3,														
		},
	},




	// "0" : {//1000类型测试
	// 	TYPE : "102",
	// 	TEXT : '0角色类型测试：美食家触发',
	// 	COND : {								
 // 			"1000" : 1000,													
	// 	},
	// },

	// "1" : {//1001类型测试
	// 	TYPE : "102",
	// 	TEXT : '1剧情点类型测试：探险家触发',
	// 	COND : {								
	// 		"1001" : [			// 1001说明是剧情点是否触发为条件, {}外面为且
	// 			{							//{}里面为或
	// 				"e2" : 1, 	//0为未发生, 1为发生					  
	// 			},			
	// 		],												
	// 	},
	// },

	// "2" : {//1002类型测试
	// 	TYPE : "102",
	// 	TEXT : '2天数类型测试, 大于5天触发',
	// 	COND : {								
 // 			"1002" : 5,													
	// 	},
	// },

	// "3" : {//1003类型测试
	// 	TYPE : "102",
	// 	TEXT : '3关卡类型测试, 竹林通关解锁',
	// 	COND : {								
	// 		"1003" : [			// 条件类型: 关卡解锁/完成
	// 			{
	// 				"3" : {
	// 					UNLOCK : true,		// 关卡是否要求解锁
	// 					COMPLETE : true ,// 关卡是否要求完成
	// 				},
	// 			},			
	// 		],												
	// 	},
	// },

	// "4" : {//1004类型测试
	// 	TYPE : "102",
	// 	TEXT : '4道具获取类型测试, 5块生肉触发',
	// 	COND : {								
	// 		"1004" : {	
	// 		   "4020" :5,
	// 		},												
	// 	},
	// },

	// "5" : {//1005类型测试
	// 	TYPE : "102",
	// 	TEXT : '5天气类型测试, 晴天时触发',
	// 	COND : {								
 // 			"1005" : 1,												
	// 	},
	// },

	// "6" : {//1006类型测试
	// 	TYPE : "102",
	// 	TEXT : '6温度类型测试, 10-20时触发',
	// 	COND : {								
 // 			"1006" : {
	// 			MIN:10,
	// 			MAX:20,
	// 		},												
	// 	},
	// },

	// "7" : {//1007类型测试
	// 	TYPE : "102",
	// 	TEXT : '7季节类型测试, 秋天时触发',
	// 	COND : {								
 // 			"1007" : 3,												
	// 	},
	// },

	// "8" : {//1008类型测试
	// 	TYPE : "102",
	// 	TEXT : '8宠物类型测试, 拥有白狼时触发',
	// 	COND : {								
 // 			"1008" : 1,												
	// 	},
	// },

	// "9" : {//1009类型测试
	// 	TYPE : "102",
	// 	TEXT : '9状态类型测试, 精神0-20时触发',
	// 	COND : {								
 // 			"1009" : {//角色状态
			
	// 				"7000" : {
	// 						MIN:0,
	// 						MAX:20,
	// 				},		
	// 		},											
	// 	},
	// },

	// "10" : {//1010类型测试
	// 	TYPE : "102",
	// 	TEXT : '10建筑类型测试, 工作台2级时触发',
	// 	COND : {								
	// 		"1010" : {//建筑等级		
	// 				"3000" : 2,		
	// 		},											
	// 	},
	// },

	// "11" : {//1011类型测试
	// 	TYPE : "102",
	// 	TEXT : '11好感度类型测试, 母狼和骆驼0时触发时触发',
	// 	COND : {								
 // 			"1011" : {//NPC好感度			
 // 					"2001" : 0,
	// 				"2002" : 0, 			
	// 		},	
	// 	},											
	// },

	// "12" : {//1012类型测试
	// 	TYPE : "102",
	// 	TEXT : '12资源数量测试, 竹林野猪5只时触发',
	// 	COND : {			
	// 	"1012" : {//资源点资源数量
			
	// 				"1003" : {
	// 				 		"1" : 5,
	// 				 		},

	// 		},											
	// 	},
	// },

	// "13" : {//1013类型测试
	// 	TYPE : "102",
	// 	TEXT : '13骆驼类型测试, 拥有白狼时触发',
	// 	COND : {								
 // 			"1013" : true,												
	// 	},
	// },








	// "998" : {
	// 	TYPE : "102",
	// 	TEXT : '测试测试',
	// 	COND : {								
 // 			"1000" : 1002,	//1001													
	// 	},
	// },

	// "999" : {
	// 	TYPE : "102",
	// 	TEXT : '测试测试',
	// 	COND : {								
 // 			"1000" : 1002,	//1001													
	// 	},
	// },
};