// 
exports.getById = function(pid){
   return dy.utils.clone(HY_PETS[pid.toString()]);
};

var HY_PETS = {
	// 白狼
	"1" : {
		ID : "1",
		NAME : "白狼",
		7002	:	246	,	//	最大生命
		7003	:	246	,	//	生命
		7006	:	100	,	//	饥饿度
		7048	:	100	,	//	最大饥饿度
		7058	:	30  ,	//  临界饥饿度
		7012	:	2	,	//	防御力
		7013	:	30	,	//	攻击力
		7016	:	100	,	//	近战命中率90%
		7018	:	20	,	//	闪避率20%
		7019	:	1	,	//	攻击速度
		7028	:	100	,	//	宠物忠诚度
		7049	:	100	,	//	最大宠物忠诚度
		7057	:   1	,	//	攻击距离
        BITE_DESC : ["挥爪", "咬了一口"],
        MISS_DESC : ["你的白狼向后一跃，躲开了这次攻击", "你的白狼识破了它的预谋，提前闪开了"],
        DEATH_DESC : [",白狼精疲力竭，倒下了"],
        DESC : "",
	},
};