// unlock
// DUNGEON : "1",//副本是否通关 {TYPE : "2", VALUE : 1}
// DAYS    : "2",//存活天数超过
// NPC     : "3",//NPC好感度
// STORY   : "4",//指定剧情点是否完成  {TYPE : "4", VALUE : "a1;b1"}  
exports.getById = function(pid){
   return HY_POTS[pid.toString()];
};

exports.getPots = function(){
    return HY_POTS;
};

var HY_POTS = {
     "0":{
        ID : "0",
        NAME : "家", 
        DESC : "简单朴实，却是你活下去的唯一庇护",
        TYPE : "100",
    },



    "1":{
        ID : "1",
        NAME : "乱石林", 
        TYPE : "101",
        ISCHECK : 0,//是否为存档点，0表示不是，1表示是存档点
        DESC : "由乱石构成的一片区域，遍布的是各种乱石，形状各异，应该能找出合适用来制作或者建造的石块。",
        R_STAGE : [
            // {
            //     NAME : "枯树",
            //     PIC : "Texture/Monster/1202_1",
            //     OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
            //     DROP_ID : 103,
            //     DESC : "一棵树孤独的立在那里，枯萎而倔强",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了木材",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "树皮遗言",
            //         TIP : "你在采集木材时，发现树皮上刻着什么东西。",
            //     },
            // },
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 102,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                // LAST_WORDS : {
                //     TITLE : "石块遗言",
                //     TIP : "当你在挑选合适的石块时候，你发现其中一块石头上刻着什么东西。",
                // },
            },
        ],
        M_STAGE : [
            // {   //强度测试关卡
            //     NAME : "强度测试",
            //     PIC : "Texture/Monster/1002",
            //     MONSTER : [1008,1008],
            //     DANGER : "低",
            //     DROP_ID : 101,
            //     DESC : "一只狼出现在你的面前",//关卡进入描述
            //     DESC1 : "",//关卡战斗中描述
            //     DESC2 : "你成功击败了狼",//关卡战斗结束描述
            // },        
            {
                NAME : "幼狼",
                PIC : "Texture/Monster/1002",
                MONSTER : [1001],
                DANGER : "1",
                DROP_ID : 101,
                DESC : "一只幼狼出现在你的面前，并向你摆出了战斗的姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了幼狼",//关卡战斗结束描述
                // LAST_WORDS : {
                //     TITLE : "石片遗言",
                //     TIP : "当你击败幼狼的时候，发现了破损的石片，上面似乎写着什么。",
                // },
            },
        ],
        // SECRET : {
        //     "IDS" : [101],
        //     "RATE" : 0,
        //     "LIMIT" : 1,
        // },
        UNLOCK :  [{TYPE : "2", VALUE : 1}], 
    },

    "2":{
        ID : "2",
        NAME : "灌木丛", 
        TYPE : "101",
        ISCHECK : 0,//是否为存档点，0表示不是，1表示是存档点
        DESC : "离家最近的灌木丛就是这里了，生长着种类繁多的灌木乔木和草本植物，也许可以从这里找到一些药草。从这还能听到远处有一些水声。",
        R_STAGE : [
            {
                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 202,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片遗言",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "野薄荷",
                PIC : "Texture/Monster/1215",
                OPEN_WAYS : ["0"],
                DROP_ID : 205,
                DESC : "你闻道了一股芳香的味道，循着味道你闻道了一股芳香的味道，循着味道你在草丛中发现了几株野薄荷",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了薄荷",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片遗言",
                    TIP : "你在草丛中采集薄荷的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "松树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 505,
                DESC : "你扶着一棵松树的时候竟然发现这颗树上有着丰富的树脂",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了树脂",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在收集树脂的过程中，你发现树皮上刻着什么东西。",
                },
            },              
            {
                NAME : "野土豆",
                PIC : "Texture/Monster/1210",
                OPEN_WAYS : ["0"],
                DROP_ID : 2114,
                DESC : "你好像踩到了什么东西，仔细一看是几株野土豆",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了土豆",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集土豆的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },                       
            {
                NAME : "棕榈树",
                PIC : "Texture/Monster/1214",
                OPEN_WAYS : ["0"],
                DROP_ID : 204,
                DESC : "枝干粗壮的棕榈树，有宽大的树叶，应该能派上用场",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了阔叶",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐棕榈树的过程中，发现了刻在树皮上的东西。",
                },
            },
            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 203,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片遗言",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },
        ],
        M_STAGE : [
            {
                NAME : "小野猪",
                PIC : "Texture/Monster/1008",
                MONSTER : [1008,1009],
                DANGER : "2",
                DROP_ID : 201,
                DESC : "两只小野猪出现在你的面前，并轮流向你哼唧了一下",//关卡进入描述
                DESC1 : "...",//关卡战斗中描述
                DESC2 : "你成功击败了小野猪",//关卡战斗结束描述
            },
            // {
            //     NAME : "野猪",
            //     PIC : "Texture/Monster/1009",
            //     MONSTER : [1009,1009],
            //     DANGER : "2",
            //     DROP_ID : 201,
            //     DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
            //     DESC1 : "",//关卡战斗中描述
            //     DESC2 : "你成功击败了野猪",//关卡战斗结束描述
            // },
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 1,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],
    }, 

    "3":{
        ID : "3",
        NAME : "竹林", 
        TYPE : "101",
        ISCHECK : 0,//是否为存档点，0表示不是，1表示是存档点
        DESC : "茂密的竹子从地下拔起，直插云霄，有明显的大型动物生存痕迹，是一个资源丰富但有一定危险性的地方。",
        R_STAGE : [
            {
                NAME : "粗壮的竹子",
                PIC : "Texture/Monster/1104",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 303,
                DESC : "几株粗壮的竹子立在路中央，挡住了你的去路",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了竹子",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "竹子字迹",
                    TIP : "你在砍伐竹子的时候，发现有什么东西刻在竹子上。",
                },

            },
            {
                NAME : "粗壮的竹子",
                PIC : "Texture/Monster/1104",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 303,
                DESC : "几株粗壮的竹子立在路中央，挡住了你的去路",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了竹子",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "竹子字迹",
                    TIP : "你在砍伐竹子的时候，发现有什么东西刻在竹子上。",
                },
            },
            {
                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 304,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片遗言",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
        ],
        M_STAGE : [
            {
                NAME : "野猪",
                PIC : "Texture/Monster/1009",
                MONSTER : [1008,1009],
                DANGER : "2",
                DROP_ID : 301,
                DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪",//关卡战斗结束描述


            },
            {
                NAME : "野猪",
                PIC : "Texture/Monster/1009",
                MONSTER : [1009,1009],
                DANGER : "2",
                DROP_ID : 301,
                DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪",//关卡战斗结束描述
            },
            {
                NAME : "野猪",
                PIC : "Texture/Monster/1009",
                MONSTER : [1009,1009],
                DANGER : "2",
                DROP_ID : 301,
                DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪",//关卡战斗结束描述
            },
            {
                NAME : "野猪",
                PIC : "Texture/Monster/1009",
                MONSTER : [1009,1009],
                DANGER : "2",
                DROP_ID : 301,
                DESC : "两只野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1014",
                MONSTER : [1014],
                DANGER : "3",
                DROP_ID : 302,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 1,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 2}, {TYPE : "2", VALUE : 1},{TYPE : "1", VALUE : 6}],
        // UNLOCK : [{TYPE : "2", VALUE : 1}],
    },

    "4":{
        ID : "4",
        NAME : "丘陵", 
        TYPE : "101",
        ISCHECK : 0,
        DESC : "复杂的地形有着复杂的生物形态，伴随而来的是多样的可获取物资，是值得探索的地方。但是似乎有熊出没。",
        R_STAGE : [
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 403,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树的过程中，发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 403,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树的过程中，发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "蜂窝",
                PIC : "Texture/Monster/1106",
                OPEN_WAYS : ["0"],
                DROP_ID : 404,
                DESC : "你听到了嗡嗡嗡的声音，循着声音你找了藏着大量蜂蜜的蜂巢",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了蜂蜜",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在收集蜂蜜的过程中，你在旁边的树上发现刻着一些字迹。",
                },
            },
            {
                NAME : "野土豆",
                PIC : "Texture/Monster/1210",
                OPEN_WAYS : ["0"],
                DROP_ID : 405,
                DESC : "你好像踩到了什么东西，仔细一看是几株野土豆",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了土豆",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集土豆的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 406,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
        ],
        M_STAGE : [
            {
                NAME : "熊",
                PIC : "Texture/Monster/1014",
                MONSTER : [1014],
                DANGER : "3",
                DROP_ID : 401,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1014",
                MONSTER : [1014],
                DANGER : "3",
                DROP_ID : 401,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1014",
                MONSTER : [1014],
                DANGER : "3",
                DROP_ID : 401,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1015",
                MONSTER : [1015],
                DANGER : "3",
                DROP_ID : 401,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1015",
                MONSTER : [1015],
                DANGER : "4",
                DROP_ID : 401,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1015",
                MONSTER : [1015],
                DANGER : "4",
                DROP_ID : 401,
                DESC : "你的视野里出现了一只熊，它转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1015",
                MONSTER : [1014,1015],
                DANGER : "5",
                DROP_ID : 402,
                DESC : "你的视野里出现了两头熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1014",
                MONSTER : [1014,1015],
                DANGER : "5",
                DROP_ID : 402,
                DESC : "你的视野里出现了两头熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1014",
                MONSTER : [1014,1015],
                DANGER : "5",
                DROP_ID : 402,
                DESC : "你的视野里出现了两头熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
        ],
        SECRET : {
            "IDS" : [401],
            "RATE" : 10,
            "LIMIT" : 1,
        },
        UNLOCK : [{TYPE : "1", VALUE : 3}, {TYPE : "2", VALUE : 1}],
        // UNLOCK : [{TYPE : "1", VALUE : 3}, {TYPE : "2", VALUE : 1},{TYPE : "4", VALUE : "a1_2"}],//测试
    },

    "5":{
        ID : "5",
        NAME : "溶洞", 
        TYPE : "101",
        DESC : "天然形成的溶洞，即使在白天的时候，溶洞中也十分黑暗，最好能带上些可以照明的东西来。",
        R_STAGE : [


            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 503,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },

            {
                NAME : "松树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 505,
                DESC : "你扶着一棵松树的时候竟然发现这颗树上有着丰富的树脂",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了树脂",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在收集树脂的过程中，你发现树皮上刻着什么东西。",
                },
            },        

            {
                NAME : "石片",
                PIC : "Texture/Monster/1208",
                OPEN_WAYS : ["0"],
                DROP_ID : 504,
                DESC : "不远处有一堆凌乱的石片，可以收集一些留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石片",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集石片的过程中，你发现其中一片刻着一些字迹。",
                },
            },
            // {
            //     NAME : "油脂树",
            //     PIC : "Texture/Monster/1213",
            //     OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
            //     DROP_ID : 505,
            //     DESC : "你看到一棵流淌着树脂的枯树",//关卡进入描述
            //     DESC1 : "努力砍伐中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了木材",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "树皮字迹",
            //         TIP : "当你正准备砍伐油脂树的时候，你发现树皮上有铭刻着什么东西。",
            //     },
            // },
        ],
        M_STAGE : [
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1021",
                MONSTER : [1021,1021],
                DANGER : "3",
                DROP_ID : 501,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1021",
                MONSTER : [1021,1021],
                DANGER : "3",
                DROP_ID : 501,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1021,1023],
                DANGER : "4",
                DROP_ID : 502,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1021,1023],
                DANGER : "4",
                DROP_ID : 502,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1021,1023],
                DANGER : "4",
                DROP_ID : 502,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1021",
                MONSTER : [1021,1021,1021],
                DANGER : "5",
                DROP_ID : 502,
                DESC : "你突然感受到什么动静，仔细一看，三条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
        ],
        SECRET : {
            "IDS" : [501],
            "RATE" : 10,
            "LIMIT" : 1,
        },
        // UNLOCK : [{TYPE : "1", VALUE : 2}, {TYPE : "2", VALUE : 1}],//测试用
        UNLOCK : [{TYPE : "1", VALUE : 3}, {TYPE : "2", VALUE : 1}],
    },

    "6":{
        ID : "6",
        NAME : "海岸", 
        TYPE : "101",
        // ISCHECK : 1,
        DESC : "瀑布下的一片区域，上接瀑布，下临大海，生长着一些椰子树，常年经受海水冲刷。",
        R_STAGE : [
            {
                NAME : "椰子树",
                PIC : "Texture/Monster/1101",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 601,
                DESC : "海边生长的椰子树，躯干可用于建筑，果实可食用",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功砍伐了椰子树",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐椰子树的过程中，你发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "椰子树",
                PIC : "Texture/Monster/1101",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 601,
                DESC : "海边生长的椰子树，躯干可用于建筑，果实可食用",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功砍伐了椰子树",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐椰子树的过程中，你发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "椰子树",
                PIC : "Texture/Monster/1101",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 601,
                DESC : "海边生长的椰子树，躯干可用于建筑，果实可食用",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐椰子树的过程中，你发现树皮上刻着什么东西。",
                },
            },
        ],
        M_STAGE : [
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        // UNLOCK : [{TYPE : "1", VALUE : 2}, {TYPE : "2", VALUE : 1}],//测试用
        UNLOCK : [{TYPE : "1", VALUE : 8}, {TYPE : "2", VALUE : 1}],
    },

    "7":{
        ID : "7",
        NAME : "林中暗流", 
        TYPE : "101",
        DESC : "一条隐蔽的暗流，有一些植物分布在暗流周围，也许会遇到意想不到的东西。",
        R_STAGE : [
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 707,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            }, 		
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 704,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树的过程中，发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 704,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树的过程中，发现树皮上刻着什么东西。",
                },
            },  
            {
                NAME : "野土豆",
                PIC : "Texture/Monster/1210",
                OPEN_WAYS : ["0"],
                DROP_ID : 705,
                DESC : "你好像踩到了什么东西，仔细一看是几株野土豆",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了土豆",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集土豆的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "野薄荷",
                PIC : "Texture/Monster/1215",
                OPEN_WAYS : ["0"],
                DROP_ID : 706,
                DESC : "你闻道了一股芳香的味道，循着味道你闻道了一股芳香的味道，循着味道你在草丛中发现了几株野薄荷",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了薄荷",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集薄荷的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
         
        ],
        M_STAGE : [
            {
                NAME : "野猪群",
                PIC : "Texture/Monster/1009",
                MONSTER : [1009,1009,1010],
                DANGER : "5",
                DROP_ID : 701,
                DESC : "一群野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪群",//关卡战斗结束描述
            },
            {
                NAME : "野猪群",
                PIC : "Texture/Monster/1009",
                MONSTER : [1009,1009,1010],
                DANGER : "5",
                DROP_ID : 701,
                DESC : "一群野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪群",//关卡战斗结束描述
            },
            {
                NAME : "野猪群",
                PIC : "Texture/Monster/1010",
                MONSTER : [1010,1010,1010],
                DANGER : "6",
                DROP_ID : 701,
                DESC : "一群野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪群",//关卡战斗结束描述
            },
            {
                NAME : "野猪群",
                PIC : "Texture/Monster/1010",
                MONSTER : [1010,1010,1010],
                DANGER : "6",
                DROP_ID : 701,
                DESC : "一群野猪突然出现在你的面前，并摆出了战斗姿态",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了野猪群",//关卡战斗结束描述
            },
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1012",
                MONSTER : [1012,1012,1012,1012],
                DANGER : "6",
                DROP_ID : 702,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1012",
                MONSTER : [1012,1012,1012,1012],
                DANGER : "6",
                DROP_ID : 702,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1012",
                MONSTER : [1012,1012,1012,1012],
                DANGER : "6",
                DROP_ID : 702,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
        ],
        SECRET : {
            "IDS" : [701],
            "RATE" : 10,
            "LIMIT" : 1,
        },
        UNLOCK : [{TYPE : "1", VALUE : 5}, {TYPE : "2", VALUE : 1}],
    },

    "8":{
        ID : "8",
        NAME : "瀑布", 
        TYPE : "101",
        DESC : "远处听到的流水声来自这里的瀑布，瀑布下方有许多被水流冲击到很光滑的石头，也有一些藤蔓类植物生长在周围。",
        R_STAGE : [
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 803,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            },         
            {
                NAME : "石片",
                PIC : "Texture/Monster/1208",
                OPEN_WAYS : ["0"],
                DROP_ID : 801,
                DESC : "不远处有一堆凌乱的石片，可以收集一些留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石片",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集石片的过程中，你发现其中一片刻着一些字迹。",
                },
            },
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 802,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石块字迹",
                    TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
                },
            },

        ],
        M_STAGE : [

        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}], 
    },

    "9":{
        ID : "9",
        NAME : "远山", 
        TYPE : "101",
        ISCHECK : 1,
        DESC : "远处的山脉，高度一般，但是看不清山里有什么，更不知道山的另一边是什么。偶尔会有炊烟的东西飘出，难道是有人居住？",
        R_STAGE : [
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 903,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石块字迹",
                    TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
                },
            },
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 904,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树时，发现树皮上刻着什么东西。",
                },
            }, 
            {
                NAME : "裸露的铁矿",
                PIC : "Texture/Monster/1205",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 905,
                DESC : "几块矿石裸露在路边，看样子应该是裸露的铁矿",//关卡进入描述
                DESC1 : "努力挖矿中...",//关卡战斗中描述
                DESC2 : "你成功采集到了铁矿",//关卡战斗结束描述
            },             
        ],
        M_STAGE : [
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1037",
                MONSTER : [1003,1003,1004],
                DANGER : "6",
                DROP_ID : 901,
                DESC : "一群狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1037",
                MONSTER : [1003,1003,1004],
                DANGER : "6",
                DROP_ID : 901,
                DESC : "一群狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1003,1003,1003,1003],
                DANGER : "7",
                DROP_ID : 901,
                DESC : "一群狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1003,1003,1003,1003],
                DANGER : "7",
                DROP_ID : 901,
                DESC : "一群狼出现在你的面前，打量了你一下，便冲了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "猛虎",
                PIC : "Texture/Monster/1025",
                MONSTER : [1025,1025],
                DANGER : "7",
                DROP_ID : 902,
                DESC : "两只猛虎出现在你的视野里，你没想到这里居然还有猛虎，看样子难免一战",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了猛虎",//关卡战斗结束描述
            },
        ],
        SECRET : {
            "IDS" : [901],
            "RATE" : 10,
            "LIMIT" : 1,
        },
        UNLOCK : [{TYPE : "1", VALUE : 4}, {TYPE : "2", VALUE : 1}], 
    },

    "10":{
        ID : "10",
        NAME : "沼泽湿地", 
        TYPE : "101",
        DESC : "奇特的沼泽，连接着周围不同的地貌，比一般的沼泽地形更加复杂，一定要小心。",
        R_STAGE : [
            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 1003,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 1003,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "棕榈树",
                PIC : "Texture/Monster/1214",
                OPEN_WAYS : ["0"],
                DROP_ID : 1004,
                DESC : "枝干粗壮的棕榈树，有宽大的树叶，应该能派上用场",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐棕榈树的过程中，发现了刻在树皮上的东西。",
                },
            },  
            {
                NAME : "黏土堆",
                PIC : "Texture/Monster/1206",
                OPEN_WAYS : ["0"],
                DROP_ID : 1005,
                DESC : "一堆造型比较奇怪的土，你摸了下，发现是一堆黏土",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了黏土",//关卡战斗结束描述
            },            
        ],
        M_STAGE : [
            {
                NAME : "鳄鱼",
                PIC : "Texture/Monster/1018",
                MONSTER : [1018,1018],
                DANGER : "7",
                DROP_ID : 1006,
                DESC : "两只凶猛的鳄鱼从沼泽里了浮出来，打算将你作为食物",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了鳄鱼",//关卡战斗结束描述
            },
            {
                NAME : "鳄鱼",
                PIC : "Texture/Monster/1018",
                MONSTER : [1018,1018],
                DANGER : "7",
                DROP_ID : 1006,
                DESC : "两只凶猛的鳄鱼从沼泽里了浮出来，打算将你作为食物",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了鳄鱼",//关卡战斗结束描述
            },
            {
                NAME : "鳄鱼",
                PIC : "Texture/Monster/1018",
                MONSTER : [1018,1018],
                DANGER : "7",
                DROP_ID : 1006,
                DESC : "两只凶猛的鳄鱼从沼泽里了浮出来，打算将你作为食物",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了鳄鱼",//关卡战斗结束描述
            },
            {
                NAME : "鳄鱼",
                PIC : "Texture/Monster/1019",
                MONSTER : [1018,1019],
                DANGER : "8",
                DROP_ID : 1006,
                DESC : "两只凶猛的鳄鱼从沼泽里了浮出来，打算将你作为食物",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了鳄鱼",//关卡战斗结束描述
            },
            {
                NAME : "鳄鱼",
                PIC : "Texture/Monster/1019",
                MONSTER : [1018,1019],
                DANGER : "8",
                DROP_ID : 1006,
                DESC : "两只凶猛的鳄鱼从沼泽里了浮出来，打算将你作为食物",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了鳄鱼",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [1001],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 4}, {TYPE : "2", VALUE : 1}], 
    },

    "11":{
        ID : "11",
        NAME : "荒漠", 
        TYPE : "101",
        ISCHECK : 0,//是否为存档点，0表示不是，1表示是存档点
        DESC : "看似荒芜无一物的荒漠，虽然存在着巨大的危险，但相信里面也一定有值得探索的东西。",
        R_STAGE : [
            {
                NAME : "软金",
                PIC : "Texture/Monster/1201",
                OPEN_WAYS : ["0"],
                DROP_ID : 1102,
                DESC : "几块矿石裸露在路边，看样子应该是软金矿",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了软金",//关卡战斗结束描述
            }, 
            {
                NAME : "硝石",
                PIC : "Texture/Monster/1212",
                OPEN_WAYS : ["0"],
                DROP_ID : 1103,
                DESC : "一块白色的矿石出现在眼前，看样子是一块硝石",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了硝石",//关卡战斗结束描述
            }, 
        ],
        M_STAGE : [
            // {
            //     NAME : "蛇",
            //     PIC : "Texture/Monster/1022",
            //     MONSTER : [1022,1022,1022],
            //     DANGER : "8",
            //     DROP_ID : 1101,
            //     DESC : "你突然感受到什么动静，仔细一看，三条蛇向着你游动过来",//关卡进入描述
            //     DESC1 : "",//关卡战斗中描述
            //     DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            // },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1022",
                MONSTER : [1022,1022,1022],
                DANGER : "8",
                DROP_ID : 0,
                DESC : "你突然感受到什么动静，仔细一看，三条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1022",
                MONSTER : [1022,1022,1022],
                DANGER : "8",
                DROP_ID : 0,
                DESC : "你突然感受到什么动静，仔细一看，三条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1022",
                MONSTER : [1022,1022,1022,1022],
                DANGER : "9",
                DROP_ID : 0,
                DESC : "你突然感受到什么动静，仔细一看，四条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [1101],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 9}, {TYPE : "2", VALUE : 10}], 
    },

    "12":{
        ID : "12",
        NAME : "湖泊", 
        TYPE : "101",
        DESC : "有一定深度的湖泊，有着不错的淡水资源，虽然表明平静，但是暗藏杀机也说不定。",
        R_STAGE : [
            {
                NAME : "棕榈树",
                PIC : "Texture/Monster/1218",
                OPEN_WAYS : ["0"],
                DROP_ID : 1202,
                DESC : "枝干粗壮的棕榈树，有宽大的树叶，应该能派上用场",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了阔叶",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐棕榈树的过程中，发现了刻在树皮上的东西。",
                },
            },
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 1203,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石块字迹",
                    TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
                },
            },
        ],
        M_STAGE : [
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1012",
                MONSTER : [1012,1012,1012,1012],
                DANGER : "6",
                DROP_ID : 1201,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1013",
                MONSTER : [1012,1012,1012,1013],
                DANGER : "7",
                DROP_ID : 1201,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1013",
                MONSTER : [1012,1012,1012,1013],
                DANGER : "7",
                DROP_ID : 1201,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
            {
                NAME : "食人鱼群",
                PIC : "Texture/Monster/1013",
                MONSTER : [1012,1012,1012,1013],
                DANGER : "7",
                DROP_ID : 1201,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 7}, {TYPE : "2", VALUE : 1}],
    },

    "13":{
        ID : "13",
        NAME : "雨林", 
        TYPE : "101",
        DESC : "雨林是一种古老而奇特的生态环境，充足的雨水和丰富的物种构成了这片机遇与危险并存的雨林。",
        R_STAGE : [
            {
                NAME : "油脂树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1303,
                DESC : "一棵高大的树出现在你眼前，上面有着丰富的油脂",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐油脂树的时候，发现树皮上刻着什么东西。",
                },
            },        
            {

                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 1304,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 1306,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            },             
            {
                NAME : "油脂树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1303,
                DESC : "一棵高大的树出现在你眼前，上面有着丰富的油脂",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐油脂树的时候，发现树皮上刻着什么东西。",
                },
            },
        ],
        M_STAGE : [
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1023,1023],
                DANGER : "7",
                DROP_ID : 1301,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1023,1023],
                DANGER : "7",
                DROP_ID : 1301,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "猛虎",
                PIC : "Texture/Monster/1025",
                MONSTER : [1025,1025],
                DANGER : "7",
                DROP_ID : 1302,
                DESC : "两只猛虎出现在你的视野里，你没想到这里居然还有猛虎，看样子难免一战",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了猛虎",//关卡战斗结束描述
            },
            {
                NAME : "猛虎",
                PIC : "Texture/Monster/1025",
                MONSTER : [1025,1025],
                DANGER : "7",
                DROP_ID : 1302,
                DESC : "两只猛虎出现在你的视野里，你没想到这里居然还有猛虎，看样子难免一战",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了猛虎",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1023,1023],
                DANGER : "7",
                DROP_ID : 1301,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "蛇",
                PIC : "Texture/Monster/1023",
                MONSTER : [1023,1023],
                DANGER : "7",
                DROP_ID : 1301,
                DESC : "你突然感受到什么动静，仔细一看，两条蛇向着你游动过来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蛇",//关卡战斗结束描述
            },
            {
                NAME : "猛虎",
                PIC : "Texture/Monster/1025",
                MONSTER : [1025,1025],
                DANGER : "7",
                DROP_ID : 1302,
                DESC : "两只猛虎出现在你的视野里，你没想到这里居然还有猛虎，看样子难免一战",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了猛虎",//关卡战斗结束描述
            },
            {
                NAME : "猛虎",
                PIC : "Texture/Monster/1026",
                MONSTER : [1025,1026],
                DANGER : "7",
                DROP_ID : 1302,
                DESC : "两只猛虎出现在你的视野里，你没想到这里居然还有猛虎，看样子难免一战",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了猛虎",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [1301],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 7}, {TYPE : "2", VALUE : 1}], 
    },

    "14":{
        ID : "14",
        NAME : "松木林", 
        TYPE : "101",
        DESC : "几乎完全由松树组成的树林，给人一种坚韧挺拔的气势，能看到一些遗留的痕迹，看来里面也有不少动物。",
        R_STAGE : [
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 1407,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石块字迹",
                    TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
                },
            },        
            {
                NAME : "烧焦的树",
                PIC : "Texture/Monster/1109",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1403,
                DESC : "一颗一颗部分被烧焦的树，看样子是被故意焚毁的。",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐树的过程中，发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "野土豆",
                PIC : "Texture/Monster/1210",
                OPEN_WAYS : ["0"],
                DROP_ID : 1404,
                DESC : "你好像踩到了什么东西，仔细一看是几株野土豆",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了土豆",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集土豆的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "松树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 505,
                DESC : "你扶着一棵松树的时候竟然发现这颗树上有着丰富的树脂",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了树脂",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在收集树脂的过程中，你发现树皮上刻着什么东西。",
                },
            },             
             {
                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 1405,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },           
        ],
        M_STAGE : [
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004,1004,1005],
                DANGER : "9",
                DROP_ID : 2,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004,1004,1005],
                DANGER : "9",
                DROP_ID : 2,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004,1004,1005],
                DANGER : "9",
                DROP_ID : 2,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1004",
                MONSTER : [1004,1005,1005],
                DANGER : "10",
                DROP_ID : 2,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            // {
            //     NAME : "狼群",
            //     PIC : "Texture/Monster/1007",
            //     MONSTER : [1004,1005,1005],
            //     DANGER : "10",
            //     DROP_ID : 0,
            //     DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
            //     DESC1 : "",//关卡战斗中描述
            //     DESC2 : "你成功击败了狼群",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石片字迹",
            //         TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
            //     },
            // },
        ],
        // SECRET : {
        //     "IDS" : [1401],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 12},{TYPE : "1", VALUE : 13}, {TYPE : "2", VALUE : 1}], 
    },

    "15":{
        ID : "15",
        NAME : "原始森林", 
        TYPE : "101",
        DESC : "一片透出出原始气息的森林，森林看样子经过了非常长久的时间而没有遭到显著的干扰，保持着自然的发展趋势。",
        R_STAGE : [
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 1515,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            },         
            {
                NAME : "烧焦的树",
                PIC : "Texture/Monster/1109",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1506,
                DESC : "一颗部分被烧焦的树，看样子是被故意焚毁的。",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐树的过程中，发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "油脂树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1507,
                DESC : "一棵高大的树出现在你眼前，上面有着丰富的油脂",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐树的过程中，发现树皮上刻着什么东西。",
                },
            },
            {
                NAME : "蜂窝",
                PIC : "Texture/Monster/1106",
                OPEN_WAYS : ["0"],
                DROP_ID : 1508,
                DESC : "你听到了嗡嗡嗡的声音，循着声音你找了藏着大量蜂蜜的蜂巢",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了蜂蜜",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在收集蜂蜜的过程中，你在旁边的树上发现刻着一些字迹。",
                },
            },
            {
                NAME : "野薄荷",
                PIC : "Texture/Monster/1215",
                OPEN_WAYS : ["0"],
                DROP_ID : 1509,
                DESC : "你闻道了一股芳香的味道，循着味道你在草丛中发现了几株野薄荷",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了薄荷",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集薄荷的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 1510,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "棕榈树",
                PIC : "Texture/Monster/1214",
                OPEN_WAYS : ["0"],
                DROP_ID : 1511,
                DESC : "枝干粗壮的棕榈树，有宽大的树叶，应该能派上用场",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐棕榈树的过程中，发现了刻在树皮上的东西。",
                },
            }, 
            {
                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 1512,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            },           
        ],
        M_STAGE : [
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004,1005,1005],
                DANGER : "10",
                DROP_ID : 1501,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },     
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004,1005,1005],
                DANGER : "10",
                DROP_ID : 1501,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1004,1005,1005],
                DANGER : "10",
                DROP_ID : 1501,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "熊",
                PIC : "Texture/Monster/1015",
                MONSTER : [1015,1015,1015],
                DANGER : "10",
                DROP_ID : 1502,
                DESC : "你的视野里出现了几头熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            }, 
            {
                NAME : "熊",
                PIC : "Texture/Monster/1015",
                MONSTER : [1015,1015,1015],
                DANGER : "10",
                DROP_ID : 1502,
                DESC : "你的视野里出现了几头熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败到了熊",//关卡战斗结束描述
            }, 
            // {
            //     NAME : "食人族",
            //     PIC : "Texture/Monster/1028",
            //     MONSTER : [1028,1028],
            //     DANGER : "10",
            //     DROP_ID : 1503,
            //     DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
            //     DESC1 : "",//关卡战斗中描述
            //     DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            // }, 
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1028",
                MONSTER : [1028,1028],
                DANGER : "10",
                DROP_ID : 1503,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1029,1029],
                DANGER : "10",
                DROP_ID : 1503,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1029,1029],
                DANGER : "10",
                DROP_ID : 1503,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1029,1029],
                DANGER : "10",
                DROP_ID : 1503,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1030],
                DANGER : "11",
                DROP_ID : 1503,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
        ],
       //  SECRET : {
       //      "IDS" : [1501],
       //      "RATE" : 0,
       //      "LIMIT" : 2,
       // },
        UNLOCK : [{TYPE : "1", VALUE : 10}, {TYPE : "2", VALUE : 1}], 
    },

    "16":{
        ID : "16",
        NAME : "火山", 
        TYPE : "101",
        DESC : "坐落在这片区域的一座火山，靠近火山可以模糊的听到岩浆流动的声音，不知何时会喷发，也许就在明天。",
        R_STAGE : [
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1602,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树时，发现树皮上刻着什么东西。",
                },
            },            
            {
                NAME : "石片",
                PIC : "Texture/Monster/1208",
                OPEN_WAYS : ["0"],
                DROP_ID : 1603,
                DESC : "不远处有一堆凌乱的石片，可以收集一些留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石片",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集石片的过程中，你发现其中一片刻着一些字迹。",
                },
            },
            {
                NAME : "松树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 505,
                DESC : "你扶着一棵松树的时候竟然发现这颗树上有着丰富的树脂",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了树脂",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在收集树脂的过程中，你发现树皮上刻着什么东西。",
                },
            },             
            {
                NAME : "硫磺",
                PIC : "Texture/Monster/1203",
                OPEN_WAYS : ["0"],
                DROP_ID : 1604,
                DESC : "有些泛黄的硫磺矿，火山周围的产出较多。是制作火药的原材料是制作火药的原材料。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了硫磺",//关卡战斗结束描述
            },            
        ],
        M_STAGE : [
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005],
                DANGER : "11",
                DROP_ID : 1601,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005],
                DANGER : "11",
                DROP_ID : 1601,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005],
                DANGER : "11",
                DROP_ID : 1601,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005],
                DANGER : "11",
                DROP_ID : 1601,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005,1005],
                DANGER : "12",
                DROP_ID : 1601,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
        ],
        // SECRET : {
        //     "IDS" : [1601],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 10}, {TYPE : "2", VALUE : 1}], 
    },

    "17":{
        ID : "17",
        NAME : "雪原", 
        TYPE : "101",
        DESC : "在这一眼望不到边的雪原上，连个黑点也没有。你被这一片宁静的景象所折服，感叹大自然的神奇。",
        R_STAGE : [
            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 1704,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },
            // {
            //     NAME : "水洼",
            //     PIC : "Texture/Monster/1209",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 1704,
            //     DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石片字迹",
            //         TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
            //     },
            // },
            // {
            //     NAME : "水洼",
            //     PIC : "Texture/Monster/1209",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 1704,
            //     DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石片字迹",
            //         TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
            //     },
            // },
            // {
            //     NAME : "水洼",
            //     PIC : "Texture/Monster/1209",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 1704,
            //     DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石片字迹",
            //         TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
            //     },
            // },
            // {
            //     NAME : "水洼",
            //     PIC : "Texture/Monster/1209",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 1704,
            //     DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石片字迹",
            //         TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
            //     },
            // },
            // {
            //     NAME : "水洼",
            //     PIC : "Texture/Monster/1209",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 1704,
            //     DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
            //     DESC1 : "努力采集中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
            //     LAST_WORDS : {
            //         TITLE : "石片字迹",
            //         TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
            //     },
            // },            
        ],
        M_STAGE : [
            {
                NAME : "羊",
                PIC : "Texture/Monster/1033",
                MONSTER : [1033],
                DANGER : "1",
                DROP_ID : 1701,
                DESC : "一只孤独无助的绵羊，不知为何会在这里",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了绵羊",//关卡战斗结束描述
            },
            {
                NAME : "羊",
                PIC : "Texture/Monster/1033",
                MONSTER : [1033],
                DANGER : "1",
                DROP_ID : 1701,
                DESC : "一只孤独无助的绵羊，不知为何会在这里",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了绵羊",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1006",
                MONSTER : [1006,1006,1006,1006],
                DANGER : "12",
                DROP_ID : 1702,
                DESC : "一群雪狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1006",
                MONSTER : [1006,1006,1006,1006],
                DANGER : "12",
                DROP_ID : 1702,
                DESC : "一群雪狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1006",
                MONSTER : [1006,1006,1006,1006],
                DANGER : "12",
                DROP_ID : 1702,
                DESC : "一群雪狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",//关卡进入描述
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1006",
                MONSTER : [1006,1006,1006,1006],
                DANGER : "12",
                DROP_ID : 1702,
                DESC : "一群雪狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1006",
                MONSTER : [1006,1006,1006,1006],
                DANGER : "12",
                DROP_ID : 1702,
                DESC : "一群雪狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },  
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1006",
                MONSTER : [1006,1006,1006,1006],
                DANGER : "12",
                DROP_ID : 1702,
                DESC : "一群雪狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "熊",
                PIC : "Texture/Monster/1016",
                MONSTER : [1016,1016,1016],
                DANGER : "12",
                DROP_ID : 1703,
                DESC : "你的视野里出现了几头白熊，它们转了个头看见了你",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了熊",//关卡战斗结束描述
            },


        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 15}, {TYPE : "2", VALUE : 1}], 
    },

    "18":{
        ID : "18",
        NAME : "绿洲", //比实际关卡多是因为物资种类太多
        TYPE : "101",
        DESC : "被干旱少雨的荒漠围在中间生机勃勃的绿洲，有植物生长也表明了这里一定有着足够的水分。",
        R_STAGE : [
            {
                NAME : "矮树",
                PIC : "Texture/Monster/1202_1",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 1803,
                DESC : "一棵矮树出现在你的眼前，树上已经不剩多少树叶",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "你在砍伐矮树时，发现树皮上刻着什么东西。",
                },
            },          
            {
                NAME : "水洼",
                PIC : "Texture/Monster/1209",
                OPEN_WAYS : ["0"],
                DROP_ID : 1804,
                DESC : "看上去清澈明亮的水洼，想必是由雨水或是露水聚成。",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了清洁水",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集完清洁水准备离开时，发现了一片破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "黏土堆",
                PIC : "Texture/Monster/1206",
                OPEN_WAYS : ["0"],
                DROP_ID : 1805,
                DESC : "一堆造型比较奇怪的土，你摸了下，发现是一堆黏土",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了黏土",//关卡战斗结束描述
            }, 
            {
                NAME : "硝石",
                PIC : "Texture/Monster/1212",
                OPEN_WAYS : ["0"],
                DROP_ID : 1806,
                DESC : "一块白色的矿石出现在眼前，看样子是一块硝石",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了硝石",//关卡战斗结束描述
            }, 
            {
                NAME : "野土豆",
                PIC : "Texture/Monster/1210",
                OPEN_WAYS : ["0"],
                DROP_ID : 1807,
                DESC : "你好像踩到了什么东西，仔细一看是几株野土豆",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了土豆",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你在草丛中寻找土豆的时候，发现了一张破布，上面似乎写着什么。",
                },
            },
            {
                NAME : "草药丛",
                PIC : "Texture/Monster/1105",
                OPEN_WAYS : ["0"],
                DROP_ID : 1808,
                DESC : "几株草药隐藏在草丛中，被细心的你发现了",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了草药",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你在草丛中采集草药的时候，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
        ],
        M_STAGE : [
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005,1005],
                DANGER : "12",
                DROP_ID : 1801,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },           
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005,1005],
                DANGER : "12",
                DROP_ID : 1801,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1035",
                MONSTER : [1035,1035,1035,1035],
                DANGER : "13",
                DROP_ID : 1802,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1005,1005,1005],
                DANGER : "12",
                DROP_ID : 1801,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            }, 
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1035",
                MONSTER : [1035,1035,1035,1035],
                DANGER : "13",
                DROP_ID : 1802,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴",//关卡战斗结束描述
            },            
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 16}, {TYPE : "2", VALUE : 1}],
    },

   "19":{
        ID : "19",
        NAME : "戈壁遗迹", 
        TYPE : "101",
        ISCHECK : 1,//是否为存档点，0表示不是，1表示是存档点
        DESC : "隐藏在戈壁之中的遗迹，看壁画有些像亚特兰蒂斯的文化，兴许能探索出了不得的东西",
        R_STAGE : [
            {
                NAME : "石片",
                PIC : "Texture/Monster/1208",
                OPEN_WAYS : ["0"],
                DROP_ID : 1903,
                DESC : "不远处有一堆凌乱的石片，可以收集一些留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石片",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "你收集石片的过程中，你发现其中一片刻着一些字迹。",
                },
            }, 
            {
                NAME : "乱石块",
                PIC : "Texture/Monster/1204",
                OPEN_WAYS : ["0"],
                DROP_ID : 1904,
                DESC : "几堆乱石块零落在那里，选择几块合适的留作他用",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了石块",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石块字迹",
                    TIP : "你在挑选合适的石块时，发现有一块石头上刻着什么东西。",
                },
            }, 
            {
                NAME : "硫磺",
                PIC : "Texture/Monster/1203",
                OPEN_WAYS : ["0"],
                DROP_ID : 1905,
                DESC : "有些泛黄的硫磺矿，火山周围的产出较多。是制作火药的原材料",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了硫磺",//关卡战斗结束描述
            }, 
            {
                NAME : "软金",
                PIC : "Texture/Monster/1201",
                OPEN_WAYS : ["0"],
                DROP_ID : 1906,
                DESC : "几块矿石裸露在路边，看样子应该是软金矿。能用来制作高级的道具",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了软金",//关卡战斗结束描述
            }, 
            {
                NAME : "黏土",
                PIC : "Texture/Monster/1206",
                OPEN_WAYS : ["0"],
                DROP_ID : 1907,
                DESC : "一堆造型比较奇怪的土，你摸了下，发现是一堆黏土",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了黏土",//关卡战斗结束描述
            }, 
            {
                NAME : "硝石",
                PIC : "Texture/Monster/1212",
                OPEN_WAYS : ["0"],
                DROP_ID : 1908,
                DESC : "一块白色的矿石出现在眼前，看样子是一块硝石",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了硝石",//关卡战斗结束描述
            }, 
            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 1909,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            },  
            {
                NAME : "裸露的铁矿",
                PIC : "Texture/Monster/1205",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 1910,
                DESC : "几块矿石裸露在路边，看样子应该是裸露的铁矿",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了铁矿",//关卡战斗结束描述
            },                   
        ],
        M_STAGE : [
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你悄悄接近蜥蜴的时候，发现脚边有一张破布，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1007,1007,1007],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1007,1007,1007],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1007,1007,1007],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1007,1007,1007],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1007,1007,1007],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },
            {
                NAME : "狼群",
                PIC : "Texture/Monster/1005",
                MONSTER : [1005,1007,1007,1007],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "一群狼出现在你的面前，打量了你一下，便围了上来",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了狼群",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "石片字迹",
                    TIP : "当你击败狼群时，发现了破损的石片，上面似乎写着什么。",
                },
            },
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },  
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            }, 
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 0,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },                                   
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 18}, {TYPE : "2", VALUE : 1}],
    },

   "20":{
        ID : "20",
        NAME : "黑暗囚室", 
        TYPE : "101",
        DESC : "一处秘密的囚室，门口驻守着土著的守卫，应该是用来囚禁氏族罪人的地方",
        R_STAGE : [

            {
                NAME : "裸露的铁矿",
                PIC : "Texture/Monster/1205",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2005,
                DESC : "几块矿石裸露在路边，看样子应该是裸露的铁矿",//关卡进入描述
                DESC1 : "努力挖矿中...",//关卡战斗中描述
                DESC2 : "你成功采集到了铁矿",//关卡战斗结束描述
            }, 
            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2006,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            },         
            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2007,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            }, 
            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2008,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            },  
        ],
        M_STAGE : [
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1030],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1030],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 11},{TYPE : "1", VALUE : 19},{TYPE : "1", VALUE : 21}, {TYPE : "2", VALUE : 1},{TYPE : "4", VALUE : "a5"}],
    },

   "21":{
        ID : "21",
        NAME : "野人洞窟", 
        TYPE : "101",
        DESC : "一个漆黑的洞窟，看不清内部的构造，外部有着人类生活过的痕迹",
        R_STAGE : [
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 1515,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            }, 
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 1515,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            }, 
            {
                NAME : "藤蔓",
                PIC : "Texture/Monster/1102",
                OPEN_WAYS : ["0"],
                DROP_ID : 1515,
                DESC : "一些藤蔓植物出现在视野里，挡住了你的去路",//关卡进入描述
                DESC1 : "努力采集中...",//关卡战斗中描述
                DESC2 : "你成功采集到了藤条",//关卡战斗结束描述
            },
            {
                NAME : "油脂树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 2110,
                DESC : "你看到一棵流淌着树脂的枯树",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "当你正准备砍伐油脂树的时候，你发现树皮上有铭刻着什么东西。",
                },
            },
            {
                NAME : "油脂树",
                PIC : "Texture/Monster/1213",
                OPEN_WAYS : ["4100#4100_1", "4112#4112_1"],
                DROP_ID : 2110,
                DESC : "你看到一棵流淌着树脂的枯树",//关卡进入描述
                DESC1 : "努力砍伐中...",//关卡战斗中描述
                DESC2 : "你成功采集到了木材",//关卡战斗结束描述
                LAST_WORDS : {
                    TITLE : "树皮字迹",
                    TIP : "当你正准备砍伐油脂树的时候，你发现树皮上有铭刻着什么东西。",
                },
            },
            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2111,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            },

            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2112,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            },

            {
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                DROP_ID : 2113,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
            },
           
        ],
        M_STAGE : [
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 2109,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },  
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 2109,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            }, 





            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },      
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
  
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },       
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
 
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },      
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
 
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },       
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
 
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },      
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },

             {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },      
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1030],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },
 
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1028,1029],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },      
            {
                NAME : "食人族",
                PIC : "Texture/Monster/1029",
                MONSTER : [1028,1029,1030],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，追上前去才发现是食人族",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人族",//关卡战斗结束描述
            },            
        ],
        // SECRET : {
        //     "IDS" : [],
        //     "RATE" : 0,
        //     "LIMIT" : 2,
        // },
        UNLOCK : [{TYPE : "1", VALUE : 17}, {TYPE : "2", VALUE : 1}],
    },

    "22":{
        ID : "22",
        NAME : "海盗营地", 
        TYPE : "101",
        DESC : "一处非常隐蔽的营地，如果不是根据线索，根本不可能发现这里。千万注意，别在有人的时候来。",
        R_STAGE : [
            // {
            //     NAME : "储物箱",
            //     PIC : "Texture/Monster/1211",
            //     OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
            //     DROP_ID : 2106,
            //     DESC : "一只人工制造的箱子，外形较为完好，应该是海盗遗留在这的",//关卡进入描述
            //     DESC1 : "努力开启中...",//关卡战斗中描述
            //     DESC2 : "你成功采集到了帆布",//关卡战斗结束描述

            // },
        ],
        M_STAGE : [
             {
                NAME : "海盗",
                PIC : "Texture/Monster/1038",
                MONSTER : [1038,1038,1039],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，悄悄接近才发现是海盗",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了海盗",//关卡战斗结束描述
            },
            {
                NAME : "海盗",
                PIC : "Texture/Monster/1038",
                MONSTER : [1038,1038,1039],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，悄悄接近才发现是海盗",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了海盗",//关卡战斗结束描述
            },
            {
                NAME : "海盗",
                PIC : "Texture/Monster/1039",
                MONSTER : [1038,1038,1039],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，悄悄接近才发现是海盗",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了海盗",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [101],
        //     "RATE" : 0,
        //     "LIMIT" : 1,
        // },
        UNLOCK :  [{TYPE : "4", VALUE : "b6;b6_1;b6_2;e6;e6_1;e6_2"}], 
    },

   "23":{
        ID : "23",
        NAME : "圣果树", 
        TYPE : "101",
        DESC : "一颗造型奇异的树，果实有着极强的功效，被当地人奉为圣果。",
        R_STAGE : [
            // {
            //     NAME : "隐蔽溶洞",
            //     PIC : "Texture/Monster/1202_1",
            //     OPEN_WAYS : ["0"],
            //     DROP_ID : 2107,
            //     DESC : "一颗奇怪的树伫立在溶洞之中，像是在指引着一个方向",//关卡进入描述
            //     DESC1 : "努力搜索中...",//关卡战斗中描述
            //     DESC2 : "你成功找到了破损的海盗船",//关卡战斗结束描述
            // },
        ],
        M_STAGE : [
           {
                NAME : "海盗",
                PIC : "Texture/Monster/1038",
                MONSTER : [1038,1038,1039],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，悄悄接近才发现是海盗",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了海盗",//关卡战斗结束描述
            },
            {
                NAME : "海盗",
                PIC : "Texture/Monster/1038",
                MONSTER : [1038,1038,1039],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，悄悄接近才发现是海盗",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了海盗",//关卡战斗结束描述
            },
            {
                NAME : "海盗",
                PIC : "Texture/Monster/1039",
                MONSTER : [1038,1038,1039],
                DANGER : "15",
                DROP_ID : 2103,
                DESC : "你看到了几个人影，悄悄接近才发现是海盗",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了海盗",//关卡战斗结束描述
            },
        ],
        // SECRET : {
        //     "IDS" : [101],
        //     "RATE" : 0,
        //     "LIMIT" : 1,
        // },
        UNLOCK :  [{TYPE : "4", VALUE : "c7_2;c7_1"}],
    },

   "24":{
        ID : "24",
        NAME : "古代遗迹", 
        TYPE : "101",
        DESC : "隐藏在荒野之中的遗迹，看样式有些像亚特兰蒂斯的文化，兴许能探索出了不得的东西",
        R_STAGE : [
           
        ],
        M_STAGE : [
           {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 2109,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            },  
            {
                NAME : "蜥蜴群",
                PIC : "Texture/Monster/1036",
                MONSTER : [1035,1035,1036,1036],
                DANGER : "15",
                DROP_ID : 2109,
                DESC : "你感到脚下一阵骚动，一群蜥蜴出现在你面前",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了蜥蜴群",//关卡战斗结束描述
            }, 
        ],
        // SECRET : {
        //     "IDS" : [101],
        //     "RATE" : 0,
        //     "LIMIT" : 1,
        // },
        UNLOCK :  [{TYPE : "4", VALUE : "w6_2"}],
    },








    "1003":{
        ID : "1003",
        NAME : "竹林", 
        TYPE : "102",
        DESC : "茂密的竹子从地下拔起，直插云霄，有明显的大型动物生存痕迹，是一个资源丰富但有一定危险性的地方。",
        STAGE : {
            "1" : {
                MID : "1009",//野猪
                DIS : 1,//怪物的距离
                RAW_CNT : 6,
                MAX_CNT : 12,
                COLD : 96,
                WAY : "狩猎",
                POTS : ["1003"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5002,
                CIRCLE : 1,
                DESC : "野猪，通过狩猎可以获取一定的生肉",
                DESC1 : "狩猎中",
                DESC2 : "继续狩猎",
                COND : {                                            
                },
            },
            "2" : {
                MID : "1104",//竹子
                DIS : 1,
                RAW_CNT : 12,
                MAX_CNT : 24,
                COLD : 144,
                WAY : "采集",
                POTS : ["1003"],
                PROMOTE : [],
                RESTRAIN : ["1"],
                DROP_ID : 5001,
                CIRCLE : 1,
                DESC : "成熟了的竹子，偶尔会有野猪在附近晃悠破坏竹子",
                DESC1 : "采集中",
                DESC2 : "继续采集",
                COND : {                                            
                },
            },

            "1225" : {
                SPECIAL : 1,//标识为圆球
                MID : "1225",//
                DIS : 1,//怪物的距离
                RAW_CNT : 1,
                MAX_CNT : 1,
                COLD : 9600,
                WAY : "拾取",
                POTS : ["1003"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5025,
                CIRCLE : 0,
                DESC : "神秘圆球",
                DESC1 : "拾取中",
                DESC2 : "继续拾取",
                COND : {  
                    "1012" : {//资源点资源数量
         
                     "1003" : {
                         "2" : 24,
                         },
   
                    },
                },


        },
    },
        UNLOCK : [{TYPE : "1", VALUE : 3}, {TYPE : "2", VALUE : 1}], 
    },

    "1004":{
        ID : "1004",
        NAME : "丘陵", 
        TYPE : "102",
        DESC : "复杂的地形有着复杂的生物形态，伴随而来的是多样的可获取物资，是值得探索的地方。但是似乎有熊出没。",
        STAGE : {
            "3" : {
                MID : "1105",//草药丛
                DIS : 1,//怪物的距离
                RAW_CNT : 6,
                MAX_CNT : 12,
                COLD : 108,
                WAY : "采集",
                POTS : ["1004"],
                PROMOTE : ["5"],
                RESTRAIN : [],
                DROP_ID : 5003,
                CIRCLE : 1,
                DESC : "茂密的草药丛，有的还开着漂亮的小花儿，吸引了不少蜜蜂。",
                DESC1 : "采集中",
                DESC2 : "继续采集",
                COND : {                                            
                },
            },
            "4" : {
                MID : "1015",//熊
                DIS : 1,
                RAW_CNT : 6,
                MAX_CNT : 12,
                COLD : 96,
                WAY : "狩猎",
                POTS : ["1004"],                
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5004,
                CIRCLE : 1.5,
                DESC : "丘陵上的灰熊，经常与野猪产生冲突",
                DESC1 : "狩猎中",
                DESC2 : "继续狩猎",
                COND : {                                            
                },
            },
            "5" : {
                MID : "1106",//蜂窝
                DIS : 1,
                RAW_CNT : 9,
                MAX_CNT : 18,
                COLD : 144,
                WAY : "采集",
                POTS : ["1004"],
                PROMOTE : [],
                RESTRAIN : ["4"],
                DROP_ID : 5005,
                CIRCLE : 0.7,
                DESC : "萦绕着蜜蜂的蜂窝，看来采集的难度不小，偶尔还能看到灰熊在附近",
                DESC1 : "采集中",
                DESC2 : "继续采集",
                COND : {                                            
                },
            },
        },
        TRAP : {
            ID   : 2,
            ICON :'Texture/Trap/pi_2',
            NAME : "浅草丛",
            DESC : "此处植被茂盛，附近有一些野兔粪便，可以制作一个野兔陷阱，应该有所收获。陷阱越精良，越易捕获到猎物。陷阱耐久度为0将会失效。",
        },        
        UNLOCK : [{TYPE : "1", VALUE : 4}, {TYPE : "2", VALUE : 1}], 
    },

    "1006":{
        ID : "1006",
        NAME : "海岸", 
        TYPE : "102",
        DESC : "瀑布下的一片区域，上接瀑布，下临大海，生长着一些椰子树，常年经受海水冲刷。",
        STAGE : {
            "6" : {
                MID : "1101",//椰子树
                DIS : 1,//怪物的距离
                RAW_CNT : 8,
                MAX_CNT : 16,
                COLD : 124,
                WAY : "砍伐",
                POTS : ["1006"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5006,
                CIRCLE : 1,
                DESC : "高大的椰子树，长着不少椰子",
                DESC1 : "砍伐中",
                DESC2 : "继续砍伐",
                COND : {                                            
                },
            },

            "1223" : {
                SPECIAL : 1,//标识为圆球
                MID : "1223",//
                DIS : 1,//怪物的距离
                RAW_CNT : 1,
                MAX_CNT : 1,
                COLD : 9600,
                WAY : "拾取",
                POTS : ["1006"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5023,
                CIRCLE : 0,
                DESC : "神秘圆球",
                DESC1 : "拾取中",
                DESC2 : "继续拾取",
                COND : {    
                    "1002" : 20,    //生存天数>=20
                    "1004" : {  
                        "4004" :30,
                    },
                },
            },
        },

        // TRAP : {
        //     ID   : 1,
        //     ICON :'Texture/Trap/pi_1',
        //     NAME : "浅湾",
        //     DESC : "此处水面比较平静，有不少鱼虾在游动，可以用竹子制作一个捕鱼陷阱。陷阱越精良，越容易捕获到猎物，耐久为0将失效。",

        // },  

        UNLOCK : [{TYPE : "1", VALUE : 6}, {TYPE : "2", VALUE : 1}], 
    },

    "1007":{
        ID : "1007",
        NAME : "林中暗流", 
        TYPE : "102",
        DESC : "一条隐蔽的暗流，有一些植物分布在暗流周围，也许会遇到意想不到的东西。",
        STAGE : {
            "7" : {
                MID : "1102",//藤蔓
                DIS : 1,//怪物的距离
                RAW_CNT : 6,
                MAX_CNT : 12,
                COLD : 144,
                WAY : "采集",
                POTS : ["1007"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5007,
                CIRCLE : 2.1,
                DESC : "生长在暗流附近的藤蔓，有着很好的韧性",
                DESC1 : "采集中",
                DESC2 : "继续采集",
                COND : {                                            
                },
            },
            "8" : {
                MID : "1103",//薄荷
                DIS : 1,
                RAW_CNT : 6,
                MAX_CNT : 12,
                COLD : 144,
                WAY : "采集",
                POTS : ["1007"],
                PROMOTE : [],
                RESTRAIN : ["7"],
                DROP_ID : 5008,
                CIRCLE : 0.9,
                DESC : "茂盛的薄荷丛，从远处就能嗅到薄荷的香气，周围倒是看不见藤蔓的存在",
                DESC1 : "采集中",
                DESC2 : "继续采集",
                COND : {                                            
                },
            },
            "1221" : {
                SPECIAL : 1,//标识为圆球
                MID : "1221",//
                DIS : 1,//怪物的距离
                RAW_CNT : 1,
                MAX_CNT : 1,
                COLD : 9600,
                WAY : "拾取",
                POTS : ["1007"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5021,
                CIRCLE : 0,
                DESC : "神秘圆球",
                DESC1 : "拾取中",
                DESC2 : "继续拾取",
                COND : {  
            "1003" : [          // 条件类型: 关卡解锁/完成
             {
                 "18" : {
                     UNLOCK : true,      // 关卡是否要求解锁
                     COMPLETE : false ,// 关卡是否要求完成
                },
            },          
            ],
                },  
            },
        },
        UNLOCK : [{TYPE : "1", VALUE : 7}, {TYPE : "2", VALUE : 1}], 
    },

    "1008":{
        ID : "1008",
        NAME : "瀑布", 
        TYPE : "102",
        DESC : "很远处就能听到这边瀑布的流水声，瀑布下方有许多被水流冲击到很光滑的石头，也许有些用处。瀑布旁边也有一些藤蔓类植物生长。",
        STAGE : {
            "15" : {
                MID : "1216",//石头
                DIS : 1,//怪物的距离
                RAW_CNT : 12,
                MAX_CNT : 24,
                COLD : 96,
                WAY : "挖掘",
                POTS : ["1008"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5015,
                CIRCLE : 1,
                DESC : "几堆乱石块零落在那里，可以选择几块合适的留作他用",
                DESC1 : "挖掘中",
                DESC2 : "继续挖掘",
                COND : {                                            
                },
            },
            "16" : {
                MID : "1217",//石片
                DIS : 1,//怪物的距离
                RAW_CNT : 12,
                MAX_CNT : 24,
                COLD : 96,
                WAY : "挖掘",
                POTS : ["1008"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5016,
                CIRCLE : 1,
                DESC : "被水流冲刷的石片堆，长期的冲刷使得石片变得异常锋利",
                DESC1 : "挖掘中",
                DESC2 : "继续挖掘",
                COND : {                                            
                },
            },            
        },

        TRAP : {
            ID   : 1,
            ICON :'Texture/Trap/pi_1',
            NAME : "溪流",
            DESC : "此处水面有不少鱼虾在游动，可以用竹子制作一个捕鱼陷阱。陷阱越精良，越容易捕获到猎物，耐久为0将失效。",

        }, 

        UNLOCK : [{TYPE : "1", VALUE : 8}, {TYPE : "2", VALUE : 1}], 
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}], //测试用
    },

    "1011":{
        ID : "1011",
        NAME : "荒漠", 
        TYPE : "102",
        DESC : "看似荒芜无一物的荒漠，虽然存在着巨大的危险，但相信里面也一定有值得探索的东西。",
        STAGE : {
            "9" : {
                MID : "1202",//硝石
                DIS : 1,//怪物的距离
                RAW_CNT : 8,
                MAX_CNT : 16,
                COLD : 160,
                WAY : "挖掘",
                POTS : ["1011"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5009,
                CIRCLE : 0.5,
                DESC : "白色的矿石，看样子应该是硝石，是制作火药的原材料",
                DESC1 : "挖掘中",
                DESC2 : "继续挖掘",
                COND : {                                            
                },
            },
            "1222" : {
                SPECIAL : 1,//标识为圆球
                MID : "1222",//
                DIS : 1,//怪物的距离
                RAW_CNT : 1,
                MAX_CNT : 1,
                COLD : 9600,
                WAY : "拾取",
                POTS : ["1011"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5022,
                CIRCLE : 0,
                DESC : "神秘圆球",
                DESC1 : "拾取中",
                DESC2 : "继续拾取",
                COND : {

                "1005" : 1, //天气
                // "1007" : 3, //季节
                "1006" : {
                MIN:30,
                MAX:40,
                },  //温度30-40之间
                },


        },
    },
         UNLOCK : [{TYPE : "1", VALUE : 11}, {TYPE : "2", VALUE : 1}], 
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}], //测试用
    },

    "1013":{
        ID : "1013",
        NAME : "雨林", 
        TYPE : "102",
        DESC : "雨林是一种古老而奇特的生态环境，充足的雨水和丰富的物种构成了这片机遇与危险并存的雨林。",
        STAGE : {
            "10" : {
                MID : "1107",//乔木
                DIS : 1,//怪物的距离
                RAW_CNT : 12,
                MAX_CNT : 24,
                COLD : 180,
                WAY : "砍伐",
                POTS : ["1013"],
                PROMOTE : ["11"],
                RESTRAIN : [],
                DROP_ID : 5010,
                CIRCLE : 1,
                DESC : "高大的乔木，要小心栖居在上面的蟒蛇",
                DESC1 : "砍伐中",
                DESC2 : "继续砍伐",
                COND : {                                            
                },
            },
            "11" : {
                MID : "1023",//巨蟒
                DIS : 1,
                RAW_CNT : 10,
                MAX_CNT : 20,
                COLD : 96,
                POTS : ["1013"],               
                WAY : "狩猎",
                PROMOTE : [],
                RESTRAIN : ["10"],
                DROP_ID : 5011,
                CIRCLE : 1,
                DESC : "凶猛的蟒蛇，盘踞于乔木之上，有着很强的杀伤力",
                DESC1 : "狩猎中",
                DESC2 : "继续狩猎",
                COND : {                                            
                },
            },
    },
        UNLOCK : [{TYPE : "1", VALUE : 13}, {TYPE : "2", VALUE : 1}], 
    },

    "1014":{
        ID : "1014",
        NAME : "松木林", 
        TYPE : "102",
        DESC : "几乎完全由松树组成的树林，给人一种坚韧挺拔的气势，能看到一些遗留的痕迹，看来里面也有不少动物。",
        STAGE : {
            "12" : {
                MID : "1108",//松木
                DIS : 1,//怪物的距离
                RAW_CNT : 9,
                MAX_CNT : 18,
                COLD : 180,
                WAY : "砍伐",
                POTS : ["1014"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5012,
                CIRCLE : 1,
                DESC : "高大的松木，威严挺拔，是良好的木材来源，偶尔还能收集到树脂",
                DESC1 : "砍伐中",
                DESC2 : "继续砍伐",
                COND : {                                            
                },
            },
            "13" : {
                MID : "1109",//烧焦的树
                DIS : 1,
                RAW_CNT : 5,
                MAX_CNT : 10,
                COLD : 96,
                WAY : "砍伐",
                POTS : ["1014"],                
                PROMOTE : ["12"],
                RESTRAIN : [],
                DROP_ID : 5013,
                CIRCLE : 1,
                DESC : "曾经遭遇火灾的松木，部分地方已经被烧成木炭",
                DESC1 : "砍伐中",
                DESC2 : "继续砍伐",
                COND : {                                            
                },
            },
            "1227" : {
                SPECIAL : 1,//标识为圆球
                MID : "1227",//
                DIS : 1,//怪物的距离
                RAW_CNT : 1,
                MAX_CNT : 1,
                COLD : 9600,
                WAY : "拾取",
                POTS : ["1014"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5027,
                CIRCLE : 0,
                DESC : "神秘圆球",
                DESC1 : "拾取中",
                DESC2 : "继续拾取",
                COND : {   
                "1008" : 1, //宠物ID
                "1007" : 3, //季节
                "1013" : true,  //骆驼 
                },            
        },
    },
        TRAP : {
            ID   : 3,
            ICON :'Texture/Trap/pi_3',
            NAME : "密林",
            DESC : "此处树木比较茂密，有不少成群的鸟类出没，可以考虑设置一个针对鸟类的陷阱捕捉鸟类。",
        },        
        UNLOCK : [{TYPE : "1", VALUE : 14}, {TYPE : "2", VALUE : 1}], 
    },

    "1017":{
        ID : "1017",
        NAME : "雪原", 
        TYPE : "102",
        DESC : "在这一眼望不到边的雪原上，连个黑点也没有。你被这一片宁静的景象所折服，感叹大自然的神奇。",
        STAGE : {
            "14" : {
                MID : "1016",//白熊
                DIS : 1,//怪物的距离
                RAW_CNT : 5,
                MAX_CNT : 10,
                COLD : 108,
                WAY : "狩猎",
                POTS : ["1017"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5014,
                CIRCLE : 1,
                DESC : "凶猛的白熊，皮糙肉厚，但是狩猎成功后能获取不少好东西",
                DESC1 : "狩猎中",
                DESC2 : "继续狩猎",
                COND : {                                            
                },
            },
            "1226" : {
                SPECIAL : 1,//标识为圆球
                MID : "1226",//
                DIS : 1,//怪物的距离
                RAW_CNT : 1,
                MAX_CNT : 1,
                COLD : 9600,
                WAY : "拾取",
                POTS : ["1017"],
                PROMOTE : [],
                RESTRAIN : [],
                DROP_ID : 5026,
                CIRCLE : 0,
                DESC : "神秘圆球",
                DESC1 : "拾取中",
                DESC2 : "继续拾取",
                COND : {     
                 "1009" : {//角色状态
         
                 "7003" : {
                         MIN:350,
                         MAX:450,
                 },
         
                 "7004" : {
                         MIN:100,
                         MAX:100,
                 },     
                 "7005" : {
                         MIN:100,
                         MAX:100,
                 },                       
         },

                },            
        },            
        },
        UNLOCK : [{TYPE : "1", VALUE : 17}, {TYPE : "2", VALUE : 1}], 
    },



    "2001":{
        ID : "2001",
        NAME : "母狼栖息地", 
        TYPE : "201",
        PIC : "Texture/World/pdi_2001",
        DESC : "一只巨大的白狼，深邃的眸子中渗透出智慧的影子",//未到达时，显示的介绍
        DESC1 : "白狼对你似乎并没有什么敌意，用一个长者的目光注视着你",//到达后，给予上方的文字
        DESC2 : "你可以尝试着投几片生肉给母狼，也许有意想不到的好处",//友好度满之后喂食出现的文字
        DESCG : "白狼在你的营地门口放了点东西，似乎是为了报答你的恩情",//随机赠送时的文案
        DESCD : "你听到白狼在栅栏外轻轻呼唤你，似乎是需要什么帮助",//随机索取时的文案
        FEED : [
            {"item" : "4020", "count" : 2},
            {"item" : "4020", "count" : 2},
            {"item" : "4003", "count" : 2},
            {"item" : "4003", "count" : 2},
            {"item" : "4013", "count" : 2},
            {"item" : "4013", "count" : 4},
            {"item" : "4020", "count" : 2},
            {"item" : "4020", "count" : 4},
            {"item" : "4020", "count" : 4},
            {"item" : "4043", "count" : 1},
        ],
        DEMAND : {//满足条件可重复
            "1" : {
                COND : {"day" : "1-500", "goodwill" : "0-2"},
                ITEM : {"item" : "4020", "count" : 2},
            }, 
            "2" :{
                COND : {"day" : "1-20", "goodwill" : "2-4"},
                ITEM : {"item" : "4013", "count" : 2},
            }, 
            "3" :{
                COND : {"day" : "20-40", "goodwill" : "4-6"},
                ITEM : {"item" : "4002", "count" : 2},
            }, 
            "4" :{
                COND : {"day" : "20-40", "goodwill" : "6-8"},
                ITEM : {"item" : "4013", "count" : 4},
            }, 
            "5" :{
                COND : {"day" : "40-200", "goodwill" : "8-9"},
                ITEM : {"item" : "4002", "count" : 4},
            }, 
            // "6" :{
            //     COND : {"day" : "40-200", "goodwill" : "9-10"},
            //     ITEM : {"item" : "4002", "count" : 4},
            // },            
        },
        GIVE : {//满足条件不可重复
            "1" : {
                COND : {"day" : "1-20", "goodwill" : "0-2"},
                ITEM : {"4000" : 2,"4004" : 4,},
            }, 
            "2" : {
                COND : {"day" : "1-20", "goodwill" : "2-4"},
                ITEM : {"4007" : 2,"4005" : 4,},
            }, 
            "3" : {
                COND : {"day" : "20-40", "goodwill" : "4-6"},
                ITEM : {"4030" : 2,"4031" : 2,},
            }, 
            "4" : {
                COND : {"day" : "20-200", "goodwill" : "6-8"},
                ITEM : {"4039" : 2,},
            }, 
            "5" : {
                COND : {"day" : "40-200", "goodwill" : "8-10"},
                ITEM : {"4027" : 2,},
            },
            "6" : {
                COND : {"day" : "1-200", "goodwill" : "10-10"},
                ITEM : {"4030" : 4,"4032" : 4},
            },          
        },
        DROP_ID : 1,             //友好度满时抽奖的掉落包
        UNLOCK : [{TYPE : "1", VALUE : 12}, {TYPE : "2", VALUE : 10}],
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],    //测试用
    },

    "2002":{
        ID : "2002",
        NAME : "骆驼栖息地", 
        TYPE : "202",
        PIC : "Texture/World/pdi_2002",
        DESC : "绿洲旁栖息的骆驼",
        DESC1 : "这只骆驼看到你并不害怕，还向你吐了吐口水，似乎对你身上的食物有兴趣",
        //DESC2 : "DESC2骆驼",
        //DESCG : "",//随机赠送时的文案
        DESCD : "一只受伤的骆驼出现在你的营地旁，也许适当的药草能够帮助它治疗伤口",//随机索取时的文案
        FEED : [
            {"item" : "4013", "count" : 2},
            {"item" : "4013", "count" : 2},
            {"item" : "4021", "count" : 2},
            {"item" : "4021", "count" : 2},
            {"item" : "4002", "count" : 4},
            {"item" : "4002", "count" : 4},
            {"item" : "4022", "count" : 4},
            {"item" : "4022", "count" : 4},
            {"item" : "4044", "count" : 4},
            {"item" : "4044", "count" : 8},
        ],
        DEMAND : {
            "1" :{
                COND : {"day" : "1-500", "goodwill" : "0-0"},
                ITEM : {"item" : "4013", "count" : 2},
            }, 


        },
        // GIVE : [
        //     {"4107" : 1,"4106" : 1,},          
        // ],
       UNLOCK : [{TYPE : "1", VALUE : 18}, {TYPE : "2", VALUE : 20}],
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],   //测试用
    },

    "2003":{
        ID : "2003",
        NAME : "野蛮人住所", 
        TYPE : "203",
        PIC : "Texture/World/pdi_2003",
        DESC : "善于交流的土著，身上应该有不少秘密",
        DESC1 : "这个土著的脑子非常聪明，能与你很好的交流。他对这里非常了解，也许知道如何才能逃离出去",
        //DESC2 : "DESC2野蛮人",
        DESCG : "土著带来了一些物资来拜访你",//随机赠送时的文案
        DESCD : "土著前来寻求帮助，希望你能帮到他",//随机索取时的文案
        FEED : [
            {"item" : "4016", "count" : 2},
            {"item" : "4029", "count" : 3},
            {"item" : "4017", "count" : 2},
            {"item" : "4024", "count" : 2},
            {"item" : "4029", "count" : 6},
            {"item" : "4024", "count" : 4},
            {"item" : "4038", "count" : 4},
            {"item" : "4038", "count" : 4},
            {"item" : "4109", "count" : 4},
            {"item" : "4029", "count" : 10},
        ],
        DEMAND : {
            "1" :{
                COND : {"day" : "1-500", "goodwill" : "0-2"},
                ITEM : {"item" : "4016", "count" : 1},
            }, 
            "2" :{
                COND : {"day" : "1-20", "goodwill" : "2-4"},
                ITEM : {"item" : "4024", "count" : 2},
            }, 
            "3" :{
                COND : {"day" : "20-40", "goodwill" : "4-6"},
                ITEM : {"item" : "4017", "count" : 2},
            }, 
            "4" :{
                COND : {"day" : "20-200", "goodwill" : "6-8"},
                ITEM : {"item" : "4029", "count" : 1},
            }, 
            "5" :{
                COND : {"day" : "20-200", "goodwill" : "8-10"},
                ITEM : {"item" : "4116", "count" : 1},
            }, 

        },
        GIVE : {
            "1" :{
                COND : {"day" : "1-20", "goodwill" : "0-2"},
                ITEM : {"4000" : 2,"4004" : 4,},
            }, 
            "2" :{
                COND : {"day" : "1-20", "goodwill" : "2-4"},
                ITEM : {"4005" : 4,"4007" : 2,},
            }, 
            "3" :{
                COND : {"day" : "20-40", "goodwill" : "4-6"},
                ITEM : {"4032" : 2,},
            }, 
            "4" :{
                COND : {"day" : "20-200", "goodwill" : "6-8"},
                ITEM : {"4035" : 2,"4034" : 4,},
            }, 
            "5" :{
                COND : {"day" : "40-200", "goodwill" : "8-10"},
                ITEM : {"4112" : 1,},
            }, 
        },
        SHOP : [
            {"item" : "4000", "count" : 4, "goodwill" : 0},
            {"item" : "4005", "count" : 5, "goodwill" : 0},
            {"item" : "4007", "count" : 2, "goodwill" : 2},
            {"item" : "4032", "count" : 2, "goodwill" : 4},
            {"item" : "4112", "count" : 1, "goodwill" : 6},
            {"item" : "4042", "count" : 1, "goodwill" : 7},
            {"item" : "4035", "count" : 2, "goodwill" : 8},
            {"item" : "4034", "count" : 2, "goodwill" : 10},
            {"item" : "4051", "count" : 2, "goodwill" : 0, "story" : "a6_1" },
        ],
        UNLOCK : [{TYPE : "1", VALUE : 9}, {TYPE : "2", VALUE : 20}],
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],    //测试用
    },

    "3001":{
        ID : "3001",
        NAME : "沉船", 
        TYPE : "301",
        DESC : "不知道什么年代遗留下来的沉船，应该有不少好东西在里面，恐怕随着探索的深入，未知的危险就会越近。",
        R_STAGE : {
            "1" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "2" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "3" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ], 
            "4" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "5" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "6" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "7" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "8" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "9" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "10" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "11" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "12" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "13" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "14" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "15" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ], 
            "16" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "17" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],
            "18" : [
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
                {
                    NAME : "箱子",
                    PIC : "Texture/Monster/1211",
                    OPEN_WAYS : ["0", "4100#4100_1", "4112#4112_1"],
                    DROP_ID : 2202,
                    DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                    DESC1 : "努力开启中...",//关卡战斗中描述
                    DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                },
            ],          
        },
        M_STAGE : {
            "1" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1031",
                    MONSTER : [1031, 1031, 1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1031",
                    MONSTER : [1031,1031,1032],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ],
            "2" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ],
            "3" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "4" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "5" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "6" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "7" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "8" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "9" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "10" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "11" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "12" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "13" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1032,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "14" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "15" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是几头鲨鱼向你冲了过来",
                },
            ], 
            "16" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是一群鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是一群鲨鱼向你冲了过来",
                },
            ],
            "17" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是一群鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是一群鲨鱼向你冲了过来",
                },
            ],
            "18" : [
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是一群鲨鱼向你冲了过来",
                },
                {
                    NAME : "鲨鱼",
                    PIC : "Texture/Monster/1032",
                    MONSTER : [1031,1031,1031,1031,1031,1031,1031,1031,1031,1031,1031],
                    DANGER : "？",
                    DROP_ID : 2201,
                    DESC : "你感受到水流的异样，回头一看是一群鲨鱼向你冲了过来",
                },
            ],
        },
        HARD : {//难度修正参数 影响怪物血量和攻击力
            "1" : 1,
            "2" : 1.2,
            "3" : 1.3,
            "4" : 1.5,
            "5" : 1.6,
            "6" : 1.7,
            "7" : 1.8,
            "8" : 1.9,
            "9" : 2,
            "10" : 2.1,
            "11" : 2.2,
            "12" : 2.3,
            "13" : 2.4,
            "14" : 2.4,
            "15" : 2.5,
            "16" : 2.7,
            "17" : 3,
            "18" : 3,
        },
        // SECRET : {
        //     "IDS" : [1,2],
        //     "RATE" : 0,
        //     "LIMIT" : 20,
        // },
        SUDDEN : {
            "1" : [301],
            "2" : [302],
            "3" : [303],
            "4" : [303],
            "5" : [303],
            "6" : [303],
            "7" : [303],
            "8" : [303],
            "9" : [303],
            "10" : [303],
            "11" : [303],
            "12" : [303],
            "13" : [303],
            "14" : [303],
            "15" : [303],           
            "16" : [303],
            "17" : [303],
            "18" : [303],
        },
        UNLOCK : [{TYPE : "1", VALUE : 5}, {TYPE : "2", VALUE : 1}], 
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],    //测试用
    },


    "4001":{
        ID : "4001",
        NAME : "崖洞", 
        TYPE : "401",
        PIC : "Texture/World/pdi_4001",
        DESC : "善于交流的土著，身上应该有不少秘密",
        STAGE : {
               "entry" : {
                TYPE : 3,
                NAME : "洞口",
                PIC : "Texture/Monster/1201",
                DESC : "崖洞恐怕有危险，于是你给自己存了个档（存档已保存）。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 20,
						SAVE : 1,
                        NEXT : "Y1",
                    },
                ],
            }, 
			 "Y1" : {
                TYPE : 3,
                NAME : "尸骨",
                PIC : "Texture/Monster/1201",
                DESC : "前方有一副骨架",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "Y3",
                    },
                    {
                        NAME : "摸索尸体",
                        TIME : 10,        
                        ATTR : {
                            "7000" : -20,
                        },                      
                        NEXT : "Y2",
                    }
                ],
            }, 
			  "Y2" : {
                TYPE : 2,
                NAME : "尸骨",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0"],
                DROP_ID : 8009,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                NEXT : "Y3",
            }, 
			   "Y3" : {
                TYPE : 3,
                NAME : "阴暗长廊",
                PIC : "Texture/Monster/1201",
                DESC : "阴暗长廊。",//关卡进入描述
                STORY : [
                    {
                        NAME : "快速通过",          
                        TIME : 10,
						ATTR : {
                            "7000" : -20,
                        },   
                        NEXT : "Y4",
                    },
				    {
                        NAME : "放慢步伐",          
                        TIME : 60,
                        NEXT : "Y5",
                    },
                ],
            }, 
			 "Y4" : {
                TYPE : 3,
                NAME : "阴暗长廊",
                PIC : "Texture/Monster/1201",
                DESC : "你的精神极度紧绷",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "Y6",
                    },
                ],
            }, 
			 "Y5" : {
                TYPE : 3,
                NAME : "阴暗长廊",
                PIC : "Texture/Monster/1201",
                DESC : "时间不知不觉过去了很多",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "Y6",
                    },
                ],
            }, 
			  "Y6" : {
                TYPE : 3,
                NAME : "长廊后段",
                PIC : "Texture/Monster/1201",
                DESC : "长廊前方似乎有些雾",//关卡进入描述
                STORY : [
                    {
                        NAME : "调查",          
                        TIME : 60,
                        NEXT : "Y7",
                    },
				    {
                        NAME : "快速通过",          
                        TIME : 10,
						ATTR : {
                            "7005" : -20,
                        },   
                        NEXT : "Y8",
                    },
                ],
            }, 
			 "Y7" : {
                TYPE : 3,
                NAME : "长廊后段",
                PIC : "Texture/Monster/1201",
                DESC : "花了些时间",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "Y9",
                    },
                ],
            }, 
			 "Y8" : {
                TYPE : 3,
                NAME : "长廊后段",
                PIC : "Texture/Monster/1201",
                DESC : "不小心吸入了些雾",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "Y9",
                    },
                ],
            }, 
			"Y9" : {
                TYPE : 1,
                NAME : "蜘蛛",
                PIC : "Texture/Monster/1046",
                MONSTER : [1046,1046],
                DANGER : "4",
                DROP_ID : 8010,
                DESC : "你感觉身后有些异样，回头一看是一群环尾狐猴",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了环尾狐猴",//关卡战斗结束描述
                NEXT : "Y10",
            },
			 "Y10" : {
                TYPE : 3,
                NAME : "阶梯",
                PIC : "Texture/Monster/1201",
                DESC : "长廊前方似乎有些雾",//关卡进入描述
                STORY : [
                    {
                        NAME : "向下继续",          
                        TIME : 20,
                        NEXT : "Y11",
                    },
				    {
                        NAME : "找其他路",          
                        TIME : 60,
                        NEXT : "Y14",
                    },
                ],
            }, 
			 "Y11" : {
                TYPE : 3,
                NAME : "断裂处",
                PIC : "Texture/Monster/1201",
                DESC : "不小心吸入了些雾",//关卡进入描述
                STORY : [
                    {
                        NAME : "越过断裂",          
                        TIME : 10,
						ATTR : {
                            "7005" : -20,
                        },   
                        NEXT : "Y12",
                    },
                ],
            }, 
			"Y12" : {
                TYPE : 1,
                NAME : "蝙蝠",
                PIC : "Texture/Monster/1047",
                MONSTER : [1047,1047,1047],
                DANGER : "6",
                DROP_ID : 8011,
                DESC : "你感觉身后有些异样，回头一看是一群环尾狐猴",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了环尾狐猴",//关卡战斗结束描述
                NEXT : "Y13",
            },
			 "Y13" : {
                TYPE : 2,
                NAME : "采集",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0"],
                DROP_ID : 8012,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                NEXT : "Y16",
            }, 
			 "Y14" : {
                TYPE : 3,
                NAME : "位置岔路",
                PIC : "Texture/Monster/1201",
                DESC : "前方的洞穴更加的幽暗，是否还要继续前行？",//关卡进入描述
                STORY : [
                    {
                        NAME : "回阶梯",          
                        TIME : 20,
                        NEXT : "Y10",
                    },
				    {
                        NAME : "继续深入",          
                        TIME : 60,
                        NEXT : "Y15",
                    },
                ],
            }, 
			"Y15" : {
                TYPE : 3,
                NAME : "风洞",
                PIC : "Texture/Monster/1201",
                DESC : "眼前出现了一个风洞，看来是没法继续探寻了，还是回家修养吧。",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",          
                    },
                ],
            }, 
			 "Y16" : {
                TYPE : 3,
                NAME : "断裂处",
                PIC : "Texture/Monster/1201",
                DESC : "虽然你接着坡势下到了断裂处，但似乎闻到了什么味道。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续深入",          
                        TIME : 10,
						ATTR : {
                            "7005" : -10,
                        },   
                        NEXT : "Y17",
                    },
                ],
            }, 
			 "Y17" : {
                TYPE : 3,
                NAME : "断裂处",
                PIC : "Texture/Monster/1201",
                DESC : "虽然你接着坡势下到了断裂处，但似乎闻到了什么味道。",//关卡进入描述
                STORY : [
                    {
                        NAME : "休息整顿",          
                        TIME : 60,
						ATTR : {
                            "7000" : 35,
                        },   
                        NEXT : "Y18",
                    },
				    {
                        NAME : "继续前进",          
                        TIME : 10,
						ATTR : {
                            "7001" : -20,
                        },   
                        NEXT : "Y19",
                    },
                ],
            }, 
			 "Y18" : {
                TYPE : 3,
                NAME : "断裂处",
                PIC : "Texture/Monster/1201",
                DESC : "休息片刻后得到了回复，但气味似乎更浓了。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续深入",          
                        TIME : 10,
						ATTR : {
                            "7005" : -10,
                        },   
                        NEXT : "Y20",
                    },
                ],
            }, 
			 "Y19" : {
                TYPE : 3,
                NAME : "断裂处",
                PIC : "Texture/Monster/1201",
                DESC : "你继续前进，发现气味更浓了",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续深入",          
                        TIME : 10,
						ATTR : {
                            "7005" : -10,
                        },   
                        NEXT : "Y20",
                    },
                ],
            }, 
			"Y20" : {
                TYPE : 1,
                NAME : "洞魈",
                PIC : "Texture/Monster/1048",
                MONSTER : [1048],
                DANGER : "7",
                DROP_ID : 8013,
                DESC : "你感觉身后有些异样，回头一看是一群环尾狐猴",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了环尾狐猴",//关卡战斗结束描述
                NEXT : "Y21",
            },
			 "Y21" : {
                TYPE : 3,
                NAME : "洞魈巢穴",
                PIC : "Texture/Monster/1201",
                DESC : "你战胜了怪物",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",          
                    },
                ],
            }, 
			
           
			 


        },
        UNLOCK : [{TYPE : "1", VALUE : 5}, {TYPE : "2", VALUE : 1}],
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],//测试
    },

    "4002" : {
        ID : "4002",
        NAME : "遗迹深处", 
        TYPE : "401",
        PIC : "Texture/World/pdi_4001",
        DESC : "善于交流的土著，身上应该有不少秘密",
        STAGE : {
            "entry" : {
                TYPE : 3,
                NAME : "入口",
                PIC : "Texture/Monster/1201",
                DESC : "你面前有两扇门，分别对应着太阳和月亮，你要进入那一扇门中？",//关卡进入描述
                STORY : [
                    {
                        NAME : "太阳符文",          
                        TIME : 20,
						SAVE : 1,
                        NEXT : "S1",
                    },
                    {
                        NAME : "月亮符文",
                        TIME : 20,     
                        SAVE : 1,						
                        NEXT : "M1",
                    }
                ],
            }, 
             "S1" : {
                TYPE : 3,
                NAME : "太阳拱门",
                PIC : "Texture/Monster/1201",
                DESC : "你进入了刻有太阳图样的石门，感觉到一阵眩晕（存档已保存）。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S3",
                    },
                    {
                        NAME : "休息片刻",
                        TIME : 60,        
                        ATTR : {
                            "7000" : 30,
                        },                      
                        NEXT : "S2",
                    }
                ],
            }, 
             "S2" : {
                TYPE : 3,
                NAME : "太阳拱门",
                PIC : "Texture/Monster/1201",
                DESC : "你进入了刻有太阳图样的石门，感觉到一阵眩晕（存档已保存）。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S3",
                    },
                ],
            }, 
            "S3" : {
                TYPE : 2,
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0"],
                DROP_ID : 8001,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                NEXT : "S4",
            },
             "S4" : {
                TYPE : 3,
                NAME : "陡坡",
                PIC : "Texture/Monster/1201",
                DESC : "你进入了刻有太阳图样的石门，感觉到一阵眩晕（存档已保存）。",//关卡进入描述
                STORY : [
                    {
                        NAME : "谨慎通过",          
                        TIME : 30,
                        ATTR : {
                            "7004" : -15,
                        },          
                        NEXT : "S5",
                    },
                    {
                        NAME : "尝试调查",
                        TIME : 60,                                  
                        NEXT : "S6",
                    }
                ],
            }, 
             "S5" : {
                TYPE : 3,
                NAME : "陡坡",
                PIC : "Texture/Monster/1201",
                DESC : "过分小心，脚下一滑，受了些轻伤。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S7",
                    },
                ],
            }, 
             "S6" : {
                TYPE : 3,
                NAME : "陡坡",
                PIC : "Texture/Monster/1201",
                DESC : "在这里稍作调查后，并没有发现什么异常。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S7",
                    },
                ],
            }, 
             "S7" : {
                TYPE : 3,
                NAME : "陡坡中段",
                PIC : "Texture/Monster/1201",
                DESC : "陡坡中段有一块异样，要试试接触看看吗？",//关卡进入描述
                STORY : [
                    {
                        NAME : "谨慎通过",          
                        TIME : 10,                  
                        NEXT : "S8",
                    },
                    {
                        NAME : "尝试接触",
                        TIME : 20,                                  
                        NEXT : "S9",
                    }
                ],
            }, 
             "S8" : {
                TYPE : 3,
                NAME : "陡坡中段",
                PIC : "Texture/Monster/1201",
                DESC : "你继续沿着陡坡前进，不知不觉通过了陡坡。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S10",
                    },
                ],
            }, 
             "S9" : {
                TYPE : 3,
                NAME : "陡坡中段",
                PIC : "Texture/Monster/1201",
                DESC : "尝试接触，听到异响后，并没有发生。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S15",
                    },
                ],
            }, 
            "S10" : {
                TYPE : 1,
                NAME : "环尾狐猴",
                PIC : "Texture/Monster/1045",
                MONSTER : [1045,1045],
                DANGER : "9",
                DROP_ID : 8002,
                DESC : "你感觉身后有些异样，回头一看是一群环尾狐猴",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了环尾狐猴",//关卡战斗结束描述
                NEXT : "S11",
            },
             "S11" : {
                TYPE : 2,
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0"],
                DROP_ID : 8003,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                NEXT : "S12",
            }, 
             "S12" : {
                TYPE : 3,
                NAME : "风洞",
                PIC : "Texture/Monster/1201",
                DESC : "完成采集后，似乎可以在这里修整一下状态。",//关卡进入描述
                STORY : [
                    {
                        NAME : "休息整顿",          
                        TIME : 60,
                        ATTR : {
                            "7005" : -15,
                        },  
                        NEXT : "S13",
                    },
                    {
                        NAME : "继续前进",
                        TIME : 20,           
                        NEXT : "S14",
                    }
                ],
            }, 
             "S13" : {
                TYPE : 3,
                NAME : "风洞",
                PIC : "Texture/Monster/1201",
                DESC : "休息片刻后，你似乎受了x些风寒风寒。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S14",
                    },
                ],
            }, 
             "S14" : {
                TYPE : 3,
                NAME : "危桥",
                PIC : "Texture/Monster/1201",
                DESC : "出现危桥",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S20",
                    },
                ],
            }, 
            "S15" : {
                TYPE : 1,
                NAME : "环尾狐猴",
                PIC : "Texture/Monster/1045",
                MONSTER : [1045,1045],
                DANGER : "9",
                DROP_ID : 8002,
                DESC : "你感觉身后有些异样，回头一看是一群环尾狐猴",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了环尾狐猴",//关卡战斗结束描述
                NEXT : "S16",
            },
             "S16" : {
                TYPE : 2,
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0"],
                DROP_ID : 8003,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                NEXT : "S17",
            }, 
             "S17" : {
                TYPE : 3,
                NAME : "风洞",
                PIC : "Texture/Monster/1201",
                DESC : "完成采集后，似乎可以在这里修整一下状态。",//关卡进入描述
                STORY : [
                    {
                        NAME : "休息整顿",          
                        TIME : 60,
                        ATTR : {
                            "7005" : -15,
                        },  
                        NEXT : "S18",
                    },
                    {
                        NAME : "继续前进",
                        TIME : 20,           
                        NEXT : "S20",
                    }
                ],
            }, 
             "S18" : {
                TYPE : 3,
                NAME : "风洞",
                PIC : "Texture/Monster/1201",
                DESC : "休息片刻后，你似乎受了x些风寒风寒。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S19",
                    },    
                ],
            }, 
             "S19" : {
                TYPE : 3,
                NAME : "危桥",
                PIC : "Texture/Monster/1201",
                DESC : "出现危桥",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 30,
                        COND : ["4114","S21"],//满足条件
                        NEXT : "S22",
                    },          
                ],
            }, 
             "S20" : {
                TYPE : 3,
                NAME : "危桥",
                PIC : "Texture/Monster/1201",
                DESC : "通过危桥",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S23",
                    },    
                ],
            }, 
             "S21" : {
                TYPE : 3,
                NAME : "危桥",
                PIC : "Texture/Monster/1201",
                DESC : "危桥坠落，看来需要重新点燃火把。",//关卡进入描述
                STORY : [
                    {
                        NAME : "点燃火把",          
                        TIME : 30,             
                        NEXT : "S36",
                    },
                    {
                        NAME : "继续前进",
                        TIME : 10,           
                        NEXT : "S38",
                    }
                ],
            }, 
             "S22" : {
                TYPE : 3,
                NAME : "危桥",
                PIC : "Texture/Monster/1201",
                DESC : "危桥坠落",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S38",
                    },    
                ],
            }, 
             "S23" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8004,
                DESC : "你感觉身后有些异样，回头一看是一群哲罗蛙",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了哲罗蛙",//关卡战斗结束描述
                NEXT : "S24",
            },
             "S24" : {
                TYPE : 3,
                NAME : "长廊前段",
                PIC : "Texture/Monster/1201",
                DESC : "陡坡中段有一块异样，要试试接触看看吗？",//关卡进入描述
                STORY : [
                    {
                        NAME : "停下调查",          
                        TIME : 45,                  
                        NEXT : "S25",
                    },
                    {
                        NAME : "强行通过",
                        TIME : 10,    
                        ATTR : {
                            "7004" : -20,
                        },                      
                        NEXT : "S26",
                    }
                ],
            }, 
             "S25" : {
                TYPE : 3,
                NAME : "长廊前段",
                PIC : "Texture/Monster/1201",
                DESC : "你花费了一点时间解除了陷阱",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S27",
                    },
                ],
            }, 
             "S26" : {
                TYPE : 3,
                NAME : "长廊前段",
                PIC : "Texture/Monster/1201",
                DESC : "通过时你不慎触发了机关，受了些伤。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S27",
                    },
                ],
            }, 
             "S27" : {
                TYPE : 3,
                NAME : "长廊后段",
                PIC : "Texture/Monster/1201",
                DESC : "长廊中有异样",//关卡进入描述
                STORY : [
                    {
                        NAME : "避开",          
                        TIME : 15,          
                        ATTR : {
                            "7000" : -20,
                        },                          
                        NEXT : "S28",
                    },
                    {
                        NAME : "通过",
                        TIME : 10,              
                        NEXT : "S29",
                    }
                ],
            }, 
             "S28" : {
                TYPE : 3,
                NAME : "长廊后段",
                PIC : "Texture/Monster/1201",
                DESC : "虽然避开了浅坑，但是感觉筋疲力尽",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S30",
                    },
                ],
            }, 
             "S29" : {
                TYPE : 3,
                NAME : "长廊后段",
                PIC : "Texture/Monster/1201",
                DESC : "从浅坑上跳了过去，没有什么异常。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "S30",
                    },
                ],
            }, 
            "S30" : {
                TYPE : 1,
                NAME : "未知怪物",
                PIC : "Texture/Monster/1042",
                MONSTER : [1042],
                DANGER : "10",
                DROP_ID : 8006,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "S31",
            },
             "S31" : {
                TYPE : 3,
                NAME : "石室",
                PIC : "Texture/Monster/1201",
                DESC : "你进入了一个奇怪的石室，发了一些东西。",//关卡进入描述
                STORY : [
                    {
                        NAME : "太阳大门",          
                        TIME : 15,                              
                        NEXT : "S32",
                    },
                    {
                        NAME : "月亮壁画",
                        TIME : 10,              
                        NEXT : "S34",
                    }
                ],
            }, 
            "S32" : {
                TYPE : 1,
                NAME : "伪BOSS",
                PIC : "Texture/Monster/1041",
                MONSTER : [1041],
                DANGER : "12",
                DROP_ID : 8007,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "S33",
            },
             "S33" : {
                TYPE : 3,
                NAME : "太阳神殿",
                PIC : "Texture/Monster/1201",
                DESC : "你战胜了怪物，但总觉得有什么不对。",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",          
                    },
                ],
            }, 
             "S34" : {
                TYPE : 3,
                NAME : "月亮壁画",
                PIC : "Texture/Monster/1201",
                DESC : "你来到壁画前，打算查看一番。",//关卡进入描述
                STORY : [
                    {
                        NAME : "查看",          
                        TIME : 60,
                        NEXT : "S35",
                    },
                ],
            }, 
            "S35" : {
                TYPE : 3,
                NAME : "月亮壁画",
                PIC : "Texture/Monster/1201",
                DESC : "壁画描绘了很多东西，但你似乎看不懂，看来得去太阳大门。",//关卡进入描述
                STORY : [
                    {
                        NAME : "查看",          
                        TIME : 60,
                        NEXT : "S31",
                    },
                ],
            }, 
             "S36" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8004,
                DESC : "危桥坠落引来了怪物。",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "S37",
            },
             "S37" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8005,
                DESC : "危桥坠落引来的怪物不止一批。",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "S40",
            },
             "S38" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8004,
                DESC : "危桥坠落引来了怪物。但在黑暗中你无法看清是什么。",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "S39",
            },
             "S39" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8005,
                DESC : "危桥坠落引来的怪物不止一批。但在黑暗中你无法看清是什么。",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "S40",
            },
             "S40" : {
                TYPE : 3,
                NAME : "暗流",
                PIC : "Texture/Monster/1201",
                DESC : "前方似乎有出口。赶快离开这里回家修养。",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",          
                    },
                ],
            }, 
             "M1" : {
                TYPE : 3,
                NAME : "月亮拱门",
                PIC : "Texture/Monster/1201",
                DESC : "你进入了刻有月亮图样的石门，感觉到一阵眩晕（存档已保存）。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "M3",
                    },
                    {
                        NAME : "休息片刻",
                        TIME : 60,        
                        ATTR : {
                            "7000" : 30,
                        },                      
                        NEXT : "M2",
                    }
                ],
            }, 
             "M2" : {
                TYPE : 3,
                NAME : "月亮拱门",
                PIC : "Texture/Monster/1201",
                DESC : "休息片刻后，你的状态得到了恢复。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "M3",
                    },
                ],
            }, 
            "M3" : {
                TYPE : 2,
                NAME : "箱子",
                PIC : "Texture/Monster/1211",
                OPEN_WAYS : ["0"],
                DROP_ID : 8001,
                DESC : "一只人工制造的木箱，外形较为完好，不知道里面有些什么",//关卡进入描述
                DESC1 : "努力开启中...",//关卡战斗中描述
                DESC2 : "你成功开启了箱子",//关卡战斗结束描述
                NEXT : "M4",
            },
             "M4" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "你在你面前出现了一个阶梯，但是看上去不是很稳？",//关卡进入描述
                STORY : [
                    {
                        NAME : "快速通过",          
                        TIME : 10,                  
                        NEXT : "M5",
                    },
                    {
                        NAME : "谨慎慢行",
                        TIME : 60,                                         
                        NEXT : "M6",
                    }
                ],
            }, 
             "M5" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "你花费了一点时你快速通过了阶梯，似乎没有什么问题",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "M7",
                    },
                ],
            }, 
             "M6" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "你慢慢通过了阶梯，似乎没有什么问题。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "M7",
                    },
                ],
            }, 
             "M7" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "阶梯的底部有一个不知名的东西，似乎看上去是个机关。",//关卡进入描述
                STORY : [
                    {
                        NAME : "破坏机关",          
                        TIME : 100,                  
                        NEXT : "M8",
                    },
                    {
                        NAME : "强行通过",
                        TIME : 10,                                         
                        NEXT : "M9",
                    }
                ],
            }, 
             "M8" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "虽然花了些时间，但是机关被你破坏了。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                        NEXT : "M10",
                    },
                ],
            }, 
             "M9" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "机关发动了，你受了伤，好在机关年久失修，伤势不太重。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 10,
                         ATTR : {
                            "7004" : -30,
                        },                               
                        NEXT : "M10",
                    },
                ],
            }, 
             "M10" : {
                TYPE : 1,
                NAME : "环尾狐猴",
                PIC : "Texture/Monster/1045",
                MONSTER : [1045,1045],
                DANGER : "9",
                DROP_ID : 8002,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M11",
            },
            "M11" : {
                TYPE : 3,
                NAME : "平台",
                PIC : "Texture/Monster/1201",
                DESC : "通过阶梯，你来到了一个平台。",//关卡进入描述
                STORY : [
                    {
                        NAME : "四处查看",          
                        TIME : 10,
                        NEXT : "M12",
                    },
                ],
            }, 
             "M12" : {
                TYPE : 3,
                NAME : "阶梯上端",
                PIC : "Texture/Monster/1201",
                DESC : "你四处观察了一下，发现了一个风洞。",//关卡进入描述
                STORY : [
                    {
                        NAME : "前往风洞",          
                        TIME : 10,                  
                        NEXT : "S16",
                    },
                    {
                        NAME : "攀爬石壁",
                        TIME : 100,                                         
                        NEXT : "M13",
                    }
                ],
            }, 
             "M13" : {
                TYPE : 3,
                NAME : "石壁",
                PIC : "Texture/Monster/1201",
                DESC : "你沿着石壁向下爬去，最终发现一处破裂的墙壁。",//关卡进入描述
                STORY : [
                    {
                        NAME : "钻进裂缝",          
                        TIME : 30,
                        NEXT : "M14",
                    },
                ],
            }, 
            "M14" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "石室中分别两扇门，门上有着飞鸟和彩云的图腾。走哪边？",//关卡进入描述
                STORY : [
                    {
                        NAME : "飞鸟图腾",          
                        TIME : 30,                  
                        NEXT : "M17",
                    },
                    {
                        NAME : "彩云图腾",
                        TIME : 30,                                         
                        NEXT : "M18",
                    }
                ],
            }, 
             "M15" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "石室中分别两扇门，门上有着人像和走兽的图腾。走哪边？",//关卡进入描述
                STORY : [
                    {
                        NAME : "人像图腾",          
                        TIME : 30,                  
                        NEXT : "M19",
                    },
                    {
                        NAME : "走兽图腾",
                        TIME : 30,                                         
                        NEXT : "M20",
                    }
                ],
            }, 
             "M16" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "石室中分别两扇门，门上有着蛮鱼和珊瑚的图腾。走哪边？",//关卡进入描述
                STORY : [
                    {
                        NAME : "蛮鱼图腾",          
                        TIME : 30,                  
                        NEXT : "M21",
                    },
                    {
                        NAME : "珊瑚图腾",
                        TIME : 30,                                         
                        NEXT : "M22",
                    }
                ],
            }, 
            "M17" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8004,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M15",
            },
            "M18" : {
                TYPE : 1,
                NAME : "哲罗蛙",
                PIC : "Texture/Monster/1044",
                MONSTER : [1044,1044],
                DANGER : "10",
                DROP_ID : 8004,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M14",
            },
            "M19" : {
                TYPE : 1,
                NAME : "石像",
                PIC : "Texture/Monster/1043",
                MONSTER : [1043],
                DANGER : "12",
                DROP_ID : 0,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M16",
            },
            "M20" : {
                TYPE : 1,
                NAME : "石像",
                PIC : "Texture/Monster/1043",
                MONSTER : [1043],
                DANGER : "12",
                DROP_ID : 0,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M14",
            },
            "M21" : {
                TYPE : 1,
                NAME : "石像",
                PIC : "Texture/Monster/1043",
                MONSTER : [1043],
                DANGER : "12",
                DROP_ID : 8006,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M23",
            },
            "M22" : {
                TYPE : 1,
                NAME : "石像",
                PIC : "Texture/Monster/1043",
                MONSTER : [1043],
                DANGER : "12",
                DROP_ID : 0,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M15",
            },
            "M23" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "新的石室里似乎没有图腾，只有一扇门",//关卡进入描述
                STORY : [
                    {
                        NAME : "穿越石室",          
                        TIME : 10,                  
                        NEXT : "M24",
                    },
                    {
                        NAME : "四处查看",
                        TIME : 60,                                         
                        NEXT : "M25",
                    },      
                ],
            }, 
             "M24" : {
                TYPE : 3,
                NAME : "出口",
                PIC : "Texture/Monster/1201",
                DESC : "你从石室中穿越了出来，终于离开了遗迹",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",              
                    },
                ],
            }, 
             "M25" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "你在石室角落发现了一个与其他不同的石砖。",//关卡进入描述
                STORY : [
                    {
                        NAME : "查看机关",          
                        TIME : 30,                          
                        NEXT : "M26",
                    },
                ],
            }, 
            "M26" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "石砖似乎可以转动，转动一下试试。",//关卡进入描述
                STORY : [
                    {
                        NAME : "顺时针转",          
                        TIME : 10,                  
                        NEXT : "M27",
                    },
                    {
                        NAME : "逆时针转",
                        TIME : 60,                                         
                        NEXT : "M28",
                    }
                ],
            }, 
             "M27" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "随着石室的墙壁升起，似乎新的路线出现了。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 30,                          
                        NEXT : "S31",
                    },
                ],
            }, 
             "M28" : {
                TYPE : 3,
                NAME : "未知石室",
                PIC : "Texture/Monster/1201",
                DESC : "随着石室的墙壁升起，新的路线出现了。",//关卡进入描述
                STORY : [
                    {
                        NAME : "继续前进",          
                        TIME : 30,                          
                        NEXT : "M29",
                    },
                ],
            }, 
            "M29" : {
                TYPE : 3,
                NAME : "隐藏石室",
                PIC : "Texture/Monster/1201",
                DESC : "你进入了一个奇怪的石室，发了一些东西。",//关卡进入描述
                STORY : [
                    {
                        NAME : "月亮大门",          
                        TIME : 10,                  
                        NEXT : "M30",
                    },
                    {
                        NAME : "太阳壁画",
                        TIME : 60,                                         
                        NEXT : "M34",
                    }
                ],
            }, 
             "M30" : {
                TYPE : 3,
                NAME : "隐藏石室",
                PIC : "Texture/Monster/1201",
                DESC : "你推了下月亮大门，但是似乎没有什么用",//关卡进入描述
                STORY : [
                    {
                        NAME : "返回",          
                        TIME : 30,
                        COND : ["4101","M31"],//满足条件
                        NEXT : "M29",
                    },          
                ],
            }, 
            "M31" : {
                TYPE : 3,
                NAME : "隐藏石室",
                PIC : "Texture/Monster/1201",
                DESC : "你想到随身携带的匕首，隔开了自己的皮肤，将血洒在了月亮上。",//关卡进入描述
                STORY : [
                    {
                        NAME : "推开大门",          
                        TIME : 10,   
                        ATTR : {
                            "7004" : -20,
                        },                               
                        NEXT : "M32",
                    },
                ],
            }, 
             "M32" : {
                TYPE : 1,
                NAME : "真BOSS",
                PIC : "Texture/Monster/1040",
                MONSTER : [1040],
                DANGER : "14",
                DROP_ID : 8008,
                DESC : "你感觉身后有些异样，回头一看是一群食人鱼",//关卡进入描述
                DESC1 : "",//关卡战斗中描述
                DESC2 : "你成功击败了食人鱼群",//关卡战斗结束描述
                NEXT : "M33",
            },
            "M33" : {
                TYPE : 3,
                NAME : "月亮神殿",
                PIC : "Texture/Monster/1201",
                DESC : "你战胜了怪物",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",                             
                    },
                ],
            }, 
             "M34" : {
                TYPE : 3,
                NAME : "太阳壁画",
                PIC : "Texture/Monster/1201",
                DESC : "你来到壁画前，打算查看一番。",//关卡进入描述
                STORY : [
                    {
                        NAME : "查看",          
                        TIME : 30,                          
                        NEXT : "M35",
                    },
                ],
            }, 
            "M35" : {
                TYPE : 3,
                NAME : "太阳壁画",
                PIC : "Texture/Monster/1201",
                DESC : "壁画上的内容隐晦，你似乎看不懂。还是回头看看的门",//关卡进入描述
                STORY : [
                    {
                        NAME : "返回",          
                        TIME : 30,                          
                        NEXT : "M36",
                    },
                ],
            }, 
            "M36" : {
                TYPE : 3,
                NAME : "月亮神殿",
                PIC : "Texture/Monster/1201",
                DESC : "门上的太阳图案似乎和一开始有些不同。",//关卡进入描述
                STORY : [
                    {
                        NAME : "推开大门",          
                        TIME : 30,                          
                        NEXT : "M37",
                    },
                ],
            }, 
             "M37" : {
                TYPE : 3,
                NAME : "离开",
                PIC : "Texture/Monster/1201",
                DESC : "你离开了",//关卡进入描述
                STORY : [
                    {
                        NAME : "离开",                             
                    },
                ],
            }, 
          

        },
        UNLOCK : [{TYPE : "1", VALUE : 19}, {TYPE : "2", VALUE : 1}],
        // UNLOCK : [{TYPE : "1", VALUE : 1}, {TYPE : "2", VALUE : 1}],//测试
    },

};

