// 
exports.getById = function(bid){
	// return dy.utils.clone(HY_TRAPS[bid.toString()]);
	return HY_TRAPS[bid.toString()];
};


var HY_TRAPS = {

	"1":{
		NAME : "鱼虾陷阱" , //制作时顶部显示的陷阱名字
		IMG :'Texture/Trap/pdi_1',	//陷阱主界面图
		DROP_DESC : "捕获到鱼虾，快来收取！",	//成功捕获时按钮左方文案
		TYPE : "1" ,		// 目前只有两种类型: 1 -- “表现形式为在合适的点点击命中”
		DURATION : 50,		// 耐久度
		ITEMS : {"4003" :1,"4004" :3},	//所需材料
		DROP : "2301",	//	成功捕获时的掉落box
		RATIO : 25,		//	成功获取猎物的基础成功率
		STEPS : [		// 各个阶段对应的资源图片，最后一个为完成的完整图片
			{IMG:'Texture/Trap/t1_1',DESC : "用树枝和藤条制作陷阱主体，收紧缝隙，否则鱼虾会漏网"},
			{IMG:'Texture/Trap/t1_2',DESC : "顶部的漏斗留一个适中的入口，让鱼虾能够被饵料吸引但不易逃出"},
			{IMG:'Texture/Trap/t1_3',DESC : "将两个制作完成的部件拼接起来并放一点诱饵。过一段时间来查看是否有猎物落入陷阱。"},
		]
	},

	"2":{
		NAME : "野兔陷阱" , //制作时顶部显示的陷阱名字
		IMG :'Texture/Trap/pdi_2',	//陷阱主界面图
		DROP_DESC : "捕获到野兔，快来收取！",	//成功捕获时按钮左方文案
		TYPE : "1" ,		// 目前只有两种类型: 1 -- “表现形式为在合适的点点击命中”
		DURATION : 70,		// 耐久度
		ITEMS : {"4003" :2,"4036" :2},	//所需材料
		DROP : "2302",	//	成功捕获时的掉落box
		RATIO : 25,		//	成功获取猎物的基础成功率
		STEPS : [		// 各个阶段对应的资源图片，最后一个为完成的完整图片
			{IMG:'Texture/Trap/t2_1',DESC : "制作钩形扳机寻找到大小契合的树枝，横截面的地方涂一些泥土伪装一下。"},
			{IMG:'Texture/Trap/t2_2',DESC : "制作套环了选用的藤条要结实，预留的大小要合适目标————野兔。"},
			{IMG:'Texture/Trap/t2_3',DESC : "将两个制作完成的部件拼接起来，不需要设置诱饵，但藤条绳索要掩饰好。过一段时间来查看是否有猎物落入陷阱。"},
		]
	},

	"3":{
		NAME : "飞禽陷阱" , //制作时顶部显示的陷阱名字
		IMG :'Texture/Trap/pdi_3',	//陷阱主界面图
		DROP_DESC : "捕获到飞禽，快来收取！",	//成功捕获时按钮左方文案
		TYPE : "1" ,		// 目前只有两种类型: 1 -- “表现形式为在合适的点点击命中”
		DURATION : 100,		// 耐久度
		ITEMS : {"4003" :3,"4036" :3,"4044" :3},	//所需材料
		DROP : "2303",	//	成功捕获时的掉落box
		RATIO : 25,		//	成功获取猎物的基础成功率
		STEPS : [		// 各个阶段对应的资源图片，最后一个为完成的完整图片
			{IMG:'Texture/Trap/t3_1',DESC : "制作一个金字塔形的鸟笼，树枝要用藤条扎牢。"},
			{IMG:'Texture/Trap/t3_2',DESC : "制作扳机要注意削尖以保证其敏感度。"},
			{IMG:'Texture/Trap/t3_3',DESC : "将两个制作完成的部件拼接起来并放一点诱饵。过一段时间来查看是否有猎物落入陷阱吧。"},
		]
	},


};